[{"title":"Hello World","date":"2016-12-19T04:37:06.000Z","path":"2016/12/19/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]},{"title":"","date":"2016-11-17T10:30:46.000Z","path":"2016/11/17/Untitled/","text":"nginxcd usr/local/src/tar -xvf nginx-1.11.6.tarhttps://github.com/arut/nginx-rtmp-modulegit clone https://github.com/arut/nginx-rtmp-module.git ./configure –prefix=/usr/local/nginx –add-module=/usr/local/src/nginx-rtmp-module –with-http_ssl_module –with-http_stub_status_module yum -y install pcre-devel make &amp;&amp; make install /usr/local/nginx/sbin/nginx/usr/local/nginx/sbin/nginx -s stop/usr/local/nginx/sbin/nginx -s quit/usr/local/nginx/sbin/nginx -s reopen/usr/local/nginx/sbin/nginx -s reload ps -elf|grep nginx netstat -antp service iptables stop nginx -V 可以查看原来编译时都带了哪些参数 原来的参数：–prefix=/app/nginx 添加的参数:–with-http_stub_status_module –with-http_ssl_module –with-http_realip_module步骤如下： 使用参数重新配置:./configure –prefix=/app/nginx -user=nobody -group=nobody –with-http_stub_status_module \\–with-http_ssl_module –with-http_realip_module \\–add-module=../nginx_upstream_hash-0.3.1/ \\–add-module=../gnosek-nginx-upstream-fair-2131c73/ 编译:make#不要make install，否则就是覆盖安装 https://github.com/arut/nginx-rtmp-module 替换nginx二进制文件:cp /app/nginx/sbin/nginx /app/nginx/sbin/nginx.bakcp ./objs/nginx /app/nginx/sbin/ location /stat { stub_status on; access_log off; allow all; } ./ffmpeg -re -i test.mp4 -c copy -f flv rtmp://192.168.3.9:1935/hls/test","tags":[]},{"title":"一生要做的事","date":"2016-07-10T02:25:44.000Z","path":"2016/07/10/一生要做的事/","text":"一生要做的事今生，你的感觉如何？你生命的表情是怎样的？选择权操之于你自己。我们的道路并不是一段漫长的旅程，最积极的态度就是，把活着的每一天都看做生命的最后一天。 生命的确是黑暗的，除非是有了激励；一切的激励都是盲目的，除非是有了知识；一切的知识都是徒然的，除非是有了工作；一切的工作都是空虚的，除非是有了爱。 离开多年后，重回一趟故乡从小背熟《乡愁》、《静夜思》，到老落叶归根。 故乡是那个离开之后才拥有的地方游子思归的故事太多了却没有一个因雷同而显得苍白 ###拜访你的恩师“如果你认识这行字，请感谢你的小学老师.“写在纽约一辆小车上的这句话,比他的轮子还要快地感动了不同过度的不同职业的人们.在每个热闹的心底,“传道,授业,解惑“的恩师都会被细细珍藏.“恩师“二字,不知会印发多少酸甜交织的回忆和无以言诉的感激.然而,毕业后,你四处奔波,云游天涯,你偶尔会在梦中看到恩师渐多的白发,可是你是否曾经沿着学生时代那熟悉的小路,去拜访一次你的恩师? ###珍藏一件凝聚情感的物品这是一则小故事： 老奶奶接到她10岁小孙子的一封信：“亲爱的奶奶，多谢您送我的您亲手为我编制的毛线套装。毛衣太小了，我把它送给小波。围巾太长了，我把它送给了阳阳，手套太大了，我把它送给了小岩。很可惜，那顶帽子对谁都不合适。它真是件漂亮的礼物，爱您的明明。” 可是如果20年，30年后，长大成人的明明从箱底翻出那顶“对谁都不合适的”帽子时，他会以怎样的心情怀念慈爱的老奶奶呢？ 我们也许无法计算自己使用过的物品，但总有那么几样东西牵动着记忆；我们也许无法理解别人的馈赠，然而历经周折，却始终不忍丢弃那些生命总的“宝物”。触景生情，睹物生情，人生的珍藏不外乎一个“情”字。 ###倾听大自然的声音面对大自然，有时不必要做什么有形的思考 仅仅做一种感情的沟通就够了 从这种交流中 你会感到有无形的力量潜入你的身体里 给你无限的信心和力量 探究其原因 也许是大自然太伟大太震撼人心了吧 它取之不尽用使不竭的力量的源泉 神秘而深邃 ###做一些你真的害怕的事 不论是爬山、跳伞还是坐大型过山车，做一些你真正害怕的事会克服恐惧，帮助你成长。 ###大声说出你的爱 多数人最大的问题不是不能爱,而是不能表达、沟通他们的爱。如果我们渴望爱的体验，如果我们想创造爱的关系，我们必须愿意去沟通我们的感觉。当我们学会了开放而真诚的沟通，人生的便因此改变了。 爱某个人就是去跟他沟通。 让你所爱的人知道你爱他们，你感激他们。永远不要害怕说出这三个奇妙的字：我爱你！ 永远不要放弃任何一个赞美他人的机会。 永远对你爱的人留下爱的语言—-那可能是你最后一次看到他们，如果你将要死去了，而你可以打一个电话，你会希望打给谁？你会说什么？…… 还有，你还在等什么？ ###向自己的极限进行一次挑战 年轻人拥有挑战自身极限的胆量、勇气和欲望，他们喜欢冒险–即使危险超出了想像。他们总是想：“总有一天我要征服……“至于为什么，却可能找不出答案，甚至以为仅仅是为了寻求快乐。 然而，有过人生阅历的人将超越极限视为寻求人生满足的需要–每个人都应以坚定的信心和运筹帷幄的胆识，回应生活的种种挑战。每一次超越自我都会有太多的收获–充满风险的崎岖小径、刺激身心的旅程、宏伟壮阔的景观、冲破桎梏的释怀，以及迈向新的人生目标的成就感。 ###凭吊古战场，感受苍凉和悲壮”浩浩乎，平沙无垠，不见人，河水萦带，群山纠纷。 黯兮惨悴，风悲日曛。 蓬断草枯，凛若霜晨。 鸟飞不下，兽铤亡群。 亭长告余曰：此古战场也。常覆三军，往往鬼哭，天阴则闻。” 唐代李华的一纸《吊古战场文》，似乎道尽了古战场留给后人的悲凉和壮阔。 所幸，我们生长在和平年代，无法体验战场上非生即死的血刃之争。但当你去赤壁怀古，无残存遗迹的古战场凭吊是，就会在绵延着的血雨腥风中，寻找到我们永远都不应丧失的东西：对生的意义的品悟、冲向厉刃的勇气，以及浸染黄沙的英雄气概……. ###每3至5年写一个小自传 不管你承认与否，记忆这东西始终是最薄弱而短暂的。你一定有过这样的体验，原本以为会植根于心灵身处的一些事情，过不了多久，期间的细节，以及你但是的感受就会一点一点地模糊起来。而写日记，或阶段性地写一个下自传，是记录人生历程的最佳工具。 ###亲手播种、收割一次 达尔文说，他曾由一直鸟的羽毛上收集来的种子培养出82株植物。 你曾否想过，世上有这么多种开花的植物（约25完种），让我们享受多种多样丰富的花、果和蔬菜，他们怎么能在没有人类助力下生长繁茂？在播种时撒下希望，在收获时心怀感激。播下一粒种子，你就在广褒的大地上留下一个印迹。 ###找到真正的友谊 ###追寻你生命中的导师 追求理想的人不会碰不到一个肯相信他的人。一定有这么一个人在等你，等你踏出适当的一步，进入他的感知范围。这个人或许就会成为你的导师—-你生命中的贵人。他能够洞察你的潜力，祝福你新的常识，让你在失落时，永远看到希望；让你在得意时，不要偏离轨道。他跟你一样深信你会横工，在平时是你学习的典范，并在特别的时刻，助你一臂之力。 一个美国人对生命中的“导师”做出了如下精辟论述：“上天在你的人生旅途上安排各种恩师，也许他们和你的相貌不同、声音不同、也许他们都不是你期望的类型。但重要的是，他们的见闻比你渊博，这就是你应该向他们学习的理由。如果你到现在还没发现恩师，那也没关系，只要张大眼睛，恩师一定会和你相逢，将会传授给你必须学习的经验教训。 ###体验另一种生活——在乡间居住数日，享受田园风光 好多年前我居住在乡间 居住在民歌的深处 笛声的背面在菱花盛开的7月 与我结伴而来的水鸟 一渐次深入梅雨的心境 呵~~水鸟—-我的伙伴 这样的夜晚请你不要飞离 在秋天到来之前 我们还要涉过一条很深的河 —–席云舒 ###为自己种一棵树——让生命在树中延续 毁弃一片森林是轻而易举的，而重造它们却需千百年，毁树将失去教员，失去人类赖以生存的大自然，而种树，则是为了你自己！ 请谨记德国作家黑塞的慧心良言： “每一棵树读是神圣之物，谁能和他们谈心，认真倾听他们的心曲，谁就能返璞归真。他们不向你喋喋不休的唠叨什么训诫和丹方，他们撇开个别象限，向你淳淳能教诲生命的原始真谛。” ###寻找失落的童心 纯净如水晶的心，你本来就拥有一颗。 你应该被小孩子引导“重新“去看这个你已经有定论的世界。你的心灵、你的声音、你的行为，会随着与孩子相处，而变得像个孩子。 长久以来，我们都失去了童心，失去了爱玩乐的天性，这是使我们不快乐的原因。小孩子和大人最大的不同，就是小孩子拥有一颗赤诚的心。他眼中的世界是美好的，他热爱这一切事物，且每一样东西都让他赞叹惊异。 塞尚说：“天真纯朴地接触自然，那是多么困难呀！人们须能像初生儿那样看世界。“和孩子们玩耍，不仅是要寻找快乐，而且要使自己保持一颗纯净的童心，并试着以孩童的眼睛看世界。 ###在长城上回眸历史 只要中国人在，不论几经沧桑，长城是不倒的。长城是中国的骄傲，中国的伤痕。不管将来的发展如何，长城作为一个多面的中国的象征仍会屹立在那儿；它又像一面镜子，映照出外部世界对中国社会和中国文化的异想蹁跹。 ###深情热烈地爱一次 墨西·门德尔松是德国知名作曲家门德尔松的祖父。他的外貌极其平凡，除了五短身材之外，还是个驼子。当他遇到美丽的弗西时，立即无药可救地爱上了她，但弗西却始终拒绝正眼看他。在即将离别的时候，墨西鼓足了勇气，他害羞地问弗西：“你相信姻缘天注定吗？“ 弗西盯着地板答了一句：“相信。“然后反问他：“你相信吗？“墨西回答：“你知道吗?每个男孩出生之前，上帝便会告诉他，将来要娶的是哪一个女孩。我出生的时候，上帝告诉我，我的新娘是个驼子。我向上帝恳求：’上帝啊！求你把驼背赐给我，再将美貌留给我的新娘。’“ 弗西的心被搅乱了。她把手伸向他，之后成了他最挚爱的妻子。 深情热烈地爱一次–也许你会受伤，但这是使人生完整的惟一方法。 ###一个人去旅行——真正享受独处之乐 纪伯伦告诉我们一个关于珍珠的故事。一只蚌对它附近的另一只蚌说：“我身体里边有个极大的痛苦。它是沉重的，圆圆的，我难受极了。“另一只蚌怀着骄傲的情绪答道：“感谢上天也感谢大海，我身体里边毫无痛苦，我里里外外都很健全。“这时有一只螃蟹经过，听到了两只蚌的对话，它对那只里里外外都很健全的蚌说：“是的，你是健全的，然而，你知道吗？你的邻居所承受的痛苦，乃是一颗异常美丽的珍珠。“ 对于杰出者来说，孤独就是蚌身体里的珍珠，忍耐痛苦的结果是得到那颗美丽绝伦的珍珠。其实，对于一些人来说，独处并不意味着孤独，相反，他们把独处看成是难得的享受。 ###参加一次游行狂欢活动——感受激情与狂野 谁也无法忘记2001年7月13日北京申奥成功的那一刻。“中国赢了！““北京赢了！“ 一刹那间，就如一个喜炮炸响了，撼人心魄的欢呼声淹没了天安门广场所有的一切。几乎与此同时，无数焰火腾空而起，璀璨的礼花竞相开放在湛蓝深邃的夜空。世纪坛上的电子显示屏上打出了几个巨大的鲜红的字：“热烈庆祝北京申奥成功“–但“热烈“二字已完全不能形容此时的场景。不是“热烈“，而是“狂喜“。世界上似乎只剩下了声音：声嘶力竭的欢呼声，震耳欲聋的礼炮声，万众雀跃的顿地声。没有人能听见身边的人说什么，只看到所有的人都在狂跳，在鼓掌，在拥抱。人们已经不能互相听到，只能互相看到，看到狂喜像花一样在每一个人的脸上怒放…… ###见一个你心中景仰的名人 我是个偶像的崇拜者哟！ 我崇拜太阳，崇拜山岳，崇拜海洋； 我崇拜水，崇拜火，崇拜火山，崇拜伟大的江河； 我崇拜生，崇拜死，崇拜光明，崇拜黑夜； 我崇拜苏彝士，巴拿马，万里长城，金字塔； 我崇拜创造的精神，崇拜力，崇拜血，崇拜心脏； 我崇拜炸弹，崇拜悲哀，崇拜破坏； 我崇拜偶像破坏者，崇拜我！ 我又是个偶像破坏者哟！ –郭沫若 ###利用21天时间改掉一个不好的习惯 培根在《论习惯》中告诫我们：“人的思考取决于动机，语言取决于学问和知识，而他们的行动，则多半取决于习惯。“习惯的养成，并非一朝一夕之事；要想改正某种不良习惯，也不可以一蹴而就。有关专家研究发现，一般人要想改掉一个旧习惯，大概需要三个星期的时间。你必须给自己一段时间，来改掉你的坏习惯，如做事拖拉、不拘小节，甚至吸烟等等，然后以更好的方式取而代之。 你不要对改掉坏习惯这一点既向往不已，又心存疑惑，生活里要改进的地方很多，只要你做了，就会达到目的。 ###到施工工地等地方与普通劳动者生活一天、 你是否还是一个不谙世事、激情万丈的青年？你是否整日坐在办公室里，悠然地消磨时光？你是否只专注于个人事业的拓展，忽略了周围的众生？你是否已位高权重，他人对你仰而视之？那么，请走入一个普通劳动者的生活，喝一杯脏水，吃一顿蒙着灰尘的午饭，到他们栖身的低矮小屋中看一看，你会从另一个角度来认识自己，从而强化自己成就事业的毅力、信心和克服困难的勇气，以及别人对你的信任与认同。 ###每天阅读15分钟 阅读，应该成为每个人生活的一部分。如果你沉浸于书中，就会体验到文字是多么重要的东西。在所谓的信息时代，分散人们注意力的事情太多了：电视、互联网，以及各种游乐活动，以至于许多人忘记了阅读的乐趣和那种使人流连忘返的享受。 美国前总统罗斯福的夫人曾说：“我们必须让我们的青年人养成一种能够阅读好书的习惯，这种习惯是一种宝物，值得双手捧着，看着它，别把它丢掉。“每天阅读15分钟，这意味着你将一周读半本书，一个月读两本书，一年读大约20本书，一生读1000本或超过1000本书。这是一个简单易行的博览群书的办法。如果专注于某一领域，你会在几年内就轻松地成为一名学识广博的专家。 ###每天抽出一点时间和家人在一起、 我们常常匆匆忙忙走到路的尽头，才发现自己忽略了一路的风景。生活的重负、工作的压力似乎剥夺了我们享受生活的权利。慢慢地，你开始变得烦躁、疲倦、郁郁寡欢，而你的家人–那些最在乎你、关心你、爱你的人，也因你的忙碌而生活在期盼、等待之中。 古希腊哲学家德谟克利特说：心灵应习惯于在自身中汲取快乐。每天早一小时回家，和家人共享天伦之乐吧！这一小时将价值几何？ ###培养某种个人爱好 “沉浸“的另一种说法可以是“迷失“，如果你拥有一种爱好，常会体味到“迷失“之乐。 当你专注于自己的爱好时，大脑好像停止运作了–再没有什么活动能让大脑休息得这么彻底。 ###学会一种乐器 许多人都一直想拥有一件乐器，然后学会它，钢琴、小提琴、吉他、琵琶……在点着烛光的房间里，可以尽情地为自己、为亲人演奏，这是多么美妙的境界啊！当然，对于大多数人来说，欣赏音乐亦是一种人生的极致。心情不好时听一段钟情的音乐，消磨一个下午，让自己的思绪随着音乐飘荡、缓缓地进入梦乡，一觉醒来，发现烦恼已烟消云散。 音乐是一种心境，它会为你的生活装点出神奇的色彩。 ###观察众生百态，品味生之乐趣 一位诗人曾说：人生中重要的往往是迂回的羊肠小径，而非直达目标的阳光大道。的确，人生的幸福和欢乐就蕴藏于平凡生活的细微处，当你饶有兴致地站在街道边望街景，当你偶然间迷路，当你在旅途中绕路而行……你就会发现最美妙的人生景致，以及最美好的自己。 ###常回家看看父母 父母住在哪儿，哪儿就是我们的家，那里是我们永远的驿站，纵使我们浪迹天涯，心却永远走不出那个家。而且，父母也站在家门口，对我们翘首以盼…… 常回家看看，来保持这份亲情；常回家看看，来体现这份孝心；常回家看看，来延续这份无止无尽的爱。 ###为往事干杯——参加一次同学聚会 与多年不见的同学相聚，会满足我们心底温馨的怀旧情结，使我们感到自己不仅仅拥有一个现实，同样还拥有一部历史。 在这部历史大书里，印有你青春时代的照片。仔细端详这张老照片，你在感慨光阴似箭的同时，又为自己拥有今日的生活而感到自豪。在同学聚会的日子里，你变得年轻而充满朝气。这时候你记忆之中的往事几乎都是美好的，时间成了一只巨大的过滤器，那些遥远的回忆令你激动不已，甚至那些令人不快的往事，都早已被蒸发掉了。 ###到你所心仪的地方去旅行 当我已准备好最优美的翔姿，亲爱的大自然，我即将开始我的旅程。这一生的时间，我能否走遍万水千山…… 当我的心中萦绕着朝圣的热忱，神明的祖先，请允许我找到真知的源泉。这一生的时间，我能否谒遍世间奇观…… 当熟悉的风物盈于眼前，我梦中的香格里拉，你将在哪儿出现?这一生的时间，我能否看遍春月秋风，任红尘滚滚，光阴荏苒…… ###在陌生环境中用自己的谋生技艺生存一段时间 如果你很年轻，想没想过不带钱或带很少的钱到陌生的环境中，运用自己的谋生技艺生存一段时间?这对你而言，是一种生存能力的检验。 有这样一个故事：一个人在尚未进入大学之前，他想为自己安排一趟海外学习之旅。他背着背包，带着少许的钱，来到一个非洲不知名的小岛上。这个小岛拥有淳朴的民风、自然的景致，让人心旷神怡。离开前，他想为自己买些纪念品。于是他用10美金买了一大袋咖啡豆。因为一些意外，他的钱不见了。他身上只剩下这一袋咖啡豆。他居然靠着贩卖这袋咖啡豆游遍欧洲！所以，他决定暂缓自己的学业，专心地开发咖啡豆的事业，现在，他已成为世界有名的咖啡商人。 ###保持美满婚姻 几个女人在议论男人，嘻嘻哈哈。琴说，我也讲一个男人吧。那年3月，有个女人住进医院，被诊断为癌症。春天在她眼前黯淡了。丈夫来陪护，见了医生护士、亲朋好友仍是谈笑风生，上下楼梯依然风风火火，女人躺在床上就有些怨恨：我都不知道能不能活过今年，你还能笑得出声来！半个月后医生来查房说，复诊不是癌症。男人的眼泪刷地淌了满脸，他一把握住医生的手，摇着，只是摇着，一句话也说不出来。 琴说，那天我软软地从床上起来，第一个念头就是：若有来生，不嫁别人。 无人再嬉笑…… 请仔细地品读你的婚姻，仔细地审视婚姻中的你自己，再以充满欣赏的目光品察陪伴了你若干个平淡日子的他(她)。婚姻之舟停泊在风平浪静的水面上–它是脆弱的，除非它承载着满舱的深情与爱恋。为了保持美满婚姻，付出你的努力吧! ###为父母按摩、擦身 有一首名为《甜蜜负担》的诗写道： “世界上有一种人/和你在一起的时候/总是千万次嘱咐你要多穿件衣服，要注意自己的安全/你觉得很烦/却也觉得很温暖/缺钱的时候/他总会说些赚钱不易之类的话来训你/边训你/边塞钱给你/这种人/叫做父母。“ 父亲和母亲将爱的光辉洒向我们，照亮了我们的生活。我们拿什么奉献给我们的爹娘？仅仅有孝心是远远不够的，能使父母感受得到的关怀，是那种体贴入微的孝行。 ###独自在远离人烟的旷野露宿 多年来人类已经经历了许多不可置信的事物，接纳了无数的危险任务，甘冒测试耐力极限的风险。你是否相信自己若被迫处在极境，也能像其他人一样生存？你是否敢于在面对旷野的挑战之际，测试你的极限、你的能力、你的耐力、你的知识和你的勇气？ 你应该像印第安人所说的那样：你的双脚应该迅如闪电，你的手臂应如万钧雷霆，你的灵魂应无所畏惧。 ###到天安门广场观看一次升旗仪式 每天清晨，在天安门广场，国旗座杆周围站满了前来观看升旗仪式的人们。宁静的广场，人们的心却不平静，他们期待着一个神圣庄严时刻的到来。 6名护卫队员从天安门中心拱形城门整齐走出，英姿飒爽，步伐矫健。护卫队踏上金水桥，军乐团奏出了豪迈响亮的《歌唱祖国》的乐曲。方队穿过长安街，来到国旗座杆台下。36名队员分东西两侧站立，护旗手和升旗手登上升旗台。只听护卫队长一声令下，军乐团齐奏国歌，鲜艳夺目的五星红旗在天安门广场冉冉升起。 也就在同一时刻，祖国东海地平线升起了一轮圆圆红日。红日与国旗一起升起。经过127秒，国旗升到旗杆顶。一轮红日跃出海面，照红了祖国的万水千山。 ###尊重你的对手 我们需要朋友。我们也需要对手。 朋友可以从感情上带来最好的鼓励，对手则可以从理智上带来最深的刺激。善用对手的刺激，可以学到最重要的工作方法。 我们在情感上需要朋友，在知识上需要对手。有一个相互比较竞争的对手，往往可以带来长久的成长。 孟子说：“出无敌国外患者，国恒亡。“奥地利作家卡夫卡说：“真正的对手会灌输给你大量的勇气。“善待你的对手，方尽显品格的力量和生存的智慧。 ###偷得浮生半日闲——放慢生活步调 你每天怎么把自己的步调调得越来越快？由闹钟铃声响起的那一刻开始，你就滑向生活的跑道，像协和飞机一般以高速起飞。 今天，就为自己放个大假吧！想要如何度过都没有关系。睡个懒觉、读本好书、栽花种草、悠游漫步……是的，把你的节奏调慢一点，享受“闲“的境界。适时地释放心灵，这是一种最完美的享受。 ###倾听婴儿的第一声啼哭 在一个夏日的午后，台湾作家张晓风观察着湖边的几棵树飘散出的白色纤维，好似第一次遇见生命–即使是植物的生命。 “我感到那云状的种子在我心底强烈地碰撞上什么东西，我不能不被生命豪华的、奢侈的、不计成本的投资所感动。也许在不分昼夜的飘散之余，只有一颗种子足以成树，但造物者乐于做这样惊心动魄的壮举。 “我至今仍然在沉思之际想起那一片柔媚的湖水，不知湖畔那群种子中有哪一颗种子成了小树。至少，我知道有一颗已经成长。那颗种子曾遇见了一片土地，在一个过客的心之峡谷里，蔚然成荫，教会她，怎样敬畏生命。“ 礼赞生命吧!生命本身就是一个奇迹。而生为人，你应该以怎样虔诚的心珍惜与欣赏生命啊！ ###寻找久已失去联系的旧日朋友 岂能忘记旧日朋友，心中怎能不怀想，旧日朋友，岂能相忘，友谊地久天长； 我们曾经终日游荡，在故乡的青山上，我们也曾历尽辛苦，到处奔波流浪； 我们也曾终日逍遥，荡桨在绿波上，但如今却劳燕分飞，远隔大海重洋； 我们往日情意相投，让我们紧握手，我们来举杯畅饮，友谊地久天长…… –名曲《友谊地久天长》 ###从心底宽恕那个曾有负于你的人 宽恕就是适度地弯曲，但不折伤自己；宽恕就是承受创痛，并为自己疗伤。 拒绝原谅只会带来更多的伤害。何不卸下受难者的袈裟，做个宽恕的人。 宽恕，是祛伤解痛的惟一良方，是一项重要的求生技能。帮助你在一片误解、痛苦、怨怼与憎恨的狂乱中，找到方向。 且让宽恕打开和解之门。今天的敌人不难变为明日的朋友。 ###给孩子做出榜样 孩子是你生命的延续，你应该为培养孩子高尚的情操和健康的品格而不遗余力。孩子总是望着父母的脊背长大，因而最好的教育方式就是–言传身教。 以下两个故事都说明了为父母者的榜样行为带给孩子的力量。 迈克带着他三个兴高采烈的孩子来到剧院的售票处。”嗨！我要买4张票，1张大人票，3张儿童票。”他对售票的小伙子说道。 “先生，6岁以上的孩子要半票，6岁以下的孩子可以免费入场。” “那就买两张票，我最大的孩子杰尔斯今天刚好6岁，其余的两个是4岁的双胞胎。” 售票的小伙子将戏票递给迈克，忽然笑着说道：”其实，你如果不说，我根本看不出你的孩子是否超过6岁。” “可是，我的孩子们知道。”迈克正色说。 遗憾的是，现实生活中的许多父母在身教方面做得不够，甚至背道而驰，平时教育起孩子来头头是道，大道理一套一套的，但在具体行动中，或有意无意或自觉不自觉地溺爱着孩子，并对做父母的自己得过且过、放任自流。比如轮到让孩子自己做事的时候，有的父母总是不忍心让孩子受苦或不放心孩子，常常是百般拒绝并越俎代庖，无形中剥夺了孩子锻炼、学习的权利。更为教育所忌讳的是，有的父母在孩子面前说的是一套，背着孩子做的又是另一套。比如有的父母教育孩子树雄心、立壮志，自己却整天泡在麻将场上不出来；有的父母教育孩子诚实守信，自己做事却坑蒙拐骗，不择手段；有的父母教育孩子与人为善、文明礼貌，自己与人发生摩擦则常常污言秽语，甚至拳脚相加，如此等等。孩子耳闻目睹父母自相矛盾的言行，并受其潜移默化的不良影响，自然难以形成正确的立场、观点和为人处世的态度及行为规范。如此一来，即便是家长将教育孩子的道理讲得如何透彻和完美，也难免成为极其苍白和毫无说服力的东西。而与此形成鲜明对照的是，有些讲不出多少大道理的家长，能运用其高尚的人格魅力和表里如一、言行一致的行为，给孩子塑造出良好的个性心理和道德品质。 家教是一门艺术、一门学问，既极其深奥又十分简单。其核心关键是要求做父母的用言传身教去审慎地进行教育。在家庭环境中，父母的一言一行，孩子都耳濡目染，并极力仿效。要想使家教收到良好的效果，既要讲”言传”，更要讲”身教”。也就是说，父母在教育孩子过程中要身体力行，要求孩子做到的，自己必须首先做到。是谓：其身正，不令而行；其身不正，虽令不从也。父母是孩子的第一任教师，孩子是父母的影子。父母教育孩子，对于孩子来说，重要的不是看父母讲了多少道理，而要看父母怎样做，只要父母率先垂范做出榜样，其感召力和威力所产生的家教效果是不言而喻的。 英国诗人多萝西在《什么伴随着你的孩子》一诗中写道： 批评伴随着孩子，他学会谴责； 敌视伴随着孩子，他学会争斗； 惊恐伴随着孩子，他凄凄切切； 惋惜伴随着孩子，他嗟叹时运； 嘲弄伴随着孩子，他羞惭腼腆； 妒忌伴随着孩子，他学会羡慕； 责难伴随着孩子，他自愧自惭； 鼓励伴随着孩子，他信心日增； 宽容伴随着孩子，他坚韧不拔； 赞美伴随着孩子，他鉴赏有方； 认可伴随着孩子，他爱心常存； 称许伴随着孩子，他自爱自尊； 赏识伴随着孩子，他明白人生终当一搏； 分享伴随着孩子，他慷慨大度； 诚实与公正伴随着孩子，他领悟出真理与正义； 安定伴随着孩子，他信赖他人与自己； 友善伴随着孩子，他看见洒向人间都是爱； 假如宁寂伴随着您，孩子就心静似水，平和待人。 什么–伴随着您的孩子？ 为人父母者，做好孩子的榜样吧！ 1对孩子提出的所有问题，都耐心、老实地做出回答。 2认真对待孩子提出的看法。 3竖一个陈列架，让孩子在上面充分展示自己的作品。 4不因孩子房间里或者桌面上很乱而责骂他，只要这与他的创作活 动有关。 5给孩子一个房间或者房间的一部分，供他玩耍。 6向孩子说明，他本身已经很可爱，用不着再刻意表现。 7让孩子做力所能及的事情。 8帮孩子制订个人计划并想出完成计划的方法。 9带孩子到他感兴趣的地方去玩。 10帮助孩子修改作业。 11帮助孩子与来自不同社会文化阶层的孩子正常交往。 12家长养成合理的行为习惯并留心让孩子学着去做。 13从不对孩子说，他比别的孩子差。 14允许孩子参加计划家务和外出旅行。 15向孩子提供书籍和材料，让孩子干自己喜爱的事情。 16教孩子与各种年龄的成年人自由交往。 17定期为孩子读点东西。 18让孩子从小养成读书的习惯。 19鼓励孩子编故事和幻想。 20认真对待孩子的个人要求。 21每天都要抽时间和孩子单独在一起。 22不用辱骂来惩治孩子。 23不能因孩子犯错误而戏弄他。 24表扬孩子背诗、讲故事和唱歌。 25让孩子独立思考问题。 26制订详细的实验计划，帮助孩子了解更多的事情。 27允许孩子玩各种无毒废弃物。 28鼓励孩子发现问题，解决问题。 29在孩子干的事情中，不断寻找值得赞许的地方。 30不要空洞地、不真诚地表扬孩子。 31诚实地评价自己对孩子的感情。 32不存在家长完全不能与孩子讨论的问题。 33让孩子有机会真正做决定。 34帮助孩子成为有个性的人。 35帮助孩子寻找值得看的电视节目。 36发挥孩子积极认识自己的才干和能力。 37不对孩子的失败表示瞧不起。不妨对孩子说：”我也不会干这个。” 38鼓励孩子尽量不依赖成年人。 39相信孩子的理智并信任他。 40让孩子独立完成他所从事的工作的基本部分，哪怕不会有积极 的结果。 ###为自己拍个纪录片 看看镜头里的自己，告诉自己： “我欣赏我的生活。” “我欣赏我自己。” “我欣赏我的财富。” “我欣赏我的健康。” “我欣赏我的幸福。” “我欣赏我的充裕。” “我欣赏我的富有。” “我欣赏我的爱心。” “我欣赏我对人的关切。” “我欣赏我的与人分享。” “我欣赏我的学习。” “我欣赏我知道自己要什么。” “我欣赏我的机会。” “我欣赏我懂得享受乐趣。” “我欣赏我的平衡。” 有一个出家弟子跑去请教一位很有智慧的师父，他跟在师父的身边，天天问同样的问题：”师父啊，什么是人生真正的价值？”问得师父烦透了。 有一天，师父从房间拿出一块石头，对他说：”你把这块石头拿到市场去卖，但不要真的卖掉，只要有人出价就好了，看看市场的人肯出多少钱买这块石头。” 弟子就带着石头到市场，有的人说这块石头很大，很好看，就出价两块钱；有人说这块石头可以做秤砣，出价10块钱。结果大家七嘴八舌，最高也只出到10块钱。弟子很开心地回去，告诉师父：”这块没用的石头，还可以卖到10块钱，真该把它卖了。” 师父说：”先不要卖，再把它拿到黄金市场卖卖看，也不要真的卖掉。” 弟子就把这块石头拿到黄金市场卖，一开始就有人出价千元，第二个人出价万元，最后有人出到10万元。弟子兴冲冲地跑回去，向师父报告这不可思议的结果。 师父对他说：”把石头拿到最昂贵、最高级的珠宝商场去估价。” 弟子就去了。第一个开价就是10万，但他不卖，于是20万，30万，一直加到后来对方生气了，要他自己出价。他对买家说，师父不许他卖，就把石头带了回去，对师父说：”这块石头居然被出价到数十万。” 师父说：”是呀！我现在不能教你人生的价值，因为你一直在用市场的眼光在看待你的人生。人生的价值，应该是在一个人心中，先有了最好的珠宝商的眼光，才可以看到真正的人生价值。” 我们的价值，不在于外面的评价，而是在于我们给自己的定价。我们每一个人的价值都是绝对的。坚持自己崇高的价值，接纳自己，磨砺自己。给自己成长的空间，我们每个人都能成为”无价之宝”。 (佚 名) 你可以想出哪一种生物会觉得自己没有价值、低人一等？水仙绝不会环顾花园而想道：”我不如其他水仙漂亮。”臭鼬也绝不会羡慕其他的臭鼬说：”看它找到多大的食物啊！我从来不及它幸运。”鸟儿绝不会栖息在树枝上，聆听其他的鸟儿歌唱，然后叹息说：”我还是闭上嘴吧！我的歌声永远不如它的动听。” 大自然告诉你，任何生物都有其价值，有其重要性和贡献。爱默生曾说：”什么是野草？就是还没有发现用处的植物。”每一株水仙、每一只臭鼬、每一只鸣鸟–甚至每一根杂草，都以各种不同但美丽的方式，展现其潜能。每一种生物都有自己的表情、自己的香气、自己的能力、自己的技巧、自己的歌曲。只有人类会因为缺乏自尊而折磨自己。记住，学会欣赏自己。 学会欣赏自己，当我们比较欣赏自己的时候，会更多地得到别人的欣赏。不要先成为别人喜欢的样子，要先成为你自己喜欢的样子。你会喜欢一个不由自主、毫无选择能力、只能”自动”爱你的人，还是一个明白自己有很多选择，却”选择”爱你的人呢？哪一个更令你动容？你的选择也就是每一个人的选择。 首先，爱自己，但是你必须先了解自己，了解自己之后才知道如何爱自己，明白自己想要表达什么。 其次，培养优雅的举止。优雅不是”矫揉造作”，优雅是”以最少的能量创造最大的效益”。仔细注意镜头中的自己，看看自己的举止是否得体，微笑是否宜人，大胆地对自己品头论足一番，你如何观察别人，就如何观察自己。你要使自己看起来优雅脱俗，气度不凡，你才会成为别人眼中的一抹亮色。 第三，多做些你有信心可以完成的事，因为使自己完美的另一个要素就是”自信”。培养自信，你将会更加清楚地认识自己的价值，一个有价值又有自信的人怎么会没有魅力呢？但是，要明晰自信和自负之间的区别，自信是相信”我们都可以做到”，自负却是”只有我能做到”。 最后，成为天真的人。了解自己本质的人都是天真的，因为他们明了”真、善、美”是一体的，他们决定活在真理当中，同时，他们也活在”美”中。 选择一个自己热爱的职业听，纪伯伦为我们诠释工作的意义： 你们常听人说，工作是祸殃，劳动是不幸。 我却对你们说，你们工作的时候，你们完成了大地深远的梦之一部分，他指示你那梦是从何时开头的。 而在你劳动不息的时候，你确实爱了生命。 在工作里爱了生命，就是通彻了生命最深的秘密。 你们也听见人说，生命是黑暗的，在你疲劳之中，你附和了那疲劳的人所说的话。 我说生命的确是黑暗的，除非是有了激励。 一切的激励都是盲目的，除非是有了知识； 一切的知识都是徒然的，除非是有了工作； 一切的工作都是空虚的，除非是有了爱。 当你仁爱地工作的时候，你便与自己、与人类、与上帝结合为一体。 工作是眼睛能看见的爱…… 一个人的精力和才智是极其有限的。面面俱到者，终将一事无成。拿破仑曾说：”战争的艺术就是在某一点上集中最大优势兵力。”生活的艺术则是选择一个进攻的突破点，全力以赴地进行冲击。职业的选择不能听任自然，初出茅庐者都应该扪心自问：”我干什么合适，我具备什么能力？”如果力所不及，强求也是徒劳。如果你大胆又果敢，与其去坐办公室，倒不如去当飞行员。而选择一旦做出，除非发生错误或严重意外，你万万不可反悔。 常常有很多人会对自己的工作觉得沮丧、不满，而活得非常不快乐。但是如果我们想真正获得快乐，就该把工作当做是生活中的一种乐趣，而不是当做一种刻板、单调的苦差事。所以每当化妆师为新娘子化妆的时候，他会把它当做一件艺术品的创作，一边工作一边享受这种过程中的美感；每当画家完成自己的作品时，不但不会觉得疲倦，反而有时候会为自己所创造出来的美而感动。 人生就是一连串选择的过程，每一个人都应该选择一个比较适合自己的生活方式，选择职业更是如此。而且，当我们内心想要做某一件事情的时候，就要有一种无怨无悔的决心，不要三心二意、左顾右盼。如果我们每件事情都想做的话，结果可能一件事情也做不好。有一句话说：”多艺多思艺不精，专精一艺可成名。”这是我们应一直谨记在心的话。以一些职业女性为例，结婚生子以后，她们选择了家庭主妇以外的这种生活方式，因为她们觉得那样的生活方式比较适合自己，并且能使自己的生活更充实、更有意义。 不要后悔自己的选择，努力加上毅力，任何一件事情，都会开花结果。生活的快乐与否，完全掌握在自己的手中，当我们把工作变成生活中的一种乐趣时，那我们应乐在其中了。为快乐而工作–这就是无悔的选择。 从日常生活的小处着手，做个环保者“很久以前我丢失了一只猎犬，一匹栗色马和一只斑鸠，至今我还在追踪它们，我对许多旅客描述它们的情况、踪迹以及它们会响应怎样的召唤。我遇到过一两人，他们曾听见猎犬吠声、奔马蹄音，甚至还看到斑鸠隐入云中，他们也急于追寻它们回来，像是他们自己遗失了它们。”这是梭罗留在他的《瓦尔登湖》中的一则寓言。尽管他说”请原谅我说话晦涩”，还是有人跑去问他是什么意思，他反问：”你没有失去吗？” 回答比寓言更像寓言。其中一个对应的解释为：怎样做，才能不失去我们赖以生存的环境？我们与其说是应当去战胜和征服自然，不如说是要去做自然的朋友，与自然界达成某种和解，与所有其他种类的生命达成某种和解。否则，我们既无法追回所失， 也将留不住所拥有的。 我家附近有一个熟肉铺，有时我到铺里买些烤猪肉之类的食品，带回家当午饭。 我从来不用铺子里给的纸盒和塑料袋，而总是拿着一个方塑料盒去买食品，这样回到家后也省得再把盒子里的食品腾到碟子里。 我让老板娘给我割了一块肉。她微笑着对我说：”七块二毛五。”当我拿出钱包取钱时，她用赞许的语气说：”给七块钱吧！两毛五分就算了。我想鼓励人们增强保护环境的意识，也真希望每个人都能像你这样。”像学生得到校长的表扬一样，我高兴得发狂。并且我得到了一份小小的保护奖–她给了我两角五分的折扣。 你可能会说：两角五分算得了什么！可是我却很激动。回到家后，我就忍不住向人们夸耀我得到的这份奖金。我先给国外的儿子通了电话，把这件事告诉了他。我又向别人讲了又讲。家人对我的行为都迷惑不解。是啊，两角五分的奖金有什么特别呢？ 政治家总是在讲”热爱祖国”，在我看来，”热爱祖国”还是一种生活方式。这种热爱的具体体现是：节约能源、减少生活垃圾、不污染环境。 在我们所有污染环境的罪过中，最容易避免的就是塑料袋。我小的时候，大人们总是带着手工编制的竹篓到集市上买东西，豆腐和猪肉都包在绿色的荷叶里，它们最后都回到大地母亲的怀抱里。我还记得著名诗人余光中的几句诗，这几句诗是我的孩子还小的时候我教给他们的。 让我们用肥大的荷叶/包裹起皎洁的月亮带回家/把它夹在一本唐诗书里/压得平平展展/像思念亲爱的人那样。 真的，用来做包装的荷叶是多么美啊！我们还用竹叶来包米饭团。有时我们还可以看到山民们用中空的竹筒盛装米饭。 可是，我们现在使用的塑料袋和过去用的包装物是多么的不同啊！这也是我上集市时总带着塑料盒的原因。当然，保护环境的行为会给自己带来一些不便，但是这些不便不过是我们热爱祖国所付出的代价而已！常常有卖主问我为什么不要塑料袋时，旁边的人会代我解释：她要保护环境！ 我对他们的理解表示衷心的感谢。还有那两角五分的奖金，在我一生获得的奖金中，它是最宝贵的一次！ (张晓风) “只有当最后一棵树被刨，最后一条河中毒，最后一条鱼被捕，你们才会发觉，钱财不能吃……”这首古老的印第安人的歌谣，令人感慨万千。人与自然，就像是一对终身相守的夫妻，你对她多一分爱意，便会多得到一分温暖；你若是专横暴戾，报应便是冷酷无情的。我们漫不经心地将用过一次的易拉罐扔掉，却很少想过：大自然赐予了人类矿石，经冶炼变成金属，再经各种各样的工序，最终成为一个小小的金属罐。这中间包含着自然的多少厚爱，凝结着别人的多少劳动成果。而我们只是那么随手一扔！我们过分庞大的需要产生了过分庞大的工业，过分庞大的工业使得资源枯竭、环境污染，于是又需要追加人力和钱财去对付新的难题–一个忙得我们来不及思想的难题！ 保护大自然是我们共同的责任。在地球这叶生命的”方舟”正在下沉的今天，对环境的爱护已不仅仅是一种经济行为，而是一种道德行为。必须要用道德来约束和引导人类的环境行为。保护环境，随手可做，随处可做。 A.用布袋取代塑料方便袋； B.尽量乘坐公共汽车； C.步行或骑自行车； D.不使用非降解塑料餐盒； E.不燃放烟花爆竹； F.随手关闭水笼头；使用节水型水具；一水多用； G.随手关灯；使用节能性灯具； H.拒绝使用一次性用品，如一次性筷子； I.尽量使用可再生物品； G.在室内、院内养花种草； K.参加植树活动； L.节约用电，回收废纸； M.不乱扔废电池、废金属、废塑料、废玻璃； N.使用无氟冰箱； O.简化房屋装修； P.戒烟； Q.少吃口香糖； R.优先购买绿色产品； S.参加保护宣传，参与有关环保公益活动； T.旅游时，不污染环境； U.保护文物古迹； V.使用无铅汽油； W.及时举报破坏环境和生态的行为； X.关注环境新闻，了解有关的环保知识； Y.绝不做超生者； Z.简朴生活； …… ###与一个陌生人攀谈害怕陌生人的心理，很多人都会产生，例如在聚会上我们想不到有什么风趣或是言之有物的话可说的时候。事实上，无论何时何地，我们遇上看来有趣的陌生人时，心里都会七上八下，不知该怎样打开话匣子。然而，懂得怎样毫无拘束地与人结识，能使我们扩大朋友的圈子，使生活丰富起来。 和陌生人的谈话有许多是毕生难忘的–这就好像你不停地打开一些礼物盒，事前却完全不知道里面有什么。陌生人的引人入胜之处，就在于我们对他们一无所知。我们过去从来没有见过的人，还能帮助我们认识自己。因为我们可能对一个陌生人说出我们时常想说但又不敢向亲人或朋友说的心里话，他们因此便成了我们认识自己的一面新镜子。如果运气好，和陌生人的偶遇还会发展成为终身不渝的友谊。也许这句话真是正确的：”世界上没有陌生人，只有还未认识的朋友。” 我登上了南行的”151”号公共汽车，凭窗而望，芝加哥的冬日景色实在一无是处–树木光秃，积雪堆堆，汽车溅泼着污水泥浆前进。 公共汽车在风景区林肯公园里行驶了几公里，可是谁都没有朝窗外看。我们这些乘客穿着厚墩墩的衣服在车上挤在一起，全都给单调的引擎声和车厢里闷热的空气弄得昏昏欲睡。 谁都没做声。这是在芝加哥搭车上班的不成文规矩之一。虽然我每天碰到的人都是这些人，但大家都宁愿躲在自己的报纸后面。此举所象征的非常明显：彼此在利用几面薄薄的报纸来保持距离。 公共汽车驶近密歇根大道一排闪闪发光的摩天大厦时，一个声音突然响起：”注意！注意！” 报纸嗄嗄作响，人人伸长了脖颈。 “我是你们的司机。” 车厢内鸦雀无声，人人瞧着那司机的后脑勺，他的声音很威严。 “你们全都把报纸放下。” 报纸慢慢地放了下来。司机在等着。我们把报纸摺好，放在大腿上。 “现在，转过头去面对坐在你旁边的那个人。转啊!” 使人惊奇的是，我们全都这样做了。但是，仍然没有一个人露出笑容，我们只有盲目地服从。 我面对着一个年龄较大的妇人，她的头给红围巾包得紧紧的，我几乎每天都看见她。我们四目相对，目不转睛地等候司机的下一个命令。 “现在跟着我说……”那是一道用军队教官的语言喊出的命令，”早安，朋友！” 我们的声音很轻，很不自然。对我们其中许多人来说，这是今天第一次开口说话。可是，我们像小学生那样，齐声对身旁的陌生人说了这四个字。 我情不自禁地微微一笑，完全不由自主。我们松了一口气，知道不是被绑架或抢劫。而且，我们还隐约地意识到，以往我们怕难为情，连普通礼貌也不讲，现在这腼腆之情一扫而空。我们把要说的话说了，彼此间的界限消除了。”早安，朋友。”说起来一点也不困难。有些人随着又说了一遍，也有些人握手为礼，许多人都大笑起来。司机没有再说什么，他已无须多说。没有一个人再拿起报纸。大家开始都对这位古怪司机摇摇头，开始说话了，就互相讲述些别的搭车上班人的趣事。我听到了欢笑声，一种我在”151”号公共汽车上从未听到过的温情洋溢的声音。 公共汽车到了我要下车的那一站，我跟同座的妇人说声再见，然后一跃下车。另外4辆公共汽车也驶进站来，卸下乘客。这些上车下车的乘客全都像石头那样坐着–默不做声，一动不动，和我那辆汽车上的乘客完全两样。我微笑地看着我们车上乘客神采飞扬的面孔。我心情愉快地开始了这一天，比平时的日子有一个更好的开始。 我回过头来看那位司机。他正在看后视镜，准备把车从车站开出。他似乎并不知道，他刚创造了一个星期一早晨的奇迹。 （帕蒂·威甘德） 很多人都只局限于熟悉的几个朋友、同类的人。但他们一生都在希望能够与陌生人成为朋友，以拓展视野，激发对生活的敏感，却总是望而却步，害怕遭到拒绝。 许多人都想说别人期待我们说的话，而且觉得自己与别人不同就担心。然而正因为有这种不同，人生才能成为大舞台。如果我们彼此坦诚相对，不为别的而只为互相了解，那么我们就能谈得投机，相见欢愉。 与陌生人说话一开始就要切入主题，那些不着边际的空话和大惊小怪的问题只会惹人厌烦。你必须对陌生人正在进行的事情怀有衷心的关切，才能说出中肯的话来。然后你等待他的反应。他必定会做出反应，因为，他人的关切以及对他的工作表示兴趣，任何人都会感到无限快乐。没有人愿意将自己的珍宝展示给无动于衷的人。但是一旦他看到我们从他的谈话中获得极大乐趣，他就会尽力满足我们，以延长我们的快乐。他为什么要这么做？很简单，因为每个人都发现：他自己最大的快乐就是能够给人以快乐。 你完全可以为买东西时无法找钱的陌生人出零钱；在出租车上主动与司机聊天；更不要介意陌生人在街口不小心与你相撞……请相信，在陌生人的世界里，有着许多淳朴善良的心。一分善意，会换来十二万分的感动。 我们需要陌生人的刺激–一个跟我们不同，暂时是个谜的人。和陌生人见面还会多少对你有所影响。在最好的情况下，那彼此心灵相通、意气相投的感觉是令人难忘的，一次邂逅会成为你以后生命的一部分。 除此以外，与陌生人结识也许会使我们对世界有一些小贡献。因为我们可能因此不把那些起初看起来和我们不同的人当成外人，而把他们当做像我们一样的人。 这世界上有的是人。所以你要敞开心扉，享受友谊。 ###将心中的感激之情表达出来或许你今天可以施与受的最神奇礼物，就是真诚地感谢–感谢你周围的人、感谢上天赐予你健康的身体、感谢你所经历的种种经验、感谢你所能感受的情感、感谢你所能见的世界珍奇，感谢其他人对你的善行。 感激伤害你的人， 因为他磨炼了你的心志； 感激绊倒你的人， 因为他强化了你的双腿； 感激欺骗你的人， 因为他增进了你的智慧； 感激蔑视你的人， 因为他醒觉了你的自尊； 感激遗弃你的人， 因为他教会了你该独立； 学会感激– 感激一切使你成长的人！ 感激失败， 因为它使你成为了一个有故事的人； 感激成功， 因为它使你的生命铺满精彩，写满美丽； 感激掌声和鼓励， 因为它给你更大的能量和勇气！ 同时，也感激批判和挑战， 因为它警醒你自知、自治和自明。 凡事感激– 感激一切造就了你的人！ 亲手卖一件商品 每个人都可以是一位优秀的推销员，时时刻刻都在推销自我的理念，展现自我的风格。天下的人没有”是推销员”和”不是推销员”的区分，只有”优秀的推销员”和”不优秀的推销员”的差别。 一位到南方闯世界的小伙子，在应聘一家鞋厂的推销员工作时，因学历不够而被拒绝。他找到业务部经理，陈述自己的优势。经理最后说：”你等等吧，面试全部结束后，你再来试试。” 在等待时，小伙子做了一件事，他后来这样叙述道： “我又怀着希望站在厂门口等候。反正我也没其他地方可去。然而我的肚子却不让我安心等候，已经快11点了，又没有吃早餐，我早已饿得有气无力了。而面试的速度很慢，一个个填表、问话，到现在还有七八十个人排队等着，看样子起码要到下午四五点钟才能做完。这时我已经不敢指望去这家厂里吃午饭了。可是这家工厂附近只有一间杂货店。要吃饭得穿过公路，再向前走到很远的商业区去。我没那个心思跑老远去吃一顿饭，就忍住饥饿继续看那些大学生面试。看来他们也饿得不行了。许多人无力地靠在墙上，也许和我一样没吃早餐吧。但他们又不敢走远，怕错过了面试。有人唉声叹气地叫饿，说要是有人帮着买盒饭来就好了，可以给他脚钱。 听了这话，我不禁灵机一动，这可是个挣钱的机会啊！我走上前说：&apos;我帮你们买饭。&apos;他们像遇到救星似的，纷纷掏钱给我。他们主动给我跑腿的钱，我先是推辞，但我越推辞，他们越坚持要给，说帮人做事哪有不收钱的。我收了20多个人的钱，然后穿过公路走到商业区，找到一家快餐店，说要订60盒快餐，问价钱可不可以便宜一点，老板说：可以，5元一盒的4元给你。我说付一半的钱，你叫个伙计帮我把饭抬回去，顺便收那一半的钱，老板也答应了。 “我和那伙计将60盒饭抬到鞋厂门口，将20多盒交给那些托我买饭的人，剩下30多盒以每盒6元出售，没想到一下子就被那些饿慌了的人抢光了，我心里直后悔没多订些，搞到我自己都没得吃。我交了另外一半饭钱给店里的伙计，数一数剩下的钱，我竟然赚了160多元钱！ “我高兴得忘了自己还在等待面试，拿着钱就要走，这时听见有人’喂，喂’直叫，回头一看，是那个业务经理，他正朝我招手呢。原来他看见我卖饭的情景了，竖着大拇指说：’小伙子，不错啊，有头脑，看来刚才你不是吹牛皮，我决定破格录用你为我厂的推销员。’我一时还没意识到命运有了转机，竟傻乎乎地说：’等一下再说吧，我先去吃饭。’而那个经理误以为我是在故意吊他的胃口，其实我是因为赚了钱，高兴得忘乎所以了。经理说：’你别走了，到我们厂里来吃饭吧，现在12点，刚好赶上吃午饭。’ “我这才感觉到自己好运临头，欢喜得不知说什么才好。” (佚 名) 不论你从事什么行业，也不论你的职务是什么，在生活中都需要发挥”推销”的功能。你必须练习做自我的推销员，才能够得到身边人们的支持，生活得称心如意。 情人向伴侣推销他的爱意、员工向老板推销他的创意、政客向选民推销他的政见、官员向民众推销他的政绩，这些推销的原理，和一般业务人员向他的顾客推销产品并没有太大的差异。如果你对”推销”的观念还停留在”一个男人提一包卫生纸，挨家挨户敲门”的阶段，你就真落伍了。如果你认为”推销员”就是油头粉面、言不由衷的人，你也不会是跟得上时代的人。 现代的推销员是一群很有策略的行销高手，他们很懂得自己所要销售产品的特色，也能够找出哪些市场区间里的顾客需要这些产品，同时也会运用广告、公关等手段，找到和顾客接触的捷径，以十分有效的方法进行专业的销售。 别把”销售”视为畏途，更不要把”推销”当做困难的同义词。”出卖自己”几个字虽不是很中听，却是你每天都在做的事。更奇妙的是，你也和生意人一样，卖得越好越开心。 你应该不难想像以下的景象有多么难堪：你提议和情人去吃烛光晚餐却遭到对方婉拒；你提出的行政改善建议书被老板退回；你期望邻居不要乱倒垃圾却没人理你。你的人生中每一件东西都是可以出卖的，包括：时间、创意、感情、身体、灵魂，只要你有足够的销售技巧，找对市场，给予真正需要它的人。 更值得一提的是，有些交易的回馈，并不是有形的货币，而是无形的资产，譬如：感情、身体、灵魂都是无价之宝。 ###订立每年的计划 你是否曾拒绝修正或放弃某个目标–虽然要达成这样的目标已经不只是不可能，而且危险重重，甚至会伤害自己？你是否因执着于某个目标而影响了其他的重要事情，使你在人际关系、工作、财务或其他重要的领域，造成无法弥补的缺憾？ 我们常执着于要达成目标的欲望，结果反而记不起原先为达到目标所设下的种种步骤；在经历挫折受到打击之际，才发现自己无法决定下一步该怎么走。 那么，订立一个切实可行的目标，而不是只看眼前的路。 你专注于生命中的目的或最初的目标，在你的旅程中就会吸引越来越多能帮助你的人、环境和资源。事实上，将精力集中于你最初的目标，或最终的目标，是达成目标最有效的方法。 你知道你正往哪里去，并遵循你内心和灵魂的指引时，你将拥有一次更充实的旅程。 当你没有集中精力于你的最初目标时，变化和犹疑会像狂风一样侵袭你，使你如一叶飘荡的扁舟。 当你遵循你心中的梦想时，你会充满力量，时刻受到启发和刺激。 当你集中于你生命中最初的目标时，就将轻松越过障碍。 如何制订目标？ 要使某件事情成为一个”目标”而不只是一个”方向”，就必须用清楚界定的、可以量化的措辞将它写出来。 很多人知道自己要什么，却没能达成它，原因何在？他们以为自己有个目标，实际上他们有的只是个方向。如”我要成为成功的演员”就是个方向。我们在”任何事情”里首次成功地实践，那个”目标”就实现了，我们也就”是”个成功的实行者了。我们内在实现目标的机制就关闭了。 无论我们演过多少部电影，无论我们赚到多少钱，无论我们赢得多少个奥斯卡奖，”我要成为成功的演员”的”目标”都不算充分实现–将来永远可能有更成功的演出。因此，我们永远也不知道何时可以庆祝这个目标的达成。 能”量化”的目标，其结果是可以计数、测量的。你的目标如果是”我要成为成功的演员”，那么，请你问自己：”何谓成功？”然后，用可以量化的成功判断来陈述这个目标。”我要当演员，每年收入10万元”、”我要在一部重要的片子里担任主角，重要的影评家一致给我好评”，这些目标有没有达到，很容易判断。而什么时候做到”我是个成功的演员”，就不十分确定了。 设定目标的时候，还有一点很重要，就是要用现在式–像做一项肯定一样。如果能把对你自己的描述纳入目标里：”我在这件每年赚5万元或更多的新工作里，我很满意而且有创造力。””我在与一个亲切、有爱心的人的关系里，我快乐而且得遂所愿。”那样更好。 把你的目标一个个重写，写到可以让一个客观的旁观者也看出你有没有达成它们。 你”真”想加把劲的话，就为你的目标加个”时限”吧。把要实现各个目标的年月日加上去就行。这样你就不能轻易再说”我会达成我的目标–再说吧”。时限可以把目标变成一种可测量的现实。 关于目标，考虑一下最后一点：目标最好只有你自己知道，达成一个目标之后，告诉谁都行。到屋顶上去高喊，写信告诉朋友，你尽可以谈个不停，在那以前，守在心里吧，让没有达成的目标先成为一个秘密。 ###在大庭广众之下表演或演讲 自信是一种吸引力。只有当一个人有自信的时候，他才会成为别人注意的焦点。当一个人有自信的时候，别人会放弃他们那游移不定的意见来附和他。 想要使你自己够坚强并增强你的自信，最好的办法就是拿出胆量去做那些你以为没有把握的事。 晚自习开始了，刚参加完师哥师姐们的高考誓师大会的高二（3）班此刻一片静穆，像被注入了无穷的力量一般，大家都在埋头苦读。 门被轻轻地推开，班主任马老师走进教室，说：”6月末著名艺术家周幼盈女士要回母校访问，学校决定抽选20名同学培训半个月，进行交谊舞表演。有兴趣的同学到我这儿报名。” 如同一记重拳打在一堆棉花上，同学们对马老师的话毫无反应。 然而对于此刻坐在教室中的于云同学而言，却如同一块巨石投入了她原本平静无澜的心湖，她觉得心里有什么东西在膨胀，逐渐充满了整个心房。 在别人眼里，她平凡得不能再平凡了：成绩平平，相貌平平，服饰平平。学校偶尔会发一张课余时间调查表，她总是在”课余爱好”一栏里写”无”。其实，没有人知道，她非常喜欢–跳舞！ 然而今天，她那渴望辉煌的心情是如此迫切！ 下午，一条爆炸性的新闻传遍了高二（3）班：于云报名参加交际舞培训班了！ 半个月的培训开始了。于云在舞蹈方面的天分很快就表现出来，指导老师指定她和男生中的一个佼佼者搭档，充当表演队中的领舞。 同学们仿佛突然发现了她的存在，这才觉出以前那个沉默寡言、平凡呆板的女孩原来如此不凡和充满活力。而于云也惊喜地发现自己已成为焦点，受到从未有过的瞩目与重视。她快乐地想，原来自己也可以出类拔萃啊！兴奋、新鲜、激动充盈着她的内心，每一天，她都能感觉到一种从未有过的情绪在心底生长，很久以后，她才弄明白那是什么–是自信。 盼望已久的这一天终于到来了。学校里热闹非凡，一队队手持鲜花的学生整齐地分列在校门两侧，准备迎接周幼盈女士的到来。 校报告大厅的后台里，领队张老师正在给于云上妆，反复叮嘱她表演的注意事项。于云仔细地听着，全身因为激动不安而微微颤抖。上好妆，于云站起来，向镜中望去，她简直有些晕眩了。天哪，那个活泼美丽、光彩照人的女孩是自己吗？就在这时，李校长推门进来了，他懊恼地一挥手，说：”演出取消了！周女士被临时通知去北京参加一个重要活动……” 于云顿时像被打了一闷棍，耳朵嗡嗡直响，校长的话她没再听清，一直到张老师无可奈何地宣布”解散”时，她才清醒过来。猛地，她疾步走到张老师面前，低声而坚定地说：”老师，虽然客人不来，我也想为大家表演一次！”她并不等老师有所表示，就转过身看着她的男舞伴。 男孩立即会意地走过来牵住了于云的手。 于云舞步娴熟，舞姿优美，鲜红色的裙裾旋转着，铺开一个圆面，如同一阵红色的旋风征服了所有观众的心，大家深深地惊叹着这个素不起眼的女孩所表现出的非凡魅力。 一年以后，于云成为校园里新崛起的一匹黑马。也就在这年夏天，她步入了南方一所著名的高学等府。 (张 雁) 一个人最大的敌人是自己。 外来的挑战虽然严酷，但不管你能不能克服，总有过去的时候；现在对你造成威胁的事件，以后未必还会存在。惟有内心里那个自我永远不会消失。因此，假如缺乏自信心，你这一生一世就无法摆脱失败的厄运。 为什么我们该相信自己？因为在这世上，每个人都是独一无二的，所以你该相信自己。那为什么你会是这世上独一无二的呢？因为你所做的事，别人不一定做得来；而且，你之所以为你，必定是有一些相当特殊的地方–我们姑且称之为特质吧！–而这些特质又是别人无法模仿的。 既然别人无法完全模仿你，也不一定能做你能做得了的事，试想，他们怎么可能给你更好的意见？他们又怎能取代你的位置，来替你做些什么呢？所以，这时你不相信自己，又有谁可以相信？ 基于这种种重要的理由，请相信：你有权活在这世上，而你存在于这世上的目的，是别人无法取代的。 不过，有时候别人（或者是整个大环境）会怀疑我们的价值，所谓三人成虎，久而久之，连我们都会对自己的重要性感到怀疑。请你千万千万不要让这类事情发生在你身上，否则你会一辈子都无法抬起头来。 记住！你有权力去相信自己，所以，请放心大胆地去行动吧！ ###给亲人或朋友送件体贴的礼物 礼物好坏与否在于它是否合适，而不是它的贵贱。 我们许多人都想为自己的朋友或所爱的人送上完美的礼物，但往往是草草地完成这一任务。事实上，送礼不会是件麻烦事，无论对接受者还是赠送者来说，它都能使人享受到乐趣。 当你送礼物给某个人，即使你与这个人天天见面或经常联络，你也是用另一种方式表示他或她对你很重要，你心里有这个人，而且你想使他或她高兴。即使不特别喜欢礼物的人，也会乐于接受意外的惊喜。仔细考虑这种做法，用一件合宜的礼物表达你的爱。 有一位为人子者虽然孝顺，但他从来就不清楚父亲喜爱什么东西。 他一直记得，那些年的父亲节，他送过很多东西，他更记得，那些衬衫和剃须刀，从来就没看见父亲用过。他一直认为父亲大概不喜欢那些东西，于是，往后的父亲节，他也慢慢地不再费心。 一直到某一天夜晚，父亲节还没到，刚上小学的儿子就先画了一张笨拙的卡片给他，他望着卡片好久，他很开心，告诉自己一定要好好地保存，一辈子收藏着它，然后他仿佛领悟到了什么，匆忙跑到那个已经很久不曾进去的父亲的房间，他轻轻地打开父亲的抽屉，看见一件又一件从来没拆过封的衬衫和剃须刀，全都很新、很新地摆在那里，仿佛是昨天才买的东西。他突然开始恨起父亲，为什么父亲从来不说他很开心。但他更恨自己：为什么自己不早一点察觉，当父亲收到自己送的礼物时，心中真的很开心啊！ 为什么自己从来就不知道父亲有多爱自己？ 父亲节还没有来临的这个夜晚，他像个无助的孩子一样，开始懊悔地哭泣。(佚 名) 礼物不一定要昂贵，事实上，也不一定样样都得现买。你手边也许早有一些想送给亲人的东西：其中有些是你花费心血亲手做的，有些是玩具或小玩意之类的东西，有的则是以前买的。不论这件礼物来自何处，一定得很特别，而且是那个人会真心欣赏的东西。记住，重要的不是礼物的价格，而是那份良苦的用心。 你母亲今天可能想要什么？也许只是一束花，或是可以为那个她引以自豪的花圃增添色彩的一株花草或盆栽；你岳父又如何呢？由于他一直喜欢谈政治，因此也许可以送他一本已故总统的传记，或为他订一份讨论时事的期刊。你的孩子们呢？不管你的儿子要一双新球鞋或一盏台灯，都把它列入你的礼物单内，然后在他最意想不到的时刻，譬如放学回家时，送给他。此外，还有与你朝夕相守的伴侣。如果想不到什么特别的东西，写一封情书也可以。要不然，你也可以为他或她做早点，然后带着一枝花及一个微笑端到床前让他或她享用。 以下方法可使你感到送礼物的乐趣。 确保礼物对接受者有特殊意义。当你考虑赠送什么样的礼物时，首先问问自己：什么对对方来说最为重要？在这一点上承认并接受对方，这本身就可以说是一份礼物。 送人所需却出人意料。有时，你也许比对方更了解他的真正需要。 送得及时。我们知道，孩子们过生日时希望人们记得给他们送点礼物。但我们也许意识不到记住祖父的生日是多么重要。即使你忙得无法脱身，但在一家你喜爱的饭店安排一桌特别的宴席或订一件别致的礼物送上，只需打个电话就能解决，这点时间总是能挤出来的。 不一定非得等到特殊日子才送礼。在妻子做家务时出其不意地给她送上一枝玫瑰–这永远是”我爱你”的自然流露。每当我们并非因为特殊场合而送人一份礼物时， 我们实际上是在用比言语更清晰的方式告诉对方： “你对我很重要。” 付出你的时间和智慧。一件包含你付出了巨大努力、闪烁你爱心的礼物会使人产生感激之情。即使最昂贵的珠宝也无法和这份真情比拟。一个细心的儿子在母亲65岁生日时取出一盒母亲的零散照片，然后分类整理并把它们一一贴进一本相册。他将这本相册作为礼物献给了母亲。 礼物，也许是时间的记号，是记忆的承载，但它在生命中真正的意义，却在于送的一方把自己的情感深藏其中，献给对方，然后，便把自己完全地忘掉。 而受者也许对手中礼物的价值一时尚茫然不觉。但说不定哪一天会咀嚼出内在的丰厚，内心便霎时掀起波澜，既而无限地感激。 购买令人赏心悦目的衣服美国钢铁大王卡内基小时候有一次路经一个尚未竣工的摩天大楼的建筑工地，与衣着华丽的老板攀谈起来。”我长大后要怎样才能像你这样？”卡内基以羡慕的口吻问道。”第一要勤奋工作……””这我早知道了，老生常谈，那第二呢？””买件红衣服穿！”聪明的卡内基满脸狐疑：”这……这和成功有关？””有啊！”那人顺手指了指前面的工人说道，”你看他们都是我的手下，但都穿清一色的蓝衣服，所以我一个也不认识……”说完他又特别指向其中一位工人：”但你看那个穿红衬衫的工人，我长时间注意到他，他的身手和其他人差不多，但我认识他，所以过几天我会请他做我的副手。” 你的自我形象就像你的专属品牌。 我是造物主的最大奇迹。 自从开天辟地以来，世界上就没有第二个人有我这种精神、有我这种心胸、有我这种眼睛、有我这种耳朵、有我这双手、有我这种头发、有我这种嘴巴。完全像我一样地能走、能说、能动、能想的人，以前没有，现在没有，将来也不会有。四海之内皆兄弟也。但是，我却与众不同。我是独一无二的造化。 我内心里燃烧着经过无数代传下来的火焰。它的热度，不断地刺激我的精神， 要我成为比我现在，以及比我将来更好的我。我要煽起这不满足之火，我要向世界宣布我的独特性。 没有人能够复制我的字体，没有人能够做我凿刻出来的标志，没有人能创造出我的成果，实际上，也没有人拥有完全像我的推销能力。从今以后，我要将这不同之处大书特书。因为这是使我达到完美之境的一种资产。 我不再徒劳无益地模仿别人。相反地，我要把我的独特性拿到市场上去展览。我不但要宣扬它，而且还要推销它。我要从现在开始，强调我的不同点，隐藏我的相似点。所以，对于我推销的商品，我也要应用此原则，推销员和货物都与众不同，我以这种不同为荣。 我是珍奇的人。凡是珍奇的东西都是无价之宝，所以，我的价值也无法估量。我是千万年进化而来的成品，所以，我在精神和身体两方面，都比以前的所有帝王和圣贤强得多。 但是，我的技巧、我的精神、我的心胸，以及我的身体都会污浊、腐烂和死亡，我必须将它们善加利用。我有无尽的潜力。我只使用了小部分头脑；我只弯曲了少许筋骨。但是，我能够使我昨天的成就增加一百倍或一百倍以上，我愿意这么做，从今天就开始。 我以后将永远不再对昨天的成就感到满意，也不再对我微小的事业任意自我宣扬。我能完成的工作，远比我现有的和将来的多得多。为什么创造我的那个奇迹，随着我的出生而结束呢?为什么我不能使那个奇迹延伸到我今天的事业上去呢? 我是造物主的最大奇迹。 我不是偶然来到尘世的。我来到这里是为了一个目的，那个目的就是想长成一座高山，而非缩成一颗沙粒。从今以后，我要竭尽一切力量去成为一座最高的山，将我的潜力发挥到最大限度。 (奥格·曼狄诺) 欣赏美好的事物是人类与生俱来的本能。 也正因为这个本能，当我们判断一个人时，往往会以外貌取人：要是对方穿着得体，就会给我们留下绝佳的第一印象；对方若是一身不修边幅的打扮，肯定不会对他有好印象。 人同此心，心同此理，你以外表取人，当然也不愿意自己因外表的差疵而受到误判，所以每个人无不想以最美好的一面去博取别人的好感。 谁会不喜欢穿可以让自己心情好点的衣服呢?来点特别的衣饰，会使我们觉得自己是如此出色，让我们自觉处于世界的顶端，受到万人景仰，心境自会开朗。 穿出你自己的特色，这直接关乎你的个人形象。 你不必总想和别人一样。就做你自己! 尽可能扮演好自己的角色，这才是最重要的。别忘了，每个人都是完整而独立的个体，每个人都有特别的优点，要是能按照这些特点尽情发挥，一定成就非凡。硬要舍弃自有的天赋去学别人，就算学得惟妙惟肖，那充其量也只不过是个二流的别人而已。 而且，不要忘了，你也有特别的才能和能力，别人或许也正因此而赞赏你，想以你为师呢! 每个人都是别人眼中优秀的人才。我们总是在羡慕别人，而别人也在羡慕我们。这就是人类学习、成长的方式。 惟有坚持自我，才能建立独一无二的”个人品牌”，创造无可取代的奇迹。 很多机会是在碰撞之后才产生的。坚持自我，不可避免地会与外界发生碰撞。碰撞之后，伤害、失败、灰心等负面情况必然出现。如果在你经历这么多后，依旧挺得住，就一定会觅得良机。因为太多的人都会在负面攻击之下，败下阵来。坚守一个品牌，就是坚守一种做人的理念。大商区别于小贩，可能不在赚钱的资本和途径上，甚至不在经营的水平和招术上，却一定会在非常时刻体现于人格修养、理想信念上。 ###养动物和植物 古时有一仙人，在深山修道，时常静坐于一棵大树下，摒除杂念，修习禅定。是时，正值冬天，气候非常寒冷。时近黄昏，有一只寒冷的小鸟飞来，就栖息在仙人怀中，希望获得一些温暖能延续它的生命，仙人惟恐惊动鸟儿，因此盘膝打坐，身体不敢摇动，让鸟儿无忧地安处怀中，等到翌日小鸟振翅飞往别处，仙人才出定。爱护动物的慈悲心怀，竟然到了如此程度。 人对动物的态度大致有三：一是以人为中心，企图主宰动物的命运，为满足自己的私欲，不惜滥杀，使动物大量灭绝；二是提倡保护动物，因为动物可以为人类服务；三是把动物作为朋友，承认它们和人一样是地球的主人。 你对动物的态度如何，取决于你自己。试想像，当地球上只剩下人类时，那将是怎样一个可怕的世界啊!善待动物吧，因为当人类失去动物的时候，也终将失去自己! 丰子恺一家返回江南后，住在杭州西湖边，家中养了一只白猫，取名”白象”，这只猫又成为他喜爱的新朋友。他喜欢白象，首先因为这只猫好看，两只眼一黄一蓝，叫做”日月眼”。它在太阳光中走动的时候，瞳孔细得几乎没有了，两眼像舞台上装的不同光色的电灯一样，人人见了都惊叹。丰子恺的女儿们回到家，一坐下，白象就跳到她们膝上睡觉。她们不忍心动弹，就坐着不动，向人要茶，要换鞋，要报看。大家喜爱白象，竟至于此。 然而有一日，不见白象来吃饭，天黑仍不见；第二日，仍不见。丰子恺着急了，便写了两张海报，重金寻猫，但终无人送猫。后听说，是死在水沼里了。于是丰子恺想起，猫是不肯死在家里的。这一定是白象知道临命终了，便外出去死！白象的遗孤，5只死了3只，还有两只，活泼可爱，常常是丰子恺在读报，两只小猫便爬到他架起腿后的两只脚上，一高一低，令人见了发笑。而丰子恺则习以为常，倒觉得脚上没有两只猫反而不舒服了。 朋友们知道丰子恺爱猫，便给他送猫。很快，家里便有了5只猫。结果是，这5只猫经常成群结队地偷鱼吃，甚至偷蛋糕吃，引起了大家反感。丰子恺却认为，猫的贪污，定是没有吃饱的缘故。如果把每只猫喂饱，它们就会各自去睡觉，洗脸，捉尾巴，而不至于偷窃。于是，他把大司务叫来，详细询问猫的饮食问题。大司务回答：”每日规定三顿，每顿1000元猫鱼，拌一大碗饭。”丰子恺说：”这么多猫，这点饭怎么够呢，为什么不多买点猫鱼？”大司务回答：”这是太太规定的。”于是丰子恺去找太太，太太说：”一向如此呀。”丰子恺说：”不行，物价涨了么！从前1000元猫鱼很多，现在只有一点点。你这不是逼猫贪污吗！应给3000元猫鱼……”从此猫的贪污案件便销声匿迹。丰子恺爱猫，就更为有名了。 50年代，丰子恺家里养了一只黄猫，起名为”猫伯伯”。在丰子恺的故乡，伯伯不一定是尊称，而是一种讥讽的称呼。这只猫伯伯，丰子恺的女儿一吟最喜欢。有时她正在写文章，忽然猫伯伯跳上来，面对着她，端端正正坐在稿纸上，让她无法写作。有时甚至盘起身来，就在稿纸上睡觉，身子正好装满了稿纸。 有一天，家里来了一位贵客，气氛一时十分严肃。正在这时，猫伯伯跳上矮桌，嗅嗅贵客的衣袖。贵客抚摸它的背，称赞：”这猫真好！”于是气氛松快了，开始了闲谈。正谈着，猫伯伯竟然迅速地爬上贵客的背，端端正正坐到他的脖子后面了。丰子恺正惶恐着，但那贵客却低下头，使猫坐得更舒服，谈话于是更加融洽了。丰子恺于是总结：猫能化岑寂为热闹，变枯燥为生趣，转懊恼为欢笑；能助人亲善，教人团结。即使不捕老鼠，也有功于人。然而，这只猫短命，4岁便死了，以至于丰子恺当时不愿意写它，直到10年后，才又深情地回忆起它，并由它回忆起60年前，父亲所养的活了18岁的老猫。那老猫在父亲晚酌时，总是坐在酒壶边，父亲常用豆腐干喂它，而这豆腐干，是丰子恺的姐姐们所享受不到的。由此观之，丰子恺爱猫，有家传因缘。 60年代，丰子恺又养过一只白猫，这猫的名字叫”阿咪”。阿咪之父是中国猫，其母是外国猫，所以它的毛很长，像兔子一般。 那时候，丰子恺居家著译，白天孩子却不在家，家里十分寂寞。自从有了阿咪，家中便热闹了。厨房里常有保姆的话声或骂声，其对象便是阿咪。有时客人带孩子来，大人谈话，孩子感到很无聊。忽然阿咪跑来，它招待小客人，大人也就安心谈话了。丰子恺照过一张照片，他身穿棉衣在写作，小阿咪就坐在他的肩上，看他写作。面对小阿咪，丰子恺有时回忆起15年前的”白象”和10年前的”猫伯伯”，真希望阿咪能像60年前父亲养的老猫一样，能活18岁…… ###信守一个诺言 信守和尊重一个诺言，或许要比登一座山更难。 花儿是春天的诺言，潮汛是大海的诺言，远方是道路的诺言。世界，因为信守许多大大小小的诺言，肃穆而深情。 一个有分量的诺言，犹如一座有高度的山。可悲可叹的是，我们许多人不时被困在山下。 我做女孩时曾遇上一个男生开口向我借钱，而且张口就是借两元钱， 在当时，这相当于我两个月的零花钱。我有些犹豫，因为人人都知道那男生家很贫穷，他母亲仿佛是个职业孕妇，每年都为他生一个弟弟或妹妹。她留给大家的形象不外乎两种：一种是腹部隆起行走蹒跚；另一种是刚生产完毕，额上扎着布条抱着新生婴儿坐在家门口晒太阳。 我的为难令那男生难堪，他低下头，说那钱有急用，又说保证5天内归还。我不知怎么来拒绝他，只得把钱借给了他。 时间一天一天过去，到了第5天，男生竟没来上学。整个白天，我都在心里责怪他，骂他不守信用，恍恍惚惚地总想哭上一通。 夜里快要睡觉时忽然听到窗外有人叫我，打开窗，只见窗外站着那个男生，他的脸上淌着汗，手紧紧攥着拳头，哑着喉咙说：”看我变戏法!”他把拳头搁在窗台上，然后突然松开，手心里像开了花似地展开了两元钱的纸币。 我惊喜地叫起来，他也快活地笑了，仿佛我们共同办成了一件事，让一块悬着的石头落了地。他反复说：”我是从旱桥奔过来的。” 后来，从那男生的获奖作文中知道，他当时借钱是急着给患低血糖的母亲买葡萄糖，为了如期归还借款，他天天夜里到北站附近的旱桥下帮菜农推菜。到了第5天拂晓他终于攒足了两元钱，乏极了，就倒在桥洞中睡着了，没料到竟酣睡了一个白天和黄昏。醒来后他就开始狂奔，所有的路人都猜不透这个少年为何十万火急地穿行在夜色中。 那是我和那男生的惟一的一次交往，但它给我留下的震撼却是绵长深切的。以后再看到”优秀”、”守信用”之类的字眼，总会联想到他，因为他身上奔腾着一种感人的一诺千金的严谨。 那个男生后来据说果然成就了一番事业，也许他早已遗忘了发生在我们之间的这件事，可我总觉得这是他走向成功的源头。 (申 士) 遵守诺言是一项重要的感情储蓄，违背诺言是一项重大的支取。实际上，最能导致情感储备大量支取的恐怕莫过于许下某个至关重要的诺言而又不履行这一诺言了。因此，要力求非常谨慎小心地许诺，尽量考虑到各种可变因素和偶发事件，以防突然发生某些情况，妨碍诺言的履行。尽管做出各种努力，有时意外事件还是会出现，造成不宜或不可能遵守某一诺言的情况，但是如果你重视这项承诺，你就要么想方设法予以遵守，要么请求收回承诺。如果你养成了一贯履行承诺的习惯，别人会因为你的成熟和富于预见性而倾听你的意见和你的劝告。自身忠诚会赢得信任，不忠诚可以破坏几乎任何为建立高度信任所做出的努力。一个人如果口是心非，就失去了其信任储备。 诺言之所以能成为一种力量，是因为信用具有无上的价值。社会秩序建立在人与人之间彼此遵守约定的基础之上，是否实践诺言，是衡量人类精神是否高尚的准则。道义、道德也都表现在守信上，如果人们不把守信作为制约自身行为的准绳，影响所及，社会生活的各个层面都将蒙受其害。每一个人都应遵守诺言，诺言是神圣的，承诺是金。 ###做一次赚钱的生意或进行一项有所收益的投资 人生的智慧有两种：获得财富和享受财富。懂得前者的人不多，懂得后者的人就更少了。 成功学的奠基者拿破仑·希尔忠告我们：切勿因为金钱而丧失人格，惟有建立了完善的人格，你才会真正拥有财富并享受财富的快乐。 人格的完善是本，财富的积聚是末，本立而末生，本竖而末成；倘若舍本而取末，本末倒置，你将不会拥有财富，那些到手的金钱也会像流水般失去。 很多人在谈到财富的时候，总相信无商不奸的道理，总相信人无横财不富的原则，总相信吃人不吐骨头的精神。 但是巴菲特和这对老夫妇的故事，却让我们有一番不同的回味。 最大的财富，必须和最多的人分享。 财富的世界，原来也可以如此充满信任、共享和温暖。 在这个世界上，我们见过财源滚滚、繁茂昌盛的例子，也见过倾家荡产、一败涂地的事件。为钱而大悲、大苦的现象，常常令我们黯然神伤，可是天地规律地运行，钱也有规律地操纵着人们的喜怒哀乐，日复一日，永无休止，钱与我们的生活息息相关，密切相连。 钱是人类文明中最特异的产物，是几千年来归纳总结出来的统一价值标准，钱越被普遍接受，流通越普及，它的影响力也就越深远。洪荒时代，人们借着积存粮食、肉食来增加生存的安全感；现代人借着积存钱财，减轻对未来生存的恐惧不安。人类知识日益增长，越发感觉到人的渺小与脆弱，越发需要庞大的积蓄，壮大自己的信心，而信心越低的人越需要一大笔钱支持生命的信念。 钱原来是解脱人类问题的工具，现在，钱是人的负担、人的问题。我们不仅需要投资专家，我们更需要的是彻底地解开心头的”钱结”。 其实，钱的增值是钱的主人运用才智的结果，不靠钱赚钱的人才是此道高手，不论他们赚的是薪水、服务费还是经商所得，靠智慧勤奋工作的人不会对未来充满恐惧与惶恐。把注意力从钱上转移出来，才可能重新让生命与希望结合，我们都应该看清楚这一点，不要迷恋地去钻钱的牛角尖。 成功者的经验是：街头商贩，也不能单靠狡诈；要成为中等商人，先得学会为人处世之道；若想成为大商人，就必须成为一名正人君子。因此，真正获得成功的大商人、大企业家无不是恪守为人处事的正道。初起之时，也许有的人曾玩弄过”奸诈”，但略有根基后，皆能用正确的为人处事准则律己待人。 明智地投资，才可以让你的财富加倍，你要掌握的原则是： 奖赏自己； 至少存下你收入的十分之一； 因抱负而投资，而不是自暴自弃； 不要因拖延而付出代价。 富人总是先犒赏他们自己。明智地用钱投资，它将加倍地报还你。而即使有许多杰出的投资，最聪明的仍是投资在你自己的抱负上。产生赚钱的灵感时，以提出一点钱消费或多投资一点来回报你自己，这种做法会使你对世界充满感激，你在生命上的回报便是你能帮助多少人。 不要为拖延付出代价，时间就是金钱。你不善加利用的每一天，都是在增加另一天的工作量。延误的代价大过表面上看得到的，例如，假定年利率为10％，在65岁时你的账户中要有100万元，你只需一个月存100元–如果你在20岁时就开始存钱的话；如果你在30岁才开始，则每月需存200元；而等到40岁时，则每月必须存入750元。 你可以追求金钱上的富有，并获得因你的富有而得到的尊重，而不要让它介入你个人和灵感的成长。当你维持对钱财的均衡认知，并以它为实现梦想和最终目标的工具时，财富就会流入你的生活中。 没有必需的金钱，我们的生活会是坎坷而艰辛的，所以，我们要努力赚钱致富。然而，我们需要的是以人为本的成功。在走向成功的道路上，需要不断磨炼和升华我们的人格力量。金钱只是成功的外貌，或衡量成功的尺度，而不是内核和根本。我们不要恐惧、悔恨、嫉妒、哀愁和疾病，我们退避三舍的是别人对我们的恨–假若你已经拥有财富。这就是说，在拥有金钱的成功之余，我们也要拥有心灵的宁静，只有如此，我们的生命才能够完美而无瑕。 ###制怒；并向自己所伤害过的人致歉 我们再回过来说歉疚感。既然自认做了对不起他人的事，或只是出于误会、急躁、不耐烦等等情况造成的人际僵局，那是最不必苦痛的。中国有一句成语：”解铃还须系铃人。”打一个比方，最常见的–既然当初有这份狂妄和任性，向母亲大叫大骂，不体娘心，而今难道没有同样的勇气和良知，去母亲身边诚心地道歉说明，使这冰冻的疼痛化为和风? 古时”周处除三害”，不在于他除了前面两害的好本事，他的自我顿悟和改变，才是这个故事因而流传下来的可贵可敬之处。对于父母、手足、同学、朋友，如果真正背负着那么沉重的歉疚感–如同信上所写，那么不必再悄悄来信给我了。一来又来，于事无补，徒然浪费精神。 这种感觉如果积压太久，对于身体的伤害也是很大的。解决的方法，除了道德之外，真诚地痛下决心，只要出于一片至诚，对方百分之九十是能谅解的。万一，对方仍不肯谅解， 这其中，我怀疑涉及金钱的事占大半，那么欠债还钱，分期分年分月摊还，不占他人血汗辛苦，才是实事求是。情感的欺骗，自然又是一种。某种人，对情真真假假，游戏人间本来不是死罪，如果对方不是如此人生观的人，也拿来开玩笑，造成他人遗恨终身，自己虽然也有悔意，总是伤德。这便不是道歉能解的事了，那份内疚，是该当跟随一辈子的–是为报应。也有上面所说，芝麻大小之事，发展成仇，自己诚心道歉，他人不肯原谅，也是常见的事。这件事，涉及双方胸襟和本身性格。强求不必，尽其在我，尽情尽义而对方仍不能化敌为友，那么更不必痛苦，只有算了。 这类来信的朋友，大半善良而谦虚，很少怨怪他人，只有深责自己。其实所谓内疚，不过小事一桩，勇于化解，就是善待本身良心。思想是可贵的，行为亦是可贵，这两件事，相辅相成，缺一便不圆满了。谢谢来信使我明鉴省视自己，感激不尽。 (三 毛) 有时我们迟迟不道歉是因为怕碰钉子，这种令人难堪的可能性确是有的，但是不大。原谅别人可以祛除心里的怨恨，而怨恨是戕伤心灵的。有谁愿意反复蒙受痛苦和忿怨的折磨?那么应该怎样进行道歉呢?一般来说有下列几点： 1.如果你觉得道歉的话说不出口，可以用别的方式代替。吵架后，一束鲜花能令前嫌冰释；把一件小礼物放在餐碟旁或枕头下，可以表明悔意，以示爱念不渝；不交谈，触摸也可传情达意，千万不要低估”尽在不言中”之妙。 2.切记道歉并非耻辱，而是真挚和诚恳的表现。伟人也有时道歉。丘吉尔起初对杜鲁门的印象很坏，但后来他告诉杜鲁门说以前低估了他–这句话是以赞誉的方式做出的道歉。3.除非道歉时真有悔意，否则不会释然于怀。道歉一定要出于至诚。 4.道歉要堂堂正正，不必奴颜婢膝。你想把错误纠正，这是值得尊敬的事。 5.应该道歉的时候，就马上道歉，越耽搁就越难启齿，有时甚至追悔莫及。 6.假如你认为有人得罪了你，而对方没有致歉，你就该冷静应付，不要闷闷不乐，更不要生气。写一封短笺，或由一位友人传话，向对方解释你心里不痛快的原因，并向他说明你很想排除这烦恼。 7.你如果没有错，就不要为了息事宁人而认错。这种没有骨气的做法，对任何人都无好处。同时要分辨清楚深感遗憾和必须道歉两者的区别。譬如你是主管，某一部属不称职必须予以革职，你会觉得遗憾，但是不用道歉。 8.假如你想向某人道歉，而且你有对不起他的地方，就应立刻想办法。你应该写封信，打个电话，送本书、一盆花草、一盒糖果，或者用其他任何足以表达心意的东西代你做出这样的表示：”我对彼此的隔阂深感难过，亟望冰释前嫌，甘愿承担部分或全部咎责，并盼你能接纳这点微意以及人间最能化戾气为祥和的三个字：’对不起’。” ###重整人生的行囊 回想一下(或者想一想自己现在的生活处境)，因为不能舍弃、不能放手，我们面对了多少纠结无解的痛苦?深陷于多少无法自拔的困境之中?这些看似无解、凝滞的痛苦与困境，往往就在我们懂得了舍弃和放手的艺术与智慧之后，豁然开朗。生命于是向你展现出另外一个截然不同的景致和局面。 多年来，我老想清理我的文件–那些塞满了书橱、壁架和堆在地上、大厅里、厨房里的一沓沓字纸。至少有15年，我心里一直对自己说：”再不能这样拖下去了，我必须把东西收拾好。” 昨天早上，我终于动手了。我劝服妻子带孩子到海滩玩一天，我自己则一口气工作到午夜。我本想通宵干下去，只是我已把家里弄成了一团糟，必须用脚尖才能走动。我打开冰箱门，却惊见里面放的是我的运动衫、袜子和几件木工用具。我将它们取出欲转移到另外的地方，不慎和书橱碰个正着，撞得堆放在最高层的一大沓书掉下来，纷纷砸在我的头上和脸上。 晚上，我的头肿起了包，鼻子贴了橡皮膏，左眼已几乎看不见了。我在客厅中央踩着一只拖鞋，脚下一滑，扭伤了足踝。我不明白为什么那只拖鞋会在那里。我早已注意到拖鞋是到处跑的东西，剪刀也是。拖鞋和剪刀的不同在于：拖鞋喜欢展露自己，使你简直就避不开它；而剪刀则喜欢躲藏得无影无踪。 最令我气恼的是，我花了那么多力气，却没有什么成绩。我本想把所有的字纸看一看，选出要留的，因此我搬动了大堆的文件夹、旧报纸和纸箱，看看下面和里面是什么。谁知这竟是个严重的错误：两个小时后，我的字纸体积比原先增加了3倍。未到中午已无处可坐，我想到街口的咖啡室去舒口气，但房门由于被堆放着的东西堵住而打不开了。 于是我改变战术，决定一次只处理一件事情，从就在眼前的一个捆着的纸箱着手。我解不开绳结，想找剪刀又找不着，倒很方便地找到了一只拖鞋。我心头火起，一下把它抛出了窗外。最后我用厨房里的菜刀割断绳子，打开了纸箱：只见里面装的是结账单、剪报、信和一块甜饼。 我正要把这整箱的东西抛进垃圾箱，突然，一种无形的力量制止了我。我想，万一政府忽然认为我有一笔税款未交，我该怎么办?我可以想像我面对税务员，供认我已把所有的结账单扔掉了。我承认我不敢再想下去。 所剪的报是60年代的，都是些极有趣的文章，我想留待日后阅读。但那一天尚未来临。事实上，可能永远也不会来临。不过，我还是决定继续保存那些剪报，因为也许子女们有一天会看。 我想抛掉那些旧信，只保存邮票。如果我不重读那些信，也许我真的要那么做了。可是当我随便看看时，时至下午，我又检查了两沓文件，除了一张1970年的账单外，竟找不到一张可以丢弃的纸片。而就在我从一个文件柜走到另一个文件柜之际，又踩着了另一只拖鞋而使身体闪了一下，我立刻把它扔出窗外，让它去追随它的”伴侣”。 接着，我强打精神，把那张1970年的账单和那块甜饼丢进了废物篓，把所有的纸箱和一沓沓东西放回原处，午夜时分，已经筋疲力尽的我停止了工作。 凌晨1时，妻子和孩子都回到了家，家里看来差不多还是老样子。”我累得要命!”我对妻子说。”哦，你做什么了?””我明天再告诉你。”我说，”现在不想再说这件事。””你再也猜不到我们在房子前面的街上捡到了什么。”她欣喜地说道，背后的手好像拿着什么东西。”我的拖鞋。”我哽咽着说，险些忍不住流下眼泪。 (维斯里斯·阿莱克撒克) 你一定有过年前大扫除的经验吧。当你一箱又一箱地打包时，是不是惊讶自己在过去短短几年内，竟然累积了那么多的东西?你是不是懊悔自己为何事前不花些时间整理、淘汰一些不需要的东西，否则，今天就不会累得你连脊背都直不起来? 大扫除的懊恼经验，让很多人懂得一个道理：人一定要随时清扫、淘汰不必要的东西，日后才不会变成沉重的负担。 人生又何尝不是如此!在人生路上，每个人不都是在不断地积累东西?这些东西包括你的名誉、地位、财富、亲情、人际、健康、知识等等；另外，当然也包括了烦恼、忧闷、挫折、沮丧、压力等等。这些东西，有的早该丢弃而未丢弃，有的则是早该储存而未储存。 问自己一个问题：我是不是每天忙忙碌碌，把自己弄得疲累不堪，以至于总是没能好好静下来，替自己做”清扫”? 心灵扫除的意义，就好像是生意人的”盘点库存”。你总要了解仓库里还有什么，某些货物如果不能限期销售出去，最后很可能会因积压过多而拖垮你的生意。 很多人都喜欢房子清扫过后焕然一新的感觉。你在拭掉门窗上的尘埃与地面上的污垢，让一切整理就绪之后，整个人好像突然得到一种释放。 在人生诸多关口上，我们几乎随时随地都得做”清扫”。读书、出国、就业、结婚、生子、换工作、退休……每一次转折，都迫使我们不得不”丢掉旧的你，接纳新的你”，把自己重新”扫”一遍。 不过，有时候某些因素也会阻碍我们放手进行扫除。譬如，太忙、太累；或者担心扫完之后，必须面对一个未知的开始，而你又无法确定哪些是你想要的。万一现在丢掉的，将来又捡不回来，怎么办? 的确，心灵清扫原本就是一种挣扎与奋斗的过程。不过，你可以告诉自己：每一次的清扫，并不表示这就是最后一次。而且，没有人规定你必须一次全部扫干净。你可以每次扫一点，但你至少必须立刻丢弃那些会拖累你的东西。 从呱呱落地开始，我们一直学习的都是用加法来面对人生的课题。从生理上的吃饭、长大，心理感情上的得到爱与关怀，知识上的不断学习与吸收，到物质或成就上的累积成长。一直以来，我们不断地把各种有形、无形的东西加在我们自己身上，好让自己富有、充裕，让自己壮大、盈满。我们相信，当我们在各方面都”长得像大树一样大”的时候，就是离快乐和富足的心境最近的时候。 可是，这样的信念却在某一些时候，成为卡住我们，让我们困顿、凝滞的关键。因为加法并不是面对人生的课题时惟一的方法，有些时候，你必须用”减法”才能够解得开。而所谓的减法，正是舍弃与放手的艺术。 生命的过程就如同参加一次旅行。你可以列出清单，决定背包里该装些什么才能帮你到达目的地。但是，记住，在每一次停泊时都要清理自己的口袋：什么该丢，什么该留，把更多的位置空出来，让自己活得更轻松、更自在。 ###到最艰苦的职业现场去打一次工有一个女人，为了报复一个曾深深伤害过她的男人，劫走了他的婴儿。她把孩子交给一个巫师，要求巫师在这个孩子身上施法术，用最凶残的方法施行报复。不久，巫师通知这个女人说，他已经用了最残酷的方法，要她到指定的地方去看一看。女人不看则罢，一看大怒–那个孩子居然被当地一位富翁收养了!她立即跑去责问巫师。巫师叫她不用急，等着瞧。而最后的结果，连这个凶狠的女人，也觉得如此报复太过分了。原来，孩子在骄奢中成长，没有强健的体魄、坚韧的意志和吃苦耐劳的精神。在家庭突然破产和贫困的沉重打击下，软弱无能，每况愈下，卑贱污秽，生不如死。在徒然挣扎一段时间后，终于疯狂自杀。 找到一个能够磨炼自己的环境并置身其中，是人走向成熟的重要一环。 二次大战时美国著名的麦克阿瑟将军，曾经写过一篇令人感动的《为子祈祷文》，在文中他期待能让孩子多遭遇一些痛苦与挑战，只有这样才能淬炼出超人的意志力及克服挑战的勇气。 太顺利的际遇是一种危机，因为一切得来得太容易了! 毕竟大多数的人不是含着金匙而生的，我们仍需通过自己的努力来满足生活所需。然而，一个优秀的人是可以靠环境磨砺成才的，能够选择适当的环境磨炼自己的人，将永远是这个世界最好的适应者。环境对人的影响和暗示，其力量之大、之深刻，不容忽视。积极成功的良性循环与消极失败的恶性循环，区别在于环境。 我们的环境会塑造我们的形象，也会影响我们做事的方法。你能不能找出不是”从别人那里学来”的一个习惯或举动呢?我们本身的各种小事，例如，走路和咳嗽的样子，拿杯子的姿势，对于音乐、文学、娱乐与衣着的爱好等等，绝大部分都会受到环境直接或间接的影响。 更重要的是，你所喜欢的各种东西、个人的工作目标、生活态度与个性，都是由过去与现在的种种环境所造成的。 许多专家都同意，你今天的模样、个性与野心，目前的身份与地位，大部分都是你自己的心理环境所造成的。这些专家也认为，你1年、5年、10年，以至于20年之后的情形，跟你将来所处的环境关系很大。 随着岁月的消逝，你会有所改变。为了使我们的将来符合理想，为我们带来满足感，应该做到哪些事情呢? “火，考验黄金；灾难，考验勇者。”人要成功，往往需要一个可以刺激成长的环境，需要经过苦难的磨炼，需要设定一个”对手”来激发无限潜能。不必对工作不适抱怨连连，更不能心安理得地过舒服的日子，在艰苦环境中淬炼你的意志，这是人生不可缺少的环节。只有勇敢地选择过环境，顽强地改造过环境，坚强地适应过环境，你才能够说，作为真正意义上的人，你活过了! ###给予他人切实的帮助 一个人能给予另一个人什么东西呢?他把自己的一切给予别人，把自己已有的最珍贵的东西给予别人，把自己的生命给予别人。这不一定意味着他为别人牺牲自己的生命，指的是他把自己身上存在的东西给予别人，把自己的快乐、兴趣、同情心、谅解、知识、幽默–把自己身上存在的所有东西的表情和表现给予别人。在他把自己的生命给予别人的时候，他也增加了别人的生命价值，丰富了别人的生活。通过提高自己的生存感，他会提高别人的生存感。他不是为了接纳才给予。给予本身就是一种强烈的快乐。在给予中，他不知不觉地使别人身上的某些东西得到新生，这种新生的东西又给自己带来了新的希望。在真诚的给予中，他无意识地得到了别人给他的报答和恩惠。 –(美)弗洛姆 一天傍晚，他驾车回家。在这个中西部的小社区里，要找一份工作是那样的难，但他一直没有放弃。 冬天迫近，寒冷终于撞击家门了。一路上冷冷清清。除非离开这里，一般人们不走这条路。他的朋友们大多已经远走他乡，他们要养家糊口，要实现自己的梦想。然而，他留下来了。这儿毕竟是他父母埋葬的地方，他生于斯，长于斯，熟悉这儿的一草一木。 天开始黑下来，还飘起了小雪，他得抓紧赶路。 你知道，他差点错过那个在路边搁浅的老太太。他看得出老太太需要帮助。于是，他将车开到老太太的奔驰车前，停下车来。 虽然他面带微笑，但她还是有些担心。一个多小时了，也没有人停下来帮她。他会伤害她吗?他看上去穷困潦倒，饥肠辘辘，不那么让人放心。他看出老太太有些害怕，站在寒风中一动不动。”我是来帮助你的，老妈妈。你为什么不到车里暖和暖和呢?顺便告诉你，我叫乔。”他说。 她遇到的麻烦不过是车胎瘪了，乔爬到车下面，找了个地方安上千斤顶，又爬下去一两次。结果，他弄得浑身脏兮兮的，还伤了手。当他拧紧最后一个螺母时，她摇下车窗，开始和他聊天。她说，她从圣路易斯来，只是路过这儿，对他的帮助感激不尽。乔只是笑了笑，帮她关上后备箱。 她问该付他多少钱，出多少钱她都愿意。乔却没有想到钱，这对他来说只是帮助需要帮助的人。他说，如果她真想答谢他，就请她下次遇到需要帮助的人时，也给予帮助，并且”想起我”。 他看着老太太发动汽车上路了。天气寒冷且令人抑郁，但他在回家的路上却很高兴，开着车消失在暮色中。 沿着这条路行了几英里，老太太看到一家小咖啡馆。她想进去吃点东西，驱驱寒气，再继续赶路回家。 侍者走过来，递给她一条干净的毛巾擦干她湿漉漉的头发。她面带甜甜的微笑，是那种虽然站了一天却也抹不去的微笑。老太太注意到女侍者已有近8个月的身孕，但她的服务态度没有因为过度的劳累和疼痛而有所改变。 老太太吃完饭，拿出100美元付账，女侍者拿着这100美元去找零钱。而老太太却悄悄出了门。当女侍者拿着零钱回来时，正奇怪老太太去哪儿了，这时她注意到餐巾上有字。是老太太写的，女侍者眼含热泪读道：”你不欠我什么，我曾经跟你一样。有人曾经帮助我，就像我现在帮助你一样。如果你真想回报我，就请不要让爱之链在你这儿中断。” 晚上，下班回到家，躺在床上，她心里还在想着那钱和老太太写的话，老太太怎么知道她和丈夫那么需要这笔钱呢?孩子下个月就要出生了，生活会很艰难，她知道她的丈夫是多么焦急。当他躺到她旁边时，她给了他一个温柔的吻，轻声说：”一切都会好的。我爱你，乔。” (佚 名) 助人，是施予而绝不求任何回报。能有益于他人并自感快乐就是生活给予我们的报酬。助人也是对我们的财富的一种肯定。助人等于说：”谢谢你，我拥有的多过我所需要的。”这是对财富的最深刻、最有力的肯定之一。 何处去助人?帮助谁?只要敞开助人之心，需求就会找到我们。也许是朋友打来的一个电话、报纸上的一篇文章、做事时碰到的一个人，或者街上的无家可归者。”助人者欲服务之时，即有助人之事可做。” 我们给予他人什么?给予我们所拥有的。有时是金钱，有时是益人之言，有时是一个微笑，有时是一句鼓励的话，有时是鲜花，有时是我们的才智，有时是全身心地投入把事情做好。 让我们极诚实地说吧：我们是为了纯属自私的理由而助人的–我们助人，因为那种感觉真好。知道了这一点，当你有需要的时候，你对人的最大善意之一就是允许别人帮助你。 因此在助人过程中，谁是助人者、谁是被助者，很难分辨。一如在恋爱之中，不容易分辨谁是求爱的、谁是被爱的。 ###看一次日出日落的壮丽景观 从没有看过日出的人，实在是枉过此生了。如一粒种子在黑暗中酝酿、挣扎，以致毅然地长出嫩芽，旭日也是这样突破出来；又如毛虫在艰辛复杂的过程中蜕变为蝴蝶，太阳也同样经历很久的奋斗、摸索，才将黑夜化为黎明。 儿时痴恋日落，只爱感伤地看夕阳沉下去，惟有长大了始知日出的诗意是丝毫不比日落逊色的。在万籁无声的黑夜里，带着无限的忍耐和希冀，等待第一线宇宙的微芒，终于日出了！昨天过得不好，今天仍然可以再来，人岂不幸福？ 当日头和盘托出，朝晕全然倾泻大地时，就已如盛放的花一般，失去了许多的吸引力。不过，太阳是有灵之物，你越珍视它，便越能对它有奇异的感应。 看日出日落都需要等待，等待那转瞬即逝的一刻。马克·吐温曾在阿尔卑斯山因屡屡错过观日出而悔恨不已，他因何错失?日出的时候，他不是睡过了头，就是站错了地方。 有一句谚语说：手中的一只鸟，比林中的两只鸟更有益处。 机会往往是可一不可再的，不要以为来日方长，空过了一次良机无所谓，相同的机会不知何年何月才能再来一次! 姜太公在渭水之滨做无钩之钓，如果文王不能移樽就教，太公不能慷慨赴任，80岁的子牙有可能从一介钓翁而成为流芳千古的丞相吗? 鸿门之宴，项羽错过了杀刘邦的机会，才有日后的垓下之恨，可见机会一旦错失，竟可危及自家性命，怎么可以不谨慎呢? 机会的到来，在于时运的巧合，亦在人为。黄袍加身的赵匡胤得之于前者，袁世凯的称帝则由于佞臣的妄为。 从历史上看，多少英雄豪杰无不趁势而起，如拿破仑。当他在土伦当炮兵上尉时，英国和西班牙的联合舰队来侵犯，于是拿破仑得以发挥他的军事才干，痛击来敌。土伦一役，使24岁的拿破仑一下子被提升为少将旅长，奠定了他事业成功的基础。 机会犹如一只滑手的泥鳅，若是我们平常没有良好的准备，即使机会从身旁溜过，我们也只能束手无策，望机会而兴叹! 为了时刻能把握住机会，在心理上我们必须要有”不惧怕机会不来，而担心我们没有准备好”的观念，为成功创造先决条件。 日出日落的那一刻总是稍纵即逝，请你，一定要静心等待，在长久的等待和瞬间的辉煌出现的刹那，你会领悟到：人生的际遇也是如此。 ###到站台上送别 当你将远行时我有些心痛 想不到送别时是飘雨的天空 我们都将踏上渺茫的前程 也做好准备去度过风雨人生 我会给你写信的…… 不会问你路上 天空响不响雷 身旁刮不刮风 只问你旅程 手中有没有伞 天上有没有虹…… –于洛生 65. ###尝尽美食 厨师做的是天下头一号文章，色香味俱全的一道菜，有美术作品的感观刺激，音乐作品的绵绵余韵。清炒是一盘诗，红烧是一道杂文，涮火锅恰如随笔，烂炖的大锅中当然是一部长篇小说…… 中国菜系应该以长江为中轴线划分南派北派，尤以长江沿线呈多元化格局，长江从四川三江汇合经上海进入大海，沿江人的口味大抵是可以用甜酸苦辣概括之。上海人喜甜味，酸辣自是四川人登峰造极，而长江中段如湖北、江西人对苦瓜、莴苣、茼蒿、泥蒿、地菜这类有清苦味的菜情有独钟–长江沿岸的菜系最为复杂，甚至以甜酸苦辣还不能说明它的全部。往南往北情况就不同了，南以广东为代表，那些天气热的地方，不以味道论菜，惟鲜独尊，追根溯源，大约也就是没变质就不错，别将老广的口味提升到高得不得了的高度，地域的气候特点使然。湖南人就不讲什么鲜，湖南反倒是一个吃陈食的地方，他们喜欢将任何事物重盐腌之或烟火熏之，吃的那份腊味和烟味，仿佛要专门咀嚼一段岁月。北方就有些大一统，除山西人为代表的吃醋族以外，有两大类可以概括，东北人爱炖，西北人爱烤。吃烂炖的东北人和吃烧烤的西北人大致统治了北方菜系…… 中国菜的关键在于掌握火候，它贯穿于中国的中庸哲学，火候不到不好，火候过了也不好，应该恰如其分，掌握了这个关键，差不多可以到北大当个哲学教授。这个火候是经验性的，不好度量，不仅因菜有别，而且同一种菜，就是它的厚度、切法、勾芡与否都有密切关系，如果你要放酱油（酱油是惟一非油而冠之为油的事物），那就得炒老一些，炒嫩了酱油味道自然与菜游离，它与道家的思想是相背离的。放醋的菜分做两类，一是青菜类，这大抵是放了醋即要起锅，醋的沸点甚低，如是水鲜类如鱼，则大抵要早放一点，让醋的挥发带走水鲜的腥气而不至于将鲜味也盖了。当然，我们都有蘸醋吃的习惯，尤其吃水鲜，这是另当别论。醋是音乐中老说法的过门或汉字中的转折词，它无用却不可少。醋是一种销蚀钙质的事物，体内含量过多往往做不了英雄，这话有点道理却不完全正确。 有了火候，又有了酱油醋，再加上五香粉大蒜辣椒葱，做中国菜就足够了，当然不能缺盐。缺少盐的日子，我们的灵魂就无处寄托…… （古清生） 佛跳墙的名字好怪。何物美味竟能引得我佛失去定力跳过墙去品尝?我来台湾以前没听说过这一道菜。 《读者文摘》(1993年7月中文版)引载可叵的一篇短文《佛跳墙》，据她说佛跳墙”那东西说来真罪过，全是荤的，又是猪脚，又是鸡，又是海参、蹄筋、炖成一大锅……”这全又是广告噱头，说什么这道菜太香了，香得连佛都跳墙去偷吃了。我相信她的话，是广告噱头，不过佛跳墙，我也一直跃跃欲试。 同一年3月7日《青年战士报》上登了郑木金先生写的《油画家杨三郎祖传菜名闻艺坛–佛跳墙耐人寻味》，他大致说：”传福州的佛跳墙……在台北各大餐馆正宗的佛跳墙已经品尝不到了。……偶尔在一般乡间家庭的喜筵里也会出现此道台湾名菜，大都以芋头、鱼皮、排骨、金针菇为主要配料。其实源自福州的佛跳墙，配料极其珍贵。杨太太许玉燕花了10多天闲工夫才做成的这道菜，有海参、猪蹄筋、红枣、鱼刺、鱼皮、栗子、香菇、蹄膀筋肉等10种昂贵的配料，先熬鸡汁，再将去肉的鸡汁和这种配料予以慢功出细活的好几遍煮法，前后计时将近两星期……已不再是原有各种不同味道，而合为一味。香醇甘美，齿颊留香，两三天仍回味无穷。”这样说来，佛跳墙好像就是一锅煮得稀巴烂的高级大杂烩了。 北方流行一个笑话，出家人吃斋茹素，也有老和尚忍耐不住想吃荤腥，暗中买了猪肉运入僧房，乘大众入睡之后纳肉于釜中，取佛堂燃剩之蜡烛头一罐，轮番点燃蜡烛于釜下烧之。恐香气外溢，乃密封其釜使不透气。一罐蜡烛头于一夜之间烧光，细火久焖，而釜中之肉烂矣，而且酥软味腴，迥异寻常。戏名之为”蜡头炖肉”。这当然是笑话，但是有理。 我没有北方的朋友，也没吃过蜡头炖肉，但是我吃过”坛子肉”。坛子就是瓦钵，有盖，平常做储食物之用。坛子不需大，高半尺以内最宜。肉及佐料放在坛子里，不需加水 ，密封坛盖，文火慢炖，稍加冰糖。抗战时在四川，冬日取暖多用炭盆，亦颇适于做坛子肉，以坛置定盆中，烧一大盆炭，坐坛子于炭火中而以灰覆炭，使徐徐燃烧，约10小时后炭末尽成烬而坛子肉熟矣。纯用精肉，佐以葱姜，取其不失本味，如加配料以笋为最宜，因为笋不夺味。 “东坡肉”无人不知。究竟怎样才算是正宗的东坡肉，则去古已远，很难说了。幸而东坡有一篇《猪肉颂》：净洗铛，少着水，柴头灶烟焰不起。待他自熟莫催他，火候足时他自美。黄州好猪肉，价钱如泥土。贵者不肯食，贫者不解煮。早晨起来打两碗，饱得自家君莫管。 看他的说法，是晚上煮了第二天早晨吃，无他秘诀，小火慢煨而已。也是循蜡头炖肉的原理。就是坛子肉的别名吧? 一日，唐嗣尧先生招余夫妇饮于其巷口一餐馆，云其佛跳墙值得一尝，乃欣然往。小罐上桌，揭开罐盖热气腾腾，肉香触鼻。是否及得杨三郎先生家佳制固不敢说，但亦颇使老饕满意。可惜该餐馆不久歇业了。 我不是远庖厨的君子，但是最怕做红烧肉，因为我性急而健忘，十次烧肉九次烧焦，不但糟踏了肉，而且烧毁了锅，满屋浓烟，邻人以为是失了火。近有所谓电慢锅者，利用微弱电力，可以长时间地煨煮肉类，对于老而且懒又没有记性的我颇为有用，曾试烹近似佛跳墙一类的红烧肉，很成功。(梁实秋) ⊙吃的境界–知味 自然界能产生气味的物质约有20～40万种，一般人所能辨识的有200～400种。中国烹饪采用的调味品可达500种左右。味可分为基本型和复合型两种。基本型有9种：酸、甜、苦、辣、咸、鲜、香、麻、淡。复合型则难以胜计，目前可归纳为50种左右： 酸味型：辣酸、甜酸、姜醋、番茄汁。 甜味型：香甜、咸甜、蜜甜、水果。 咸味型：香咸、酸咸、辣咸、椒盐、黄酱、腐乳、怪味。 辣味型：胡椒、辣椒、芥末、生姜、大蒜、大葱、鱼香、家常。 鲜味型：咸鲜、甜鲜、蚝油、蟹黄。 麻味型：咸麻、辣麻。 淡味型：淡香、本味。 苦味型：咸苦、香苦。 香味型：酒香、糟香、五香、十香、花香、清香、果香、奶香、烟香、糊香、腊香、孜然、豆豉、桂皮、陈皮、咖喱、芝麻、冷香、臭香。 ⊙味觉的美学 首次效应：儿时第一次品尝到从未吃过的食物，会记忆终生；心境效应：轻松愉悦的心情，会给饮食抹上一层美的主观色彩；环境效应：宜人的就餐环境无固定模式，关键在于和谐协调，恰到好处；回忆效应：美食会唤醒多年的饮食记忆，令人陶醉，无可比拟；启迪效应：如老子所说”治大国若烹小鲜”；回味效应：美味诚然是一种美，回味则更是一种大美、至美。 对味的认识是一种技艺，是古老的，无止境的，而它又不同于一般技艺，因为它有一定的思想性、历史性。艺术的饮食活动最核心的内容是提高人们对味的认识，通过知味、辨味、评味、赏味的过程，丰富了精神生活，创造出一种舌头上的世界观，用它比较现实生活中的善味、恶味、臭味、香味、霉味、美味、没味、酸味、甜味、苦味、辛辣味、腐败味、邪恶味、清新味、清高味。 66、交一个异地或异国的朋友 现代人常发出这样的感叹：工作节奏越来越快，生活圈子越来越小，以至于在自己的周围越来越难以发现志同道合的朋友。于是，身处人海中，人们还是倍感孤寂，渴望友谊与爱情的造访。何不交一个异地或异国的朋友呢?20世纪50年代，无数意气风发的中国少年就曾以通信的方式结交了前苏联的同龄笔友，由此引发出数不清感人的友情故事。而在今天，我们可以找到更多的机会与异地的朋友相遇：旅途中、工作交往时、互联网上…… 你的生活将重新焕发异彩–跨越千山万水，有一颗跳动的心与你同在…… 微不足道的小事往往会演变成人生的重大经历!我从历时20年方告结束的一段生活经验中认识了这个真理。 这经验是我在21岁读大学时开始的。有一天上午，我在一本行销很广的孟买杂志某页上看到世界各地征求印度笔友的年轻人的姓名和通信地址。我见过我班上男女同学收到未曾晤面的人寄来厚厚的航空信。当时很流行与笔友通信，我何不也试一试? 我挑出一位住在洛杉矶的艾丽斯的地址作为我写信的对象，还买了一本很贵的纸簿。我班上一个女同学曾告诉我打动女人芳心的秘诀。她说她喜欢看写在粉红色信纸上的信。所以我想应该用粉红色信纸写给艾丽斯。 “亲爱的笔友，”我写道，心情紧张得像第一次考试的小学生。我没有什么话可说，下笔非常缓慢，写完把信投入信箱时，觉得像是面对敌人射来的子弹。不料回信很快就从遥远的加利福尼亚州寄来了。艾丽斯的信上说：”我不知道我的通信地址怎会列入贵国杂志的笔友栏，何况我并没有征求笔友。不过收到从未见过和听过的人的信实属幸事。反正你要以我为笔友，好，我就是了。” 我不知道我把那封短信看了多少次。它充满了生命的美妙音乐，我觉得飘飘欲仙! 我写给她的信极为谨慎，绝不写使那位不相识的美国少女感到唐突的话。英文是艾丽斯的母语，写来非常自然，对我却是外文，写来颇为费力。我在遣词用字方面颇具感情，并带羞怯。但在我心深处藏有我不敢流露的情意。艾丽斯用端正的笔法写长篇大论的信给我，却很少显露她自己。 从万余公里外寄来的，有大信封装着的书籍和杂志，也有一些小礼物。我相信艾丽斯是个富裕的美国人，也和她寄来的礼品同样美丽。我们的文字友谊颇为成功。不过我脑中总有个疑团。问少女的年龄是不礼貌的，但如果我向她要张相片，该不会碰钉子吧。所以我提出这个要求，也终于得到她的答复。艾丽斯只是说她当时没有相片，将来可能寄一张给我。她又说，普通的美国女人都比她漂亮得多。这是玩躲避的把戏吗?唉，这些女人的花样! 岁月流逝。我和艾丽斯的通信不像当初那样令人兴奋。时断时续，却并未停止。我仍在她生病时寄信去祝她康复，寄圣诞卡，也偶尔寄一点小礼物给她。同时我也渐渐成熟，有了职业，结了婚，有了子女。我把艾丽斯的信给我妻子看。我和家人都一直希望能够见到她。 然后有一天，我收到一个包裹，上面的字是陌生的女人的笔迹。它是从美国艾丽斯的家乡用空邮寄来的。我打开包裹时心中在想，这个新笔友是谁? 包裹中有几本杂志，还有一封短信。”我是你所熟知的艾丽斯的好友。我很难过地告诉你，她在上星期日从教堂出来，买了一些东西后回家时因车祸而身亡。她的年纪大了–4月中旬已是78岁–没有看见疾驶而来的汽车。艾丽斯时常告诉我她很高兴收到你的信。她是个孤独的人，对人极热心，见过面和没见过面的，在远处和近处的人，她都乐于相助。” 写信的人最后请我接受包裹中所附的艾丽斯的相片。艾丽斯说过要在她死后才能寄给我。 相片中是一张美丽而慈祥的脸，是一张纵使我是一个羞怯的大学生，而她已入老境时我也会珍爱的脸。 (未彻尼尔) ###衷心赞美你的朋友和家人 说一句话，可以改变、诠释许多事…… 说一句好话，可以使人心情愉快； 说一句坏话，不仅伤人，也伤害自己。 衷心的赞美，可以增进他人的信心； 恶毒的辱骂，可以抹杀一个人! 真诚的谏言，让人乐意接受； 虚伪的巴结，让人想接受也难，不想接受也难…… 愿你多说好话! 戴尔·卡耐基说：”用你的表情、声调和动作来表示他犯了错误，你就好比是当面告诉人家他错了。但是你能够当面说出他的错误吗?绝对不行!因为这样做会伤害了他的自尊、判断力和理智。如此，对方只会反击，而不会改变他的主张，即使用柏拉图或康德的理论去说服对方，也不会使他改变意见。因为你已伤害他了。” 与人相处，就应该多想想对方的优点，多多赞美他们，肯定他们。语言像是一种咒语，它可以让人快乐、愤怒、悲伤，也可以让人勇气十足、信心百倍。因此，如何说话是一门很深的学问。 事实上，你永远没有办法知道一个人内心里有什么，只有在他受到驱动和激励之后，才可以看得出你能不能把他发动起来。只要激励用得适当，把大门打开来，让人的潜能尽数发挥，他就会表现得比以前好。 如果你想让人知道他自身具有的品质，一定要在他的心里点上一把火，这个办法终会收效。他会体会到竞争的那种尖锐和兴奋的感觉，这种感觉可以推动人展露新的生气。他开始感觉自己具有以前从未发挥出来过的品质–实际上也是他以前从不知道自己具有的品质。日增的兴趣转为振奋，他真正活出来了–对自己、对工作、对别人都是这样。他乘着激励的力量翱翔，他已经捕捉到”你认为你行，你就行”的道理。这种经验激发我们热切地相信人有伟大的潜能。永远不要轻视任何人。我们总是有可能促使别人开放，自己也能获得人类最伟大的经验–认识和找到自己。你可以改变，变成一个新人，变成复活的人。旧的已经过去，一切都是新的，充满了活力。 ###把你所能想到的一件浪漫的事变为现实 浪漫，这个富于诱惑力的词汇让生活变得多么美，还是让我们听听罗素是怎么说的吧! “罗曼蒂克式的爱情在浪漫主义的运动中达到高峰，优美的诗歌把爱情的热望与想像表达无遗。爱情之树之所以会这么枝繁叶茂，是因为大多数人都认为，罗曼蒂克式的爱情是生命必须奉献的最为热烈的欢乐之泉。彼此倾心相爱、充满想像而又柔情似水的男女关系，有着不可估量的价值。对这种价值漠然视之于任何人都是一大不幸。任何社会制度都应当容忍和允许这种欢乐，尽管它只是生活的内容之一，而非生活的主要目的。” 自从意识到自己身患这种”不治之症”后，我便默默地接受了这个事实。其间，未曾有过一丝挣扎。 因为我深信，浪漫无罪! 为它而死，死而无憾。 之所以用这样黑色的口吻来诉说”浪漫”一事，吐露的无非是一种无奈的伤感–一种不为世人所容的慨叹。 曾经，当你我都更年轻、更单纯且涉世未深之时，生命里涌溢着无比的热情，任何不经意的挥洒，都可能成就出一幅动人的、属于自己的图案，且从此，这张色彩浪漫的影像便会不时插播于脑海之中，及时拉起自己此刻沉沦的心情，乘着记忆的翅膀，飞向浪漫的从前…… 或许那是个曦微初露的清晨–你不屈不挠地踏遍了家及学校附近的所有花店，只为了寻找一束深具”离别”意味的黄玫瑰，要把它交至即将远行的友人手中，希望她(他)握着你的祝福，别后的日子能更顺利。 也或许那个小雨淅沥的午后–你睥睨着身旁拥嚷于一把小伞下，结果却还是都湿了半个身子的三四个人，耸肩摇头：”没伞又如何?”遂兀自蹬着你心爱的座骑，漫行雨中，一面哼着”Raindrops falling on my head”这首轻松小调，一面还不忘示范《虎豹小霸王》一片中保罗·纽曼所表演过的单车特技。 更可能那个凉风轻拂的夜晚–你裹着一袭单薄的衣衫，瑟缩在泛着草香的平野上、星空下，仰首等待着一颗流星的经过，贪婪地要向它倾吐心底的夙愿，急切地要为心爱的家人、好友祈福……直到眼也花了，脖子也酸了，发也乱了…… 最后，人也老了。心灵不再易感，行为不再洒脱。同样飘在天上的白云，落到地下的黄叶，此刻，却再也无法让你心中有一丝的触动与惊喜：你是真的老了! 老了，是因为浪漫的殇逝。你无法再坚持这种所谓”不切实际”的”年少”情怀，”他们”总是絮絮叨叨地劝你要把精神心力放在”名、利、权”的争逐上，而你也隐约感到这三者之于你的诱惑越来越难以抗拒…… ###给自己颁发一个”奖” 可以说，给自己颁发一个”奖”，是自我激励的重要部分。诚恳的鼓励不仅能给别人以力量，而且还可以帮助自己努力求得发展。不断进行自我奖励，这会使你的成就和你的行动连成一体，为你提供持久不衰的满足。 特别重要的是要记住，在你失败或者失误的时候要亲吻自己。自我的激励，能使你的待人处世的方式和领导管理能力逐渐趋于成熟。不要总是自责或惩罚自己，在取得成绩的时候要学会赞扬和奖励自己。庆祝成功并知道自己值得奖励，这很可能是最重要的技能。 一个颇懂”奖赏自我”之道的女孩曾这样叙述自己的经历： “小时候，帮母亲做了一点家务，她就会笑着奖给我一颗糖；读书时，每次考了高分，父亲也会不时拿出点奖品作为奖赏。那时候，经常会为了得到糖果、玩具等而主动地做家务、努力学习。现在，我不再依赖父母的奖励，而是不断地奖励自己。大学毕业后，我所在的单位资不抵债，宣布破产了。有很长的一段时间，因为胆小，怕面试时用人单位对自己说’NO’而待在家里，几个月过去了，我无所事事，父母用微薄的工资来养活我这个已成人的’小孩’。有一天，我对自己说，如果今天我去两家公司应聘，回家时就给自己买下那条心仪已久的长裙。我做到了，记得当时我是用向母亲借的钱来完成对自己的承诺的。一星期后，我居然同时收到那两家单位的用人通知。” 中国人如今是太需要懂得”奖励自己”这个道理了。中国千百年来的传统教育都强调”克己”二字，其实是有很大的片面性的。 这往往容易把”忧国忧民”、”艰苦朴素”这类行为过程曲解为人生追求的目标，使得中国人祖祖辈辈想到的只是奖励他人，或者等待他人的奖励。这样的一种事实，除在某个角度可谓”崇高”、可谓”悲壮”外，实际上从某种程度上而言真是有点悲哀!列宁说过：”不懂得休息，就不懂得工作。”这才是真正的辩证唯物主义。工作和休息是对立统一的，创造和享受是相辅相成的。我们应该成为快乐的劳动者，我们有理由成为快乐的劳动者，而一个快乐的劳动者，是懂得”奖励自己”的。这也说明了，”奖励自己”本身就包含着劳动价值的实现和对劳动者本人的尊重。 为了完美，我们不晓得花了多少心血，结果呢?也许你花了一天的时间就完成了99.8％，但因觉得还不够完美，于是再潜心加强。一个月后，往前推到了99.9％，值得吗?多花了30倍的心血，进步的幅度却只有0.1％而已，投资回报率也未免太低了点吧! 不完美并不代表我们就不能恭贺自己，只要能比以往进步一点，就值得我们乐上半天。 真正把”奖励”的技巧应用在自己身上的人少之又少，不懂得奖赏自己的人，生活总是缺少光彩。然而越是懂得随时奖励自己的人，越是能过着成功快乐的生活，因为他们通过自我奖励而发挥了下面几项神奇的效果： 一是觉得自己越来越有信心，越来越肯定自己(毕竟别人的肯定还不如自我的肯定)，而且”积小胜为大胜”是自信的基础。 二是觉得越来越有成就感，因为你很清楚你做了什么、完成了什么，这是一种”自我实现”–生命最高峰的体验。 三是充满了旺盛的斗志和进取心，因为你所要的东西(不论是物质面或精神面)会刺激你不断地追求，更上一层楼。 自我奖励是你自己颁奖给自己，而非别人颁发给你。自我奖励是只要完成一项目标或任务(不管在竞赛中是输或是赢)，就要奖励自己一次。 如果你善于自我奖励，那么你将沐浴在一种完全积极、胜利的环境之中，可能你身上的西装、领带、鞋子、公事包、眼镜、手表，家中或办公室的摆设、用品……任何一件东西背后都有其光辉的意义，那么它们所带给你的效果，不会亚于那些锦旗或奖牌的。如果你给自己的奖励是去旅游、吃一顿牛排或看一场电影，那么你也能想像得出当时的心情和感受是如何的棒了。 大多数人所处的环境几乎都是消极的(听到的、看到的、遇到的……)，而对那些有目标、能力争上游，勇于面对挑战的积极者而言，他们会有所警惕并离开消极的环境(至少不受影响)，但这还不够，一定要为自己塑造一个完全积极、正面并且有所回馈(也就是奖励)的胜利气氛，只有如此，在增强自信心、强化斗志乃至享受人生的层面上才会如鱼得水、相得益彰，并产生相互的推动力及良性的循环效果。 不要吝啬，尤其是对自己，请随时随地奖励自己一下，不要忘了–”你自己才是你最要好的朋友、最大的客户”。 首先列出你要完成的目标或任务(从小到大)。例如年收入200万是一项长期而且大的目标固然要列入，但”明天我要拜访5个人”或”我要打一个很重要的电话”等小的目标也要列入，只要你认为这对你是种挑战，不论大小，统统列入。 针对所列的目标加以分类并予以周详计划。 在每一项目标的右边列出当你完成这项目标时，你要给自己什么奖励，买什么东西(从车子、衣服到一本书)，做什么事(带家人休假几天或是看一场电影)，任何你真正想要的、喜欢的，不论大小，都可以列出来，即使只是告诉自己”你做得真棒”也是一种奖励。 切记要遵守诺言，该奖励的就要奖励，不要以为对自己食言没什么关系。 随时增添、删掉或修正你的目标和奖励的项目。 ###接纳困境，并试着与之周旋 世界上没有人终生一帆风顺。任何一个人都会遇到逆境。得不到信任、无端遭受打击和排斥、经济拮据、事业不畅等种种的困难和不如意，使无数人的心中充满烦恼。有的怨天尤人，有的自暴自弃，有的报复社会，有的伤害自身。他们恰恰忽视了一条真理：逆境是磨炼人的最高学府。纵观古今中外，逆境几乎是所有伟人巨子成功的基石。那位留下了”千古之绝唱，无韵之离骚”的司马迁暂且不说，文王拘而演《周易》，仲尼厄而作《春秋》，屈原放逐乃赋《离骚》，左丘失明厥有《国语》……这些古圣先贤哪一个不是在逆境这所学府里培养出来的?再看世界，发明大王爱迪生因被认为是低能儿被迫在小学就退了学；文学家、社会活动家海伦·凯勒集聋哑盲于一身；贝多芬耳聋却写出不朽的传世名作；高尔基从未进过学校读书却成为伟大的文学家。 和他们所遭遇的挫折与不幸相比，我们那一点点小小的挫折又算得了什么呢? 我们每一个人都是以自己的心态去看待生活。胸怀江河者看到的逆境是暂时的回流，回流之后又是可以放舟千里的浩荡之水；而胸怀溪涧的人面对逆流便以为人逢绝路，只能永久地停留在此岸了。由此可见，人生奋进的关键是培养自己博大的胸怀，因为只有博大的胸怀，才能容纳困难与挫折，才能发现广阔的汪洋大海中到处可以航行。 苦难的逆境，使庸者变得卑琐乖戾，使强者变得坚韧聪慧。一个装着香水的无口之瓶，只有打碎它才会散出幽远的馨香；一块朴拙的顽石，只有经过无情的雕琢，才会成为完美的艺术品。一切美好的东西是不会自然地展现在你面前的，那伤痕累累的心理感受，恰是生活给予你的馈赠。心理上的每一道创伤留下的疤痕，成长中留下的珍贵记忆，都是一次演练、一次成功。 逆境又是我们真正能照见自己的镜子。应付逆境的能力反映出一个人的勇气和意志力。逆境之后便是一段坦途，坦途之后还会有坎坷或逆境。这就是生活的逻辑。一个人倘若练就了在逆境中的沉着稳健，那么他在顺境中怎能不勇往直前呢? 纪伯伦说，除了通过黑夜的道路之外，人们无法到达黎明。海伦·凯勒深切地感受到，在获致无比丰富的生命体验的过程中，如果一帆风顺，那我们将失去一些发自内心深处的无上喜悦。只有穿越黑暗幽深的山谷，到达山顶的时候才会欣喜若狂。没有逆境中的苦战，哪有强者的胜利?没有战胜困难的艰辛，又哪有成功者的喜悦?逆境过后只有两种结局，一是失败者的气馁，二是成功者的欢欣。战胜一次逆境，人生就多一份充实和成就。被逆境征服的人，就只能在失败面前垂头丧气。现实生活中这两种人都不少见啊! 一个孩子要学会走路，先得学会摔跤。卓越者有一个特点，就是在逆境中百折不挠。摔一次，站起来，再摔一次，再站起来。摔了若干次，爬起来若干次，他的筋骨因摔过许多跤而强健了，他的意志因磨炼过而变得坚强。”如果你脚下倒伏着一千名失败者，那就把我算做一千零一名吧!”这才是强者的勇气。 ###做一名志愿者或无偿为弱者服务 ###为灾区及慈善福利机构募捐 在德国北方一个小镇的修鞋店内，有一个用红白大理石修建的专为非洲捐鞋的”捐鞋台”，几乎每天捐鞋台上都摆放着各种各样的鞋，这些鞋看上去都非常干净，同新鞋没有什么两样。震撼着人们内心的，是店内正面墙上悬挂的一幅黑白大照片：一个瘦骨嶙峋的黑人躺在杂草丛生的公路旁，两手抱着流血的双脚，痛苦万状。鞋店店主正是因为看到这张20世纪60年代的照片，改变了自己的人生。他萌生了向非洲捐鞋的想法，于是他辞去鞋厂主管的职务，办了修鞋店并修建了捐鞋台。他说：”看到这张照片时，我有生以来第一次在众人面前流下了眼泪，那是一个日耳曼男人的眼泪，绝不是轻易流淌的。” 向灾区以及慈善福利机构捐赠，其实是在诚捐–一份诚挚的爱心。 帮助弱者最好或最简单的方法，莫过于少为自己买件新衣，把省下的钱捐给他们；或收集不再用的旧物将它们捐给有关机构，请他们转赠给需要的人。 如果你正想归属于一个更大的人际网络，那么就清理你家中的衣柜，并要求亲友也这样做，然后来个大赠送。让这些衣物被再利用，可以建立更好的共同体意识。这种捐舍的方式，最能让你觉得自己不是孤岛，而是社会大陆的一部分。 ###学会在各种压力下生活只要活在这个世界上，就不可能完全逃避得了压力。既然如此，对于不断加诸我们身上的各种要求，学习怎样有智慧地因应，就属绝对必要了。 我们的身体，就是被设计来应付突发的危险以便做出迅速反应的。面临生死存亡关头的突发状况时，压力在刹那间出现，这也是我们的身体发挥最大潜能的时候。此时，我们的身体会迅速分泌肾上腺素到血液里，对我们意识到的危险做出最迅速的反应。就像有些人在千钧一发之际，从车轮下救出一名儿童或小动物，那种神经的突然绷紧，会让人们的精神维持在一种很高亢的状态。我们突然间承受了巨大的压力，但同时也把自身的体能和精神状态推到了最高峰。 在麻省Amherst学院曾进行过一个有意思的实验，他们用铁圈将一个小南瓜整个箍住，以观察当南瓜逐渐长大时，对这个铁圈产生的压力有多大。研究人员希望了解这个南瓜能够在这个过程中，与铁圈互动产生多少力量，以便了解这个南瓜能够承受多大的压力。最初他们估计南瓜最大能够承受大约500磅的压力。 在实验的第一个月，南瓜承受了500磅的压力；实验到第二个月时，这个南瓜承受了1500磅的压力；当它承受到2000磅的压力时，研究人员不得不对铁圈进行加固，以免南瓜将铁圈撑开。 最后当研究结束时，整个南瓜承受了超过5000磅的压力后才产生瓜皮破裂的现象。 他们打开南瓜并且发现它已经无法再食用，因为它的中间充满了坚韧牢固的层层纤维，试图想要突破包围它的铁圈。为了吸收充足的养分，以便于突破限制它成长的铁圈，它的根部甚至延展超过几万米，所有的根朝不同的方向全方位地伸展，最后这个南瓜独自接管控制了整个花园的土壤与资源。 我们常说”人无远虑，必有近忧”，用以表示压力无时无刻不存在于我们四周。每一个年龄层都有其特殊压力：例如青少年时，以课业压力为主；到成年时，有家庭和工作的压力；步入老年期，要面临退休、孤单、死亡等种种压力。 角色的扮演不同，压力也不尽相同。当老师和当学生的压力不同；做主管和做员工的压力不同；身为父母和身为孩子的压力不同……而一个人往往是身兼数种角色，集数种压力于一身。 如何应付生活压力? 别为小事抓狂。我们经常为一些小事抓狂，其实仔细想一想这些都不是什么大不了的事，我们只是专注于一些小问题上，把问题过度放大了，浪费宝贵的力气为小事抓狂，当然就无故增添了许多压力。 小心你的想法滚出雪球效应。越是全神贯注于令你心烦的细节上，你就越觉得糟糕，思绪一个接着一个，直到你变得焦虑到不可思议的地步。即时打住，防患于未然，并且要察觉自己的情绪，不要被情绪低潮所愚弄，完全以负面情绪来看待周围的人和事物，小小的压力，可能瞬间变成巨大的压力。 练习放松数到10。当你感到被压力所困时，深深地吸一口气，大声对自己数1，然后在吐气时放松全身，数2～10，重复这个步骤。这个方法帮助我们把大事化小，压力也就消失于无形。 你会变成你最常练习的样子。如果我们常在生活中表现出生气、愤怒、焦虑不安，我们的人生可能就会反映出这类练习的结果，”相由心生”就是这个道理。相反地，若是我们经常练习有耐心、放轻松、肯学习、积极乐观的态度，即使面临压力，也能从容应付，化解压力。 75、以难以忘怀的方式迎接新年的到来 &quot;人生最有趣的事情，就是送旧迎新，因为人类的最高欲求，是在时时创造新生活。&quot;李大钊的这句话激发着人们对美好未来的想像。 人们迎新，迎的是万象更新，迎的是春天里复苏的天地之间的万物生机。迎新的庆典，是生命的礼赞，是为万物之灵高唱一曲新歌。 我最喜欢的节日是新年。只是过新年时我不能总待在家里，因为我是个海员，而且在船上也不能马上知道在哪里迎接新年，是在航行中还是在家里。 就像这次出航一样。 我们应该新年过后结束航行，可大家拼命地忙碌，都想尽早一点到家，因此，还在英吉利海峡时，船长就请求大家加劲儿干了，而天气也挺给面子：风儿像听人操纵–从西方吹来，我们像长了翅膀一样，波罗的海水平如镜，仿佛不是冬天。 12月31日，我们停在泊地。当锚”扑通”一声落入水中时，我们便不耐烦地等待着。看表–23：00。我们的船到终点了。于是我登上出租汽车，”啪”地一声关上车门，出租汽车开动了。 出租汽车司机加快了速度，看来，他明白我需要什么。路上我们交谈着，”你看，”我夸耀着说，”我给儿子带来了这样的礼物!”我坐在后面的座位上，把在国外买的圣诞老人面具戴在脸上。 出租汽车司机转过身来。”唉呀!”他说话有时咬字不清，”你不要摘下它!这样回家会有笑声的!””为什么不!是的，我的小莺儿会高兴地说：’真正的圣诞老人来了!’就这么办。”我付清车费，就跑着进了大门。 我瞧了一下表：0：30，正是坐在新年桌旁的时候。 我乘电梯上去，心怦怦猛跳着，像海上风暴天气时那不好固定的锚一样。 而我想，我的柳芭莎也许在等我呢!我打电报说三四号回来，而我提前回来了。不知现在将会发生什么!……我按了一下门铃，门铃响了。她打开了门：”唉哟!这是怎么回事?” 她穿着我上次航行时从卡萨布兰卡带来的漂亮衣服，两腮发红，头发上别着发光的金属小片。”我们没有订购圣诞老人，”她说，”大概您得到别人家去。””怎么可能呢?”我问，而自己忍不住笑了，换上了一种特别的声音，”地址是：爱依司玛埃大街76号第82门斯维亚托格收，是这样吧?””是这样。但是我们没有订购。””不可能吧?””唉， 对啦!”柳芭莎两手一举一拍，”大概这是我丈夫在航行中，打电报给我们订购了意外的礼物。””对，”我证实道，”我们收到了这样的电报。””唉!我怎么一下子没猜想到!好吧，您请进来。” 我走进去。屋里的客人有邻居和他们的小男孩–正同我的儿子在新年松树周围扮兔子玩。他们看见了我，一个个兴高采烈。”这是我的丈夫给我们准备的礼物!”柳芭莎向客人们解释着–我打开了手提包，客人们惊得目瞪口呆!孩子们多么高兴!成年人也是如此。 柳芭莎激动地拭掉了眼泪，她吻着我的儿子。”你看，”她说，”你有这样的爸爸，儿子!他准备了我们意想不到的礼物。”我瞧着她，感到有什么话哽在喉咙里说不出来，唉，我真想扯下假面具，宣告一切。但我明白这样做会使儿子失去兴致，因为他们毕竟把一切都当做了真的–我是”圣诞老人”。 我看出–需要告别了。我说了声”祝新年幸福”就要出门。柳芭沙向我致谢，甚至塞给我5元小费，而我忍着没有笑出声来。 来到大街上，雪下着，美丽而宁静。我摘下假面具，走到十字路口，看到了出租汽车。”去港口。”我说。”喂，海员，怎么新年还要出海?”司机问。”什么情况都可能发生。” 他把我送到港口，我在自己的船舱里睡了几个钟头。一清早，我又出现在家里。”您好，亲爱的!”我解释着，”刚刚从海上归来。””亲爱的，感谢你带给我们的礼物，”她说，”尤其是那个圣诞老人。我们从没有这样快乐地迎接新年!” (维·罗申科) 中国的新年又叫春节。中国古代历法被叫做农历，这是极具象征意义的，它表现了中国人与生态环境的关系。人们把大地回春之际认定为新年，这时，人与自己周围所有的生灵，无疑是相通的了。是天地万物之生命再生的欢乐，使这个节日成为真正意义上的普天同庆。我们每次迎接新年，都是在迎接万物生命的新开始。 喜迎光明，喜迎新生。在这光明与黑暗、生命与死亡角逐并存的漫长岁月里，人们在迎接新的一天、新的一年时，从心底发出了对光明的礼赞和对生命的祝福。 我们能够把神秘朦胧的未来，雕塑成我们想像的东西，正如一位雕刻家把一块不像样的石头雕刻成一座石像一样。 我们又像农夫。如果我们播下良种，就可得到良好的收成；如果我们的种子低劣，就会得到无用的收成；如果我们不播种，就没有收成。 我们希望未来比过去更好，我们不愿未来再延续历史的错误。我们都应该关心未来，因为我们要在未来里度过余生。 过去的已经过去了，是静止的，我们没有办法改变它。而未来是跃动着的，我们的任何行为都会影响它。只要能充分认识它，未来会给我们带来新的境界。人们都在为未来付诸各种各样的努力，而在新年之际，处于新的起点，一切都是进步的开始。 76、按照自己设计的样式装饰你的家 家居生活中，常有一些美的景象，却鲜少有人注意：梅子酱透过的日光；肥皂泡上的彩虹；蓝色碟子里的蛋黄；白纱幔渗过来的月光；盛着果汁的玻璃杯；小屋中的蓝色百叶窗；石缝中的红玫瑰；新烘烤的面包香；古铜台上的烛光，以及宠物狗眼睛的棕黄。 家居的氛围，应是自然与和谐的，这需要你亲手创造。由内而外，由整体到细微处，倾情装饰你的家，营造属于自己的空间，这是保持温馨健康的家庭环境的重要一环。 回到了甜蜜的家，只有一星期的假日了，我们开始疯狂地布置这间陋室。我们向房东要求糊墙，他不肯，我们去镇上问问房租，都在300美金以上，情形也并不理想。 荷西计算了一夜，第二天他去镇上买了石灰、水泥，再去借了梯子、工具，自己动起手来。 我们日日夜夜地工作，吃白面包、牛奶和多种维他命维持体力，但是长途艰苦的旅行回来，又接着不能休息，我们都突然瘦得眼睛又大又亮，脚步不稳。 …… 最后一天，这个家，里里外外粉刷成洁白的颜色，在坟场区内可真是鹤立鸡群，没有编门牌也不必去市政府申请了。 …… 家是一个很有吸引力的地方。孩子一放学就飞奔回家，因为那儿有父母的慈爱迎接他，有香热的餐点在等着他。上班族也一样，一下班就要赶回家，因为那儿是自己的归宿。它安全温暖，是精神和希望寄托的地方。家是心灵生活的天地，没有它就叫无家可归，就失去依靠，就成为漂泊的流浪人。 家像是花圃一样，它供应了花木的营养。不曾被精心整理的花圃，只能长出泛黄的花草，甚至孕育不出生命，成为不毛之地。家庭预示一个人的命运，家庭多情趣，孩子自然活泼，成员都能学习新知，分享其中的兴趣和知识，个个都聪慧健康。 居住在由你和家人亲手装饰设计的房子里，家的氛围就弥散开了…… 家里必须有几样情趣，它能使心境轻扬灵动，使人清纯振作，更重要的是它给人心理健康和幸福。客厅里的气氛，越是显示出功利和欲望，气氛就越沉闷；越懂得生活的情致，越容易保持温馨和谐。 经营家庭情趣，就像经营一块富庶的土地，让孩子得以健康地成长，活力充沛，从而培养良好的品行和兴趣。成人也是一样，有了美满的家庭，才有应付挑战、肩负责任的本钱。 家居情趣，建立在闲情、恬淡和富于创意的生活中。如果缺乏情趣，就好像没有开阔的空间可以挥洒，缺乏清净的空气可以呼吸，那会是一种僵化的、没有生机的生活。因而，我们要创造一点家居的情趣–从家居设计到精神情境，真正提高生活的品质。 77、为自己许一个愿，并为实现愿望孜孜以求愿望，是每个人心底最美丽的秘密，当你为实现愿望而付诸行动时，一个”痛并快乐”的旅程就展现在你的眼前…… 记得上一次过生日时许下的三个愿望吗?如果你没有许愿，或根本忘了曾经许下的愿望，那么，让我提醒你：赶快许愿。并祝福你，美梦成真。 不一定要在过生日那天才能许愿，当你有一个强烈的念头，愿意倾一生之力，去实现、去完成时，就可以许下你的愿望。 这个故事其实在反映我们的人生。有很多人在20岁以前活在家人和老师的期许之下，背负着很多的压力；20岁之后开始以满腔的热血，准备去实现自己的梦；可是工作了20年后，开始发觉工作不如意，于是就开始抱怨老板、抱怨公司、抱怨社会，就在这抱怨中又过了20年。 于是告诉自己，60岁了没什么好抱怨的了，就默默地走完自己的余生吧。到了80岁生命将尽时，才想起自己好像有什么事还没完成。 原来，他20岁的梦想还没有实现。 叔本华对”愿望”的阐释可谓精辟独到：”愿望，其本性，即是痛苦，’获得’立刻产生餍足，结果非常明显，占有使生活失去了情趣；愿望和需求在一种新形式之下呈现；若不如此，则跟随的是荒凉，空虚，倦怠；而反抗此倦怠等的挣扎恰如反抗需求一样痛苦难过。欲望和满足，若彼此相伴，既不太快也不太慢，则可减轻太快或太慢时的痛苦到最小程度，造就最幸福的人生。这在某种意义之下，我们可以称之为生活的最美部分，最纯洁的快乐。” 只有肯为自己许愿的人，才会对未来有美好的憧憬；也只有用心盼望的人，能够享受”如愿以偿”的快乐。 千万不要害怕说出你的愿望会被取笑，也不要顾虑：”万一将来做不到，会很没有面子!”当你说出你的梦想、许下愿望，人们才会知道如何帮助你达成。 就算有人要说风凉话、扯后腿，他们这些心怀不轨的人，都会败在你的决心中。只要你的意志坚定，只要你付出足够努力，所有的阻碍终将节节败退。而你，最后一定会赢得梦想、实现愿望。 人间有三苦：一苦是，你得不到，所以你痛苦；二苦是，你付出了许多代价，得到了，却不过如此，所以你觉得痛苦；三苦是，你轻易放弃了，后来却发现，原来它在你生命中是那么重要，所以你觉得痛苦。还好，人间有三乐。一乐是，你得到了，所以你快乐；二乐是，你付出了许多代价，最终得到了，但它是值得的，所以你快乐；三乐是，你很快地放弃没有必要的负担，所以你快乐。人间三苦三乐，是我们常有的体验。许多人曾为得到的而快乐，也曾为失去的而难过。 实现愿望和丢弃梦想就是这样一个得与失的过程，它贯穿着你的一生。 在一本名为《牧羊少年奇幻之旅》的畅销书中有这样的话：”没有一颗心会因为追求梦想而受伤。””当你真心渴望某种东西时，整个宇宙都会联合起来帮助你完成!” “对那么好的成果，想都不敢想!”说这种话的人不是谦虚，就是很没有志气。缺乏梦想、没有愿望的人生，真的很没有意思，绝对不会绚丽多彩。你怎能指望一个对未来没有任何期待的人，会活得精彩。 79、体验一次失败的经历，学习承受失败 佛经里有一句话：”众生以菩提为烦恼，菩萨以烦恼为菩提。”或说”烦恼即菩提”，意思不是烦恼等于菩提，而是说有慧心的人总能在烦恼中找到智慧，而且为了治愈更多的烦恼，产生更高的智慧–平顺的人通常不会比越挫越奋的人有智慧，真正有智者往往能不惮失败的烦恼。安乐令人沉沦，忧患反而激发生存的力量，也就是这个道理。 在现实生活中，失败当然是一件可怕的事，几乎没有人喜欢失败；可惜这世界上没有永远的成功者，我们可以肯定地说：”那些在人生后半段成功的人，是由于他们在人生前半段的失败中找到了成功的灵感。”惟有在失败中成功，才不只是形式与事业的成功，而是连心灵也成功了。 你若今日造访我在加州的办公室，你会注意到房间的另一边摆置着一片美丽的旧式西班牙花砖，以及红木制的小吧台，外加9把皮面的高脚椅(过去药局里常用来贩卖冷饮的那种吧台椅)。不寻常吧?这些皮椅若能说话，它们会告诉你，我也曾有过一段低潮沮丧的日子。 那时二战刚结束，经济十分低迷，工作机会难求。我丈夫鲍比原本向人借钱买了间小型的干洗店，收入还足够养活一家四口，以及应付汽车、房屋等贷款。后来由于经济萧条，我们的经济一下子陷入了拮据的状态。 我想赚钱贴补家用，但我既没上过大学，也没有特殊才能，实在不知道做什么，这时我突然想到高中的英文老师，她鼓励我向新闻报道方面发展，并指派我担任校刊的编辑，我自忖：”我可以为本地小型的周报写些《购物指南》之类的专栏，来赚些稿费偿付贷款。” 当时我们把车卖了，更花不起钱请保姆，所以我把两个孩子放在一辆摇摇欲坠的婴儿车里，后面绑个大枕头，一路上，车轮不断倾斜掉下，我只好用鞋跟把轮子敲回去，再继续向前走。就在这走走停停的当儿，我更下定决心不让孩子像我以前一样挨饿受冻。 然而在说明来意后，报社的负责人对我摇摇头：”抱歉，经济不景气。”情急之下我想出了个主意，如果让我刊登《购物指南》，我自己负责找广告商，负责人最后同意给我一段时间，但他劝我别抱太大希望，可能我推着那辆破婴儿车到处找广告商，找上一星期也不会有什么下文。但他们错了! 既然你已花了不少时间观看比赛，现在想想失败的本质。先回想以前你参加比赛的时刻、同时有许多竞争者的求职经验、交男友或女友的情形。你可能跟大多数人一样，曾在玩纸牌、下棋或跳房子等游戏中输过不少次。你当时的感觉如何?你如何承受失败? 失败到底意味着什么?你失去了什么?许多人在心理上有障碍，所以很难去爱，因为他们不知道如何承受失败。他们认为失败是很个人的事，好像天底下只有他们会发生这种情形似的。参加比赛的人难免有输的时候，如果你想在人生的任何领域发奋图强，就迟早都要面对失败。承受失败就是把重点放在你所做的努力上，自己告诉自己，你已尽了力。 有时候你不必再去想该有的回报。重要的是你有梦，你有全身投入的热诚，而且虽然为了达到所欲而殚精竭虑但仍不失自尊。不要想事情的结果，如果你足够努力，一定会有某种成就。爱迪生曾说他不得不发明电灯泡，因为他做别的事都已失败了。 如果你懂得承受失败，你就会谅解爱的本质，因为爱就是要有欲望，要冒险，要受到伤害，要全心投入并且不论后果如何都觉得非常美妙。一个再度陷于热恋的青年，曾把神魂颠倒的情形告诉一位挚友。挚友问他的感情是否会得到相同的回报，他回答说不太确定。挚友于是说：”不管是赢是输，你都赢定了。”我们永远都不要忘记这句话。就某件事而言，我们是输了，但事实上我们赢了。因为我们曾经爱过，我们赢得的是曾经历的那种感情，而不是回报的有无。 81、团队合作 在大自然中有许多合作精神的典范，成群结队的飞雁永远跟从领袖，直到领袖由V队形的顶端飞回到自己的位置，此时自会有另一只雁取代它的位置，而不会影响队形。大自然的合作还有其他的例子：夏日甘霖为绿油油的植物带来生机；潮水后退，露出食物供海鸥取食；树叶落在大树脚下，慢慢腐化，供给树木充足的养分。你可以由这些大自然合作的例子里学到合作精神，运用在工作上。你所做的一切都可以成为整个组织不可或缺的一部分，你所做的一切都会影响你的合作者，以适当的方式塑造他们。 在企业界，最佳的领导人最能激励人心达到共同的目标，并且让群体的所有成员都相信他们是同心协力达成的。最佳的领导人知道何时该采取行动，何时该被动，何时别人会接纳他的话，何时别人不会听他的劝。因此最好的领导人能够把自己当成和旁人一样，既不高压领导，也不被动跟从，能够卷起袖子，身先士卒地做该做的工作，而不在乎既定的”角色”或是令人艳羡的职位，他总是适时赞美，而不愿判断批评，能够以身作则，建立起合作精神。 82、买几张彩票 据说，有位英国人每星期都要买一张彩票--每次都买同一个号码。他买了几年，却连末等奖都未中过。有一天，他又去买彩票，看到路边站着无数卖玫瑰的花童，情人节到了。他犹豫了一下，用买彩票的钱给妻子买了一支鲜红的玫瑰，然后，转身回家了。 开奖的日子到了，那个中奖号码令他几欲昏厥：正是他一如既往地买了几年的那个号码。 这个故事之所以广为流传，是因为太多的人都认为”运气”时时与自己失之交臂。人们大都有”碰运气”的心理，在某种程度上，”运气”等同于”希望”。人们盼着好运气就在不远处等着自己，却不自知，我们本身就是个幸运儿。 如果今天早上你起床时身体健康，没有疾病，那么你比其他几百万人更幸运，他们甚至看不到下周的太阳了； 如果你从未尝试过战争的危险、牢狱的孤独、酷刑的折磨和饥饿的滋味，那么你的处境比其他5亿人更好； 如果你能随便进出教堂和寺庙而没有任何被威胁、暴行和杀害的危险，那么你比其他30亿人更幸运； 如果你的冰箱里有食物，身上有衣可穿，有房可住及有床可睡，那么你比世上75％的人更富有； 如果你在银行里有存款，钱包里有票子，盒儿里有零钱，那么你属于世上8％最幸运之人； 如果你父母双全，没有离异，那么你的确是那种很稀有的地球人； 如果你正在阅读本书，那么你就得到了一个双重的祝福，因为有人想到了你，而你并不属于那另外的20亿文盲之列。 在25亿个精子中，只有一个能和卵子结合；就算如此，也不是每一个胚胎都能成功地诞生到人世。 再说，能够成长到你目前的年龄，你必须从许多可能的疾病和意外中生存下来，更不必提及台风、火灾，或被病毒、泥石流侵袭的可能性。但是，尽管有上述可能，你还在这里。 当然，生活中会有时运不济的人，这是人生旅途中的一段灰暗路程，人人都可能遇到，只不过有些人遭遇的时间短一些，有些人遭遇的时间长一些。然而，一辈子都时运不济的人很少。 面对时运不济每个人都可以有两种选择，一种是怨天尤人，另一种就是活得更起劲，只要审时度势，自强不息，总有一条很宽广的路是为你准备的。 看看你自己有多幸运，一旦明白你是多么重要、多么有价值后，笑容会在脸上绽开，阳光会从乌云中探出头来，美妙的音乐处处可闻，而你则终将带着信心、勇气、力量和恩宠朝着你的人生方向前进。所以，去工作不要以挣钱为目的；去爱而忘记别人对你的伤害；去跳舞只要自己欣赏，而不管是否有他人关注；去唱歌只要自己觉得悦耳，而不要想着是否有人在听；去生活就像这世界就是天堂。 83、对最难以拒绝的人说”不” 你是不是有这样的经历，明明想对他说&quot;NO&quot;，却活生生地把这个字吞到肚子里，回家后又越想越不对劲：&quot;当时应该拒绝他的。&quot;&quot;我怎么这么没用，不敢说出真心话。&quot;你自责不已、悔不当初，最后陷入不安与沮丧中，久久无法释怀。 你为什么无法说”不”?因为你不想得罪人! 但是当我们委屈自己让别人高兴时，他们并没有以同等的好意回报你，甚至已习惯”利用”你。久而久之，你就开始牢骚满腹、抱怨连连，这不只对不起自己，也连累了周围的人，因为你的不快会让他们觉得备受压力。那么YES和NO之间的分寸该如何把握呢?的确，有时候说NO并不容易。 当一个人能够克服”不好意思拒绝”的心理，并具备”拒绝他人”的技巧时，由此而节省的时间将十分可观。 实际上，能真正克服”不好意思拒绝”的心理障碍，并具备拒绝技巧的人并不多。 最好说出拒绝的理由。一旦说出理由，则只需重复拒绝，而不应与之争辩。但不是所有的拒绝都要说明理由，如对频频请托的人和气地说：”对不起，这次我真的无法帮忙，请你别介意。”这样处理，一般不会产生不良的后果。 你自己心里要明白，你拒绝的是他的请托，而不是他这个人。 拒绝之后，若有可能和必要，可为他提供其他途径的帮助。切忌通过第三者拒绝。这样做也许会显示出你的懦弱，或让对方认为你不够诚挚。 84、全力以赴做好手边的事 人生如打牌，既然发牌权不在你手里，那么，你能做的只有用你手里的牌打下去，并努力打好，除此以外，你没有任何选择! “不论你会做什么事或梦想什么事……立刻着手去实现它。胆大就会带来天才、力量和奇迹。” 第一步行动必须由我们开始，如果我们一直站在边缘观望，下不了决心投入其中，全宇宙也会采取相同的态度：”唔，你似乎不怎么认真嘛!等你真正投入时再帮你吧!” 当我们宣称”不管怎样我都非做这件事不可”的同时，”天才、力量、奇迹”也就全部任由我们取用了。 任何有成就的人，都先已下了追求成功的决心。征服珠穆朗玛峰的登山者说：”我要做到这件事。”那些宣称”我要全力以赴”、”我要尽力”、”我要尝试”的人，都有机会比别人先达到目标。不论他们是商人、运动员、一般小市民或家庭主妇，都是如此。我们惟有认真地做一件事，才有可能得到希望的结果。 圣雄甘地的一生充分证明了，当一个人完全投入时，整个国家的历史都可能因而改观。与他同时代的英国政治家狄斯累利说得好：”当一个人全心全意追求一个目标，甚至愿意以生命为赌注时，他是所向无敌的。” 在我们决心投入时，还会发生一些有趣的事。往往只要下定决心就已足够，换言之，当你决定采取行动来达到目标时，并不意味着你一定就会成功。但如果你的态度是半真半假，你可能会面临极为严峻的考验。 有个人是这么说的：”要得到你想要的该这么办–尽你的一切力量。” ###为健康投资 叔本华告诉我们：”在一切幸福中，人的健康胜过其他幸福，我们可以说一个身体健康的乞丐要比疾病缠身的国王幸福得多。” 珍爱生活的人一定珍爱健康。健康，是一生的资本。 健康就是你一旦失去它的时候，才惊觉它曾经存在着。你才知道本来是应该珍惜它的，你才明白过去对健康实在是太忽视了，你才想到健康原来和你竟是那么不可分离。健康哪怕离你一会儿，你就会有很多深切的体验；健康如果永远地离你而去，你也许会觉得整个世界都是没有意义的，都是令人难以忍受的。这就是健康的力量! 知识投资：懂一点医学知识。《黄帝内经》中说：”夫道者年皆百岁。”所谓”道者”就是懂得养生之道的人。培根说：”人对生理卫生知识的了解是一种保健药品。”养生，重在预防。欲想不得病、少得病或得了病能够得到早期诊断和治疗，需要懂得基本的医学保健知识，需要懂得养生之道。古往今来，懂得养生、重视自我保健的人多长寿。 时间投资：花一点时间锻炼。在现实生活中，我们有时会痛心地看到，有些人往往在事业上获得了成功，却丧失了健康，甚至英年早逝。在这些人看来，要想成就事业，就必须以付出健康为代价；欲得健康，势必会使事业受损。可他们忽视了这样一个道理：事业与健康是矛盾的统一体，没有健康的身体，谈何事业?在健康与事业发生矛盾的时候，退一步，可以进两步，一步不退，健康与事业往往同归于尽。 毅力投资：给自己找一点苦吃。健身最重要的因素是经常、适量的运动，最大限度地激活人体各系统、各器官的潜力，促进体质的强化，使身体机能长期处于”最佳状态”。锻是重锤打，炼是烈火烧，有志锻炼者，都要自找苦吃。有调查研究表明，中年人坚持锻炼，能够增寿10～25年。战胜自我，就会品尝到健康之乐。 消费投资：花点钱买个健康。在扑朔迷离的现代养生信息的诱惑面前，有些人跟着广告走，在健康消费方面花了不少冤枉钱。这种步入健身误区的盲目消费，起不到健身的作用。那么如何”花钱买健康”?保健知识是最好的保健品，应舍得花钱购买指导养身保健的书籍和报刊；健身器材是最常用的健身工具，要舍得在这方面酌情”投资”；从健身实际出发，调节饮食，重视食物的合理搭配，要为营养而吃，花钱买营养，而不是花钱买”口福”。 86、到少数民族同胞或外国人家中做客 多姿多彩的少数民族和异域风情令许多人向往不已。那些神秘美丽的民族传说、异国的风俗传统总让人魂牵梦萦。米兰·昆德拉说：生活在别处。当你走入少数民族聚居区或外国友人的家中时，也许会对这句话做出更完美的诠释。 费孝通先生清楚地记得当年他去广西研究少数民族风俗时他的老师对他说的话：要认识自己生活的系统，先要找一个同自己生活习惯不同的社区进行实地观察。从另一种意义上说，到少数民族或外国人家中做客，既可以看到与己不同的生活方式，还能从比较中认识自己的生活方式。 …… 两面是高耸的云杉。走着走着，听到了银铃般的儿童的笑语声。 “同志，同志。”我听到了招呼声，那声音就在我们的头上。 可能是方才太累了，我的眼睛有一点花，抬起头来，看了半天，才在至少三层楼那么高的树顶的枝叶里发现了两个孩子。艾利早与他们搭上话了。 两个哈萨克儿童一男一女。女孩穿得层层片片，花花绿绿，圆圆的像皮球，头上戴的帽子也是鲜艳而浑圆的。男孩穿得十分单薄，依我看来，他像是只穿着单衣裳。他的样子十分灵活，像个猴子，对于这样居高临下与我们谈话似乎颇为得意。 他们回答完了艾利的问题，我依稀听出是告诉艾利他们的家在哪里，有什么人在家之类。 我问：”你们爬这么高做什么?” 我的维语他们听不懂，于是艾利把它们翻成蹩脚的哈语。 “去折干树枝，做柴火。”他们回答。 “为什么不从低处折呢。”我又问。 “低处的已经折过了。” “那么，为什么不去折另外的、低处有枯枝的树呢，在树林里，你们还愁没有柴烧吗?” 艾利翻译过去以后，他们咯咯地笑了起来。艾利插嘴解释说：”也是玩嘛。山里哈萨克的孩子，再不爬爬树，你让他们玩什么呢?没有俱乐部，没有游戏场，也没有幼儿园……” 我点点头。”要当心喽!”我在准备离去的时候大声关照他们。 他们又笑又叫。不用艾利翻译，我就明白，他们在嘲笑我的少见多怪。这些山里的孩子! 走出去不远，在一个避风的山坳里，我们找到了哈萨克牧人的帐篷–一座毡房–孩子的家。只有女主人在，她听见狗叫就出来迎接我们，我们没说什么话径直进了毡房。她也没有说什么话，就去给我们做了奶茶，拿来馕，铺上桌布，耐心地一小碗一小碗地从她的铜茶壶里给我们倒茶，加奶，加盐，调制好再双手端给我们。她还年轻，羞涩的睫毛始终阻挡着她的目光，好像也保护着她自己。但她丝毫不怀疑应该为我们俩服务，更绝不拒绝我们，尽管我们是如此陌生的两个男人，民族又不同，神态又这样可疑，何况我还戴着一副在电影里只有坏人才戴的眼镜。 我有点局促不安。艾利的自我感觉却十分良好。他本身倒是”宾至如归”，他的神态完全像在自己家里，放肆地与我说笑着，大口地喝茶，细细地嚼着馕，喝完一碗立刻就递过去索取另一碗，就像那年轻的哈萨克女人是他的女儿或者儿媳。 茶过三巡，艾利问道：”请问，我的女儿，你们最近没有宰羊么?你们就没有什么肉么?鲜肉、干肉、咸肉或煮熟了的、炒熟了的肉?” 听懂了他维语味儿很浓的这几句哈语的意思以后，我实感大骇，几乎起身逃遁。 艾利给了我一个胸有成竹、自信而又有一定的震慑力的目光，像施用了定身法，把我定在了那里。 哈萨克女人低声地、羞涩地、继续地做了些解释。艾利告诉我，她说，他们昨晚夹到了一只狍子，狍子已经宰掉剥皮弄好，狍子肉是留给一个常常在这一带跑车的哈族司机的。 “算了算了，咱们走吧。”我由盘腿坐着改为一条腿跪起，并且拉动了艾利。 艾利拍拍我的肩膀，示意我稍安毋躁，继续不慌不忙，不躁不馁，和颜悦色地与哈萨克女人讨论”肉”的问题，他的美好的表情好像是给幼儿园的小朋友讲故事。 听到了响动声，两个小朋友完成了打柴任务回来了。小女孩胖乎乎、粉扑扑的笑脸，使人想起无锡惠山泥人”阿福”。男孩果然穿着单衣，一进毡房他就坐在了茶炊与取暖的火炉之间，他妈妈为他往火炉里添了一些柴，用嘴一吹，呼呼呼，立刻火就燃大了，不一会儿，洋铁炉壁就烧得发红了，我们也觉得热了起来。然后，男孩与女孩与他们的妈妈热烈地谈起了话，好像我们这两个客人并不存在。 艾利丝毫不觉得尴尬，颇有兴致地听着他们谈话，他告诉我，他们正在讨论我们：第一，我们两个人是干什么的；第二，我是汉族还是维族。 炉火的温热使艾利打起了哈欠，哈萨克女人与他交谈了两句，马上拿来了两个枕头，一个给艾利，一个给我。 艾利不理会我的表情和抗议，舒舒服服地将头往枕头上一靠，伸开他的腿，立刻响起了他的有福气的鼾声。 我哭笑不得，毫无办法。自己一个人回去吗?连路恐怕都找不到。弄不好不但可能被猎夹打住，还可能喂了狼，更可能迷失在漫漫的白雪碧树里。 心一横，我也躺下了，居然也迷瞪了二十来分钟。 临走的时候，哈萨克女人给我们一块方方的鲜嫩柔软的狍子肉。我说要付钱，艾利用力拽住我的胳臂，几乎把我的小臂扭得脱臼。 87、体验一次军旅生活 如果你没有做一名士兵的经历，那么，找个机会到军营看一看、体验一下也是好的。大学新生总是无法忘记大学生涯之初近一个月的军训经历，因为他们由此学会了人生最重要的课程之一：严于律己，有强烈的责任感和使命感。只有在艰苦的磨炼后，才能体味其中的意义。 在经历严格的纪律约束后，自律会形成一种人生的习惯。正如弗洛姆所说：”如果人的理智能有效地指导我们的行动，我们就不会被不理智的情感所支配。” 我们若想有目的地、有效率地活着，就必须培养自身的自律能力。自律就是为了完成特定的任务而在一定时间内统摄我们行动的能力。一个人若无自律的能力，他就无法充满信心地应付生活的挑战。自律要求人们为了长远的目标而放弃眼前的欢乐，这就是一种将结果投于未来的能力，即目光长远地去思考、筹划、生活。缺少了这种素质，无论是个人生活还是工作事业都不可能有效地运作，更不要提蓬勃发展了。自律关系到人生、事业的成败。也就是说，成功的生活少不了它。若想真正做自己命运的主宰，这是很关键的一环。 有目的的、自律的生活并不意味着我们就不可以花些时间去休息、娱乐，甚至纵情享乐。它只是说我们应有意识地去选择这些活动，应清楚地知道当从事那些活动时，一切都是安全、合适的。无论怎么说，暂时放弃目的本身就是一种目的，无论当时我们是否意识到此，这种目的叫做再生。 而责任是一条无形的鞭子。少年时，也许我们在父母保护下，不曾觉察到它的存在；但当我们有了自立的能力，踏入社会后，责任就一圈又一圈地裹缠在我们身上。 身为人子时，我们只要念好书，考好学校，父母师长就认为很满意；身为人夫时，妻子仰望我们，生活使得我们去开创一个幸福的小家庭，我们不能不去努力赚钱，求得物质上的自尊和舒适。 在人生的路程上，我们的责任只有日益加重，而不会越来越轻!责任越多，表示我们的能力越大，否则别人不敢那样随意地把责任加在我们肩上。 有责任的人生是美好的，每一分每一秒，我们都可以在无声的工作中，感到生活的甜蜜和踏实! 88、利用一切机会汲取知识的营养 徒弟去见师傅。 “师傅!我已经学足了，可以出师了吧?””什么是足了呢?”师傅问。”就是满了，装不下去了。””那么装一大碗石子来吧!” 徒弟照做了。 “满了吗?”师傅问。”满了。” 师傅抓来一把砂，掺入碗里，还没有溢。 “满了吗?”师傅再问。”满了。” 师傅抓起一把石灰，掺入碗里，还没有溢。”满了吗?”师傅再问。”满了。” 师傅又倒了一杯水下去，仍然没有溢出来。 “满了吗?” …… 知识永无止境，学习永不嫌迟。 一天晚上，一群游牧部落的牧民正准备安营扎寨休息的时候，忽然被一束耀眼的光芒所笼罩。他们知道神就要出现了。因此，他们满怀殷切的期盼，恭候着来自上苍的重要旨意。 最后，神终于说话了：”你们要沿路多捡拾一些鹅卵石，把它们放在你们的马褡子里。明天晚上，你们会非常快乐，但也会非常懊悔。” 说完，神就消失了。牧民们感到非常失望，因为他们原本期盼神能够给他们带来无尽的财富和健康长寿，但没想到神却吩咐他们去做这件毫无意义的事。但是不管怎样，那毕竟是神的旨意，他们虽然有些不满，但是仍旧各自捡拾了一些鹅卵石，放在他们的马褡子里。 就这样，他们又走了一天。当夜幕降临，他们开始安营扎寨时，忽然发现他们昨天放进马褡子里的每一颗鹅卵石都变成了钻石。他们高兴极了，同时也懊悔极了，后悔没有捡拾更多的鹅卵石。 “为什么我们非要学习这些没用的东西呢?”学生们常发出这样的抱怨和质疑。而这则故事说明，当你通过学习拥有了知识的时候，它也许只是一个毫不起眼的鹅卵石。但是当你面临危机，需要指引的那一刻，它就会变成弥足珍贵的钻石。知识就是这样，有时你觉得自己学得够多了，已经不再有求知的欲望了，有许多眼前看似鹅卵石一样的知识被你如敝履般地丢弃了–你认为自己已不需要掌握它，然而，忽然有一天，当你急需它的时候，它就变成了钻石，而你却不得不为以前没有捡起这块钻石而懊悔不迭。 你应当记住，除了书本，你每天遇见的每个人，都能增进你的知识。假如遇到一个印刷工人，他能教会你许多印刷的技术；遇到一个建筑工人，他能告诉你建筑方面的技巧；一个普通的农民，有他做人、做事的经验，你能从他那里了解到许多世故和人情。 从每个可能的场所，努力汲取知识的营养，这是使人知识广博的途径。广博的知识，可以使人们胸襟开阔，不致流于狭隘、鄙陋。这样的人，能够从多方面去接触人生、领悟人生。这样的人，是懂得人生况味的。 人的一生，都是受教育的时期。世界就是我们的大学，我们所遇见的人，所接触的事物，所得到的经验，都是这所大学中的教师。只要我们开放自己的心灵，每一分钟都可以摄取许多知识。然后，在空闲的时候，我们可以用深思的方法，将那些零碎的知识整理、组织起来。 成功者和一般人的差别在于，一般人只看到面前的一片天空，而不知道远方还有更高更远的天地值得我们去开拓。知识是永无穷尽的，所以你永远都没有满足的资本。 在我们的人生旅途中，尽量多收集些鹅卵石，那么你终将拥有一个钻石般的未来。 89、从事至少两个行业的工作，多个类型的岗位 你觉得自己会有远大的前程吗?也就是说，你觉得自己有可能被提升吗?或者，前面是不是一条死胡同? 你还想边干边学吗?面对一个无望的职业，你可能不再关心能从工作中学到什么。而在一个令人倾心的工作中，你会找到不断的发展的机会。 你感到工作给你带来快乐了吗? 你觉得自己不再忠实于本职工作了吗? 90、跑完一次马拉松 解除人类的”个人感受”和”利己心”，是一切真正教养的最终目的。利己之心虽是所有生物基于自我生存的欲望而产生的，但却与生命的目的相反。 人生的过程本质上是因拥有感受而开始的，但在我们结束人生之前，精神方面必须有所成就，亦即希望能以更优惠的条件，在永恒的未来世界中，将此过程延续下去。 因此，人类与生俱来的性格中，一开始就潜藏着一种矛盾纠葛。那是实际存在之物(本能和感受)，即想要彻底维持天性的自然资质，和存在于内心深处对至善的向往两者之间的纠葛。 胜利不仅影响个人目前的生活，也会改变一个人的未来。胜利创造了自信并成就了更高尚的情操。就其本身而言，是一件礼物，带来认知与赞许的回报。幼年时期的竞争是成人社会竞争的雏形。另外，由于竞争的刺激，更可以激发一个人做出极限以外的事情。换言之，胜利就是表现出你最好的一面，寻找更好的机会可以让你表现技巧，发挥潜能。人们有胜利的需要，也有测验自己能力的需要。然而，竞争并非要你从他人身上取巧或刻意和他人比较。事实上，由于竞争，可以使人们从努力中获得更丰富的体验，如果你更肯定及支持自己，你就会有一个更强烈的自我形象，你对胜利的观念将更明晰，并能在自我意识中增加关心他人的意念。你的自我肯定使自信心加强，因而能参与更多的竞争而不被摧毁。 当我们在竞争中受到惊吓，感到不知所措或者劳累不堪时，很容易忘掉自身的价值和个人的成就而去嫉妒他人。我们否认了自己的优点和长处，而高估了别人。我们过于苛刻地判断自己，消极地把自己与别人相比。 如果我们善于自我肯定，就会对自己有一个全新的看法。那么”在竞争中取胜”的涵义就会被注入更多的内容：倾尽全部力量，敢于面对挑战，满腔热情地爱别人，并使自身的潜能得到淋漓尽致的发挥。竞争是好现象，它鞭策你、激励你，当你和自己竞争时，亦能从中不断地超越自我。 91、投稿，并在自己最喜欢的报刊上发表一篇文章 现在，就把你的经历、你的思想、你的感叹用文字记录下来吧!然后，把它投给你最喜欢的报刊!你没有理由不相信你的文字会变为铅字，因为你没有理由相信&quot;不可能&quot;。 你不必像文人们那样笔耕不辍。投一次稿，只是为了向自己证明：我行，只要我行动，凡事皆有可能。 五大洲的400多位作家，对”你为什么写作”这个问题的回答可以说是五花八门的。 中国大陆作家巴金的回答是：”我以文学改造我的生命、我的环境、我的精神世界。” 台湾作家陈映真的回答是：”为了让被侮辱的人重获自由尊严。” 诺贝尔文学奖获得者、哥伦比亚作家马尔克斯回答说：”我写作是要我的朋友爱我更久。” 英国作家格林回答说：”我长了个疮，熟了，我把它挤掉。写作就是这么回事。” 我们怀着虔诚的心情阅读文豪巨匠留下的宝贵精神财富；我们崇拜他们、仰视他们。”我也想在报刊上发表一篇文章。”你产生过这样的想法吗?我相信你有过，因为我也有过。接下来，你一定会笑自己：”这怎么可能呢?”于是，你连拿起笔的勇气都没有了。 93、学会做几样拿手菜 你会做菜吗?你有拿手菜吗? 如果没有，赶快学!!! 原因有三：一是为人。有朋自远方来，亲自下厨做几道拿手好菜，小酌几杯，不亦乐乎!假日拜望父母，做几盘好菜，煲一锅浓汤，片片孝心，浓浓亲情，会随着菜香飘至家人的心头。二是为己。说不定哪一天，形单影只，独自在家，煮方便面吗?惨!做几碟小菜，慢慢享用，再泡一壶清茶，对月品茗，美哉!三是为乐。体验过厨房之乐吗?一片片、一段段、一块块的菜料从刀下切出来，阵阵菜香从锅内飘出来，一盘盘色香味俱全的佳肴从自己手中端到餐桌上，是一种成功的快乐，会有一种无法言表的满足。怎么样，动心了吗?为你的爱人，为你的朋友，为你的长辈、为你自己做几道拿手菜，温馨感觉会永远萦绕在心头，成为永远的回忆。 94、寻找适合你的娱乐及健身方式 人生苦短，为什么不善待自己，使自己沐浴在闲散、休闲的轻松之中？为什么不潇洒地活跃于运动场上，让汗水和欢颜辉映你生命的笑容？ 95、保持宜人的微笑 每天你都可以使自己成为一个崭新的人：带着微笑起床、带着微笑出门；独处时保持微笑、与人相遇时向对方微笑；工作时微笑、休闲时也微笑--这些都是好习惯。 微笑，是一种你可以付出的快乐。 从前人们碰到一起， 打招呼时说的是：”吃了吗?” 后来，路遇，改成了：”你好!” 今天相逢，在相当一部分人口中，又变成：”活得快乐点儿!” 由物质到精神，关怀的内容发生了本质的变化。 然而，快乐的理由呢? 甭管他们男人，我问过许多女同胞。相同的回答差不多都是：”享受生活呀。”不同的是她们有各自的源泉– 一个老太太，已垂垂老到走路不能自如的境地，还坚持在景山公园的台阶上，一级一级地往上蹭。她的脸上阳光灿烂：”这是我每天最快乐的事呀。” 一个女友，整天在办公室忙碌，无非打印个文件，收收发发，很琐碎，往身后一看什么都留不下。可一到休息日，她就闲得忧郁，叨唠说：”工作能使我快乐。” 一个操劳了一辈子的母亲，不穿金，不戴银，不吃补品，不当王母娘娘，每日依然辛劳不辍，笑呵呵回答儿女们的是：”全家平平安安的，比什么都让我快乐。” 一个下岗女工：”谁能给我一份工作，我可快乐死了。” 一个小保姆：”主人家信任我，不见外，我就觉得快乐。” 一个小女生：”哎呀呀，星期天早上能让我睡够了，最快乐!” 至于我自己呢?每当坐在电脑前写作，心里就流淌出一条喜悦的大河，别人以为我整天点灯熬油的那么苦，玩什么命呢?殊不知，写作是灵魂的寄居所，是生命的停泊地，这是我生活全天候中最快乐的时光。 生活是世界上最难的一道题，复杂得永远解不清；可是生活又简单得像一颗透明的水滴，一首诗，一支歌，一朵小花，一片绿叶，一只小动物……就能让我们快乐得如同仙女一样飘起来，一直飘向天国。 人心则是最遥不可测的欲海，有了电视机，还想要电冰箱、洗衣机、手机、空调、汽车、房子、别墅……然而人心也是最容易满足的乖孩子，一句宽心的话，一张温暖的笑靥，一个会心的眼神，一声真诚的问候，一个善良的祝福……就是一根根棒棒糖一颗颗开心果，也能一直香甜到我们心里，使我们回到快乐的童年，小鸟一样”叽叽喳喳”地唱不够。 史蒂文生说：”快乐并不总是幸运的结果，它常常是一种德行，一种英勇的德行。” 快乐起来的理由有万万千千，关键是–要时时刻刻给自己加油、鼓劲! 96、创一次业，无论成功与否 如果你想做个创业者，是需要一定资金投入的，不管投入多少，都是自己的，因此一定要认真对待。要有把自己投入的1000元当做100万元来对待的敬业精神，并且像对待自己的亲生儿子一样。这样，你才能倾注心力照顾好自己的儿子，而不会白白地失去投入的资金，任其亏蚀。 有一位年轻的母亲，把仅两岁的儿子哄睡着了，就去附近的菜市场买菜。当她急匆匆赶回家的时候，在楼下向家的窗户望了一眼，不禁惊得大叫起来，她的儿子正伏在四楼的窗台上，小小的身体快掉下来了。 她拼命地向前跑，刚好在儿子掉下来的一刹那，跑到了楼下，不顾一切地伸出双臂稳稳地把儿子接住了。 这件事立即轰动了当地，电视台记者赶来了，要把这人间的奇迹摄下来。这位母亲惊恐地摇摇头，死也不干。后来，记者说：”不是让你的儿子重新来过。只是找只娃娃从四楼扔下来，你再去接住。”这位母亲同意了。但是，一次，二次，三次，布娃娃都掉在了地上。 还是这位母亲吐露了真心话：因为孩子不是自己的，而且又是假的。 记住这个故事，它告诉你，在创业过程中，要像对待自己的孩子一样，珍惜你的每一分投入。 60多岁的沃尔逊先生从政府机构退休后，便迷上了电视台播放的”探索自然”节目。有一天，电视台播出了一个关于月球探秘的纪录片，荧屏上，主持人手拿月球地图，一边向观众讲解，一边翻动着一页页相关的图片。 沃尔逊先生心想，这样看月球的平面图实在太费劲，也不够直观。地球和月球一样都是圆的，既然能将地球制成地球仪，那么为何不能把月球制成月球仪呢?沃尔逊先生抓住这瞬间产生的灵感，决定把剩余的精力投在月球仪的开发上。 1969年3月，第一批精美的月球仪制作好后，沃尔逊先生亲自撰写了广告词，并在电视台播出。结果，正如他所预料的那样，世界各地的订单随即滚滚而来。之后，沃尔逊先生每年都可得到1400多万英镑的生意，并且先后开发了火星仪、金星仪、土星仪、木星仪等系列产品，使家庭工厂逐步成长为世界性的大企业。 一位60多岁的老人仍能有如此的开拓精神，并因此成就了一番大事业，那么，你何必要慨叹没有创业机会呢? 许多人几乎天天都在动脑筋找寻新的事业投资良机。要创业成功，除去天时、地利、人和等背景因素外，还要不断吸取以往成功人士的经验，特别要富有自己的创意。在创业初期，创业者应规划的细节包括： 重视并评估自己的财务能力。企业是由人才、产品和资金所组成的，自有资金不足，往往会导致创业者的利息负担过重，无法成就事业。因此，创业者要有”有多少实力做多少事”的观念，不要过度举债经营；企业应”做大”而非”大做”，”做大”是有利润后再逐渐扩大，”大做”则是勉力举债而为，只有空壳没有实际，遇到风险必然失败。 慎选行业。创业要选择自己熟悉又专精的事业，初期可以小本经营或找股东合作，按照创业计划逐步拓展。 要有长期的规划。企业的发展，”稳健”永远比”成长”重要，因此要有跑马拉松的耐力及准备，不可存有抢短线的投机做法。 先求生存。企业应先求生存再发展，扎好根基，勿好高骛远、贪图业绩、不顾风险，必须重视经营体制，步步为营，再求创造利润，进而扩大经营。 精兵出击。公司初期规模必须精简、有效率、重实质，不要一味追求表面的浮华，以免徒增费用。 要有意志力。有年度计划，有目标，有理想，就必须要有坚强的耐心与意志力来贯彻，越挫越勇，不达目标绝不中止。 策略联盟。创业要讲求战略，小企业更需要与同业联盟，也就是在自有产品之外，附带推销其他相关产品。用”策略联盟”的方式结合相关产业，不仅能提高产品的吸引力，满足顾客的需求，而且能增加自己的竞争力与收益。 有前瞻性规划。经营理念、经营方针、经营策略均需详加规划，结合智慧与力量，扎好企业根基。总而言之，创业前应先调适心理，做好自我评估，了解自己究竟适不适合创业，一旦走上创业之路，就应好好努力，掌握各项创业的原则，这样不管你在何时何地，都将是一个成功而快乐的创业者。 97、想像生命的最后一刻 如果我们永远不死，我们反而会成为十分不幸的人。当然，死是很痛苦的，但是，当我们想到我们不能永远活下去，想到还有一种更美好的生活将结束今生的痛苦时，我们就会感到轻松。如果有人允许我们在这个世界上长生不死，请问谁愿意接受这个不祥的礼物?我们还有什么办法、什么希望和什么安慰可以用来对付那命运的严酷和人的不公正的行为?愚人是没有远见的，他不知道生命的价值，所以也就不怕丢失他的生命；智者可以看到更贵重的财富，所以宁愿要那种财富而不要生命。只有不求甚解和假聪明的人才只看到死，而看不到死以后的情景，因而把死看做是最大的痛苦。在明智的人看来，正是因为必然要死，所以才有理由忍受生活中的痛苦。 98、到每年的岁末，检视自己一年来的行为（反省） 99、写下遗嘱，死后捐献有用的器官","tags":[{"name":"杂谈","slug":"杂谈","permalink":"http://iherr.cn/tags/杂谈/"}]},{"title":"代码版本控制","date":"2016-06-19T09:24:03.000Z","path":"2016/06/19/代码版本控制/","text":"代码版本控制在git中如果想忽略掉某个文件，不让这个文件提交到版本库中，可以使用修改根目录中 .gitignore 文件的方法（如无，则需自己手工建立此文件）。这个文件每一行保存了一个匹配的规则例如： 此为注释 – 将被 Git 忽略.a # 忽略所有 .a 结尾的文件!lib.a # 但 lib.a 除外/TODO # 仅仅忽略项目根目录下的 TODO 文件，不包括 subdir/TODObuild/ # 忽略 build/ 目录下的所有文件doc/.txt # 会忽略 doc/notes.txt 但不包括 doc/server/arch.txt规则很简单，不做过多解释，但是有时候在项目开发过程中，突然心血来潮想把某些目录或文件加入忽略规则，按照上述方法定义后发现并未生效，原因是.gitignore只能忽略那些原来没有被track的文件，如果某些文件已经被纳入了版本管理中，则修改.gitignore是无效的。那么解决方法就是先把本地缓存删除（改变成未track状态），然后再提交： git rm -r –cached .git add .git commit -m ‘update .gitignore’ https://git-scm.com 官方, 命令行版本 Git 通过命令行创建一个新的版本库 touch README.md git init git add README.md git commit -m “first commit” git remote add origin ssh://herongrong@192.168.3.22:29418/test.git git push -u origin master 通过命令行推送一个已存在的版本库 git remote add origin ssh://herongrong@192.168.3.22:29418/test.git git push -u origin master","tags":[{"name":"SVN Git","slug":"SVN-Git","permalink":"http://iherr.cn/tags/SVN-Git/"}]},{"title":"ios开发证书技巧","date":"2016-05-30T05:04:06.000Z","path":"2016/05/30/ios开发证书技巧/","text":"开发证书，其实挺简单的，但如果某处搞不好，也是很费时间的。且member center里的内容虽说万变不离其宗，但几年下来终归还是有变化的。完整的流程我就不写了，可以自行百度大把文章，这边谈谈证书使用的小技巧。 证书制作流程图 对于概念不懂的同学，可以到这脑补下『iOS Provisioning Profile(Certificate)与Code Signing详解』 关于Provisioning Profile供应配置管理我们在项目配置时，虽然经常将Code Signing的Provisioning Profile配置成”Automatic”，但还是需要去developer.apple.com上下载所有的mobileprovision文件。如果这些文件经常变化，可以这样： 首先cd到这些mobileprovision文件的目录”~/Library/MobileDevice/Provisioning Profiles”，然后删除所有的文件。可使用命令 $ rm *.mobileprovision 这样再看Xcode的时候，就找不到任何provisioning profile了。这个时候不需要一个一个的添加。而是访问XCode的Preferences&gt; Accounts，在Apple IDs里面找到你的帐号，右下角有个View Details，这时，你就可以download下所有网站上配置的文件了。一个按钮搞定。","tags":[{"name":"iOS","slug":"iOS","permalink":"http://iherr.cn/tags/iOS/"}]},{"title":"xcode runsript案例","date":"2016-05-20T03:53:34.000Z","path":"2016/05/20/xcode-runsript案例/","text":"runscript介绍在我理解，runscript是在app编译时，通知xcode额外做的事情，可以通过script编写脚本来实现。 runscript案例1-appledocappledoc是我们较为常用的文档生成工具，『github地址传送门』 安装方法请执行： 123$ git clone git://github.com/tomaz/appledoc.git$ cd appledoc$ sudo sh install-appledoc.sh 安装完成后，我们想着每次在编译ios app时，都能自动生成文档。 在项目中新建一个target，选择如下图所示的类别。这样会在项目中多出一个target。 对该target的Build Phases上添加run script phrase。 为了自动生成文档，需要使用appledoc的生成命令，可供粘贴。如果对命令不熟练，也可以使用appledoc –help进行查看。 script脚本如下，供copy。需要注意的是outputPath，为文档的输出路径。ignore，可以选择不生成某些路径下的文档。最后的参数，”{PROJECT_DIR}/runscript)”，需要根据自己需要生成的项目做调整。 12345678910111213141516171819202122232425262728#appledoc Xcode script# Start constantscompany=\"herr\";companyID=\"com.herr\";companyURL=\"http://iherr.cn\";target=\"iphoneos\";#target=\"macosx\";outputPath=\"$&#123;PROJECT_DIR&#125;\"/Doc;# End constants/usr/local/bin/appledoc \\--project-name \"$&#123;PROJECT_NAME&#125;\" \\--project-company \"$&#123;company&#125;\" \\--company-id \"$&#123;companyID&#125;\" \\--docset-atom-filename \"$&#123;company&#125;.atom\" \\--docset-feed-url \"$&#123;companyURL&#125;/$&#123;company&#125;/%DOCSETATOMFILENAME\" \\--docset-package-url \"$&#123;companyURL&#125;/$&#123;company&#125;/%DOCSETPACKAGEFILENAME\" \\--docset-fallback-url \"$&#123;companyURL&#125;/$&#123;company&#125;\" \\--output \"$&#123;outputPath&#125;\" \\--ignore \"$&#123;PROJECT_DIR&#125;\"/runscript/Libs \\--publish-docset \\--docset-platform-family \"$&#123;target&#125;\" \\--logformat xcode \\--keep-intermediate-files \\--no-repeat-first-par \\--no-warn-invalid-crossref \\--exit-threshold 2 \\\"$&#123;PROJECT_DIR&#125;\"/runscript 完成后，编译运行，可以在xcode上看到编译结果。里面有run script的执行情况，当然可以在script中使用printf来打印，也同样会在这里显示。 这样，我们可以在项目目录的doc文件夹里找到生成的文档，或者到xcode的window的Documentations and API Reference里查看。 另外，文档的生成需要平时对项目的注释进行规范书写，这里不再赘述。 runscript案例2-对icon添加版本号等信息一直以来，做测试时都要区分版本号、git的提交序列、服务器测试还是正式环境等问题，想着在编译时，自动将这些信息贴在app的icon上就好了。直到在github上碰到了这个项目『github地址传送门』。 作者编写了个脚本，获取项目的版本号、git的提交序列等信息，然后使用imagemagick和ghostscript将这些信息绘制在了app的icon里。如果本地机器没有安装，则需要使用brew命令一键安装。 12$ brew install imagemagick$ brew install ghostscript 当使用debug模式进行编译时，则会出现如下的logo。当然，如果是release模式打包，则不会出现，具体可以参考runscrip脚本『iconVersioning.sh』 在此基础上，我们还可以将应用服务器测试还是正式环境等其他参数都加到icon上，方便对产品进行标示。","tags":[{"name":"iOS","slug":"iOS","permalink":"http://iherr.cn/tags/iOS/"}]},{"title":"CocoaPods使用","date":"2016-05-10T03:22:03.000Z","path":"2016/05/10/CocoaPods使用/","text":"关于ruby、gem和brew（如已安装可跳过）ruby，一种脚本语言，和python类似。Mac OS X上自带。gem，是个用ruby写的应用程序，用来安装软件包的程序。brew，又叫Homebrew，是Mac OSX上的软件包管理工具，能使用命令在Mac中方便的安装软件或者卸载软件。 安装和卸载brewinstall brew $ ruby -e &quot;$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)&quot; remove brew（有时出问题需要卸载后再安装） $ ruby -e &quot;$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/uninstall)&quot; 升级mac自带ruby（使用RVM,需要brew支持）系统自带ruby一般较老，可以使用RVM进行升级。 $ curl -L get.rvm.io | bash -s stable 载入 RVM 环境 $ source ~/.rvm/scripts/rvm 检查一下是否安装正确 $ rvm -v 列出已知的ruby版本 $ rvm list known 安装目前最新的2.3版本 $ rvm install 2.3 查看ruby和gem版本 $ ruby -v ruby 2.3.0p0 (2015-12-25 revision 53290) [x86_64-darwin15] $ gem -v 2.5.1 如果需要单独更新gem $ sudo gem update --system gem源更新，目前官方默认的地址被墙，使用淘宝镜像替换 $ gem source -r https://rubygems.org/ $ gem source -a https://ruby.taobao.org $ gem sources -l *** CURRENT SOURCES *** https://ruby.taobao.org/ 好啦。环境准备结束。 CocoaPods安装官网地址：『https://www.cocoapods.org』 比较权威的参考。 用gem安装下就好。 $ sudo gem install cocoapods 看下pod是否安装成功。 $ pod --version 1.0.1 安装成功后，是需要同步pod repo的。因此可使用以下命令同步（此步骤推荐先跳过，建议后续更换pod repo源）。 $ pod setup CocoaPods使用 为新建工程或在现有工程添加CocoaPods，cd到工程目录 $ cd &apos;your project home dir&apos; $ pod init 会自动生成Podfile文件，当然你也可以使用vim命令自己建。 $ vim Podfile 编辑Podfile，写入您需要的第三方库以及版本。小提示：（终端vim文件 按 i 可编辑 ，esc 退出编辑，:wq 可保存退出）。当然，您也完全可以通过Xcode和其他文本编辑器来进行。例如，给项目名为Test的添加AFNetworking和FMDB。 platform :ios, &apos;6.0&apos; target &apos;Test&apos; do pod &apos;AFNetworking&apos;, &apos;~&gt; 3.0&apos; pod &apos;FMDB&apos; end 安装导入第三方库 $ pod install 当然可可以指定安装某第三方库 $ pod install AFNetworking 当需要进行第三方库版本更新时，使用 $ pod update 当然可可以指定安装某第三方库 $ pod update AFNetworking 当需要查找某个第三方库信息时，例如查找AFNetworking，使用 $ pod search AFNetworking 注意，1.0版本pod进入查询后如需要退出，可输入 q + 回车。 有时操作时想print安装信息，可在所有命令后加–verbose。例如 $ pod install --verbose 在CocoaPods1.0以前，所有命令会默认自动执行pod repo update的，每次执行太恐怖了，可在所有命令后加–no-repo-update。会加快执行效率。例如 $ pod install --no-repo-update --verbose 但是在1.0版本以后，默认是不执行的。因此可以忽略掉。 CocoaPods的git仓库更新cocoapods有一个git仓库专门保存了github上一些有名的开源组件的podspec文件。cocoapods会把它clone到你本地的~/.cocoapods/repo/master路径下。当你pod search一个内容时，就在这个本地目录下进行搜索。 由于三方库版本更新，我们使用pod无法install、search到最新版本的内容，就需要进行git仓库的更新。我们可以使用如下命令进行更新： $ pod repo update --verbose 我们可以cd到pod repo目录里，用du -sh *命令来查看文件大小，每隔几分钟查看一次，看看是否有大小变化。笔者目前该目录大概700多M。 当使用上述命令时，会更新的非常慢，通过命令查询，发现托管到github上，有时也会被墙。 $ pod repo master - Type: git (master) - URL: https://github.com/CocoaPods/Specs.git - Path: /Users/herr/.cocoapods/repos/master 1 repo 如果大家不想被这个烦死的话，还是找找国内的镜像吧。 gitcafe（目前迁移到coding.net）和oschina都是国内的服务器，可以用它们CocoaPods索引库的镜像。目前发现oschina的http://git.oschina.net/akuandev/Specs.git更新较慢，于是还是使用coding.net上的吧，发现更好的随时替换，我对现在5MiB的速度还是很满意的。 $ pod repo remove master $ pod repo add master https://git.coding.net/hging/Specs.git $ git clone https://git.coding.net/hging/Specs.git ~/.cocoapods/repos/master $ pod repo update 再使用pod repo查看下，检查源的URL是否变更。 如果哪天发现更新后还不是最新的，可以登录我们刚刚配置的源地址『https://coding.net/u/hging/p/Specs/git』查看更新时间，如果较为久远，再去更换源。 高级进阶-CocoaPods私有库管理私有库管理，主要用于自己的代码，也想像pod管理第三方库一样进行管理。官方的文档如下，后续有时间再演示一遍整个流程。『http://guides.cocoapods.org/syntax/podspec.html』","tags":[{"name":"CocoaPods、iOS","slug":"CocoaPods、iOS","permalink":"http://iherr.cn/tags/CocoaPods、iOS/"}]},{"title":"初识Markdown","date":"2016-04-19T10:22:03.000Z","path":"2016/04/19/初识Markdown/","text":"Markdown使用场景以前只在github上接触了下md文件，遇到倒是简单，也通用。如今自己搭建博客，便得系统的了解下Markdown了。 说到使用场景，基本有以下几种： 需维护型文档：文档需要在多平台使用，如wiki平台、同事传阅、网站发布等。一般文档常用Word来写，但是如果文档一需要在网上发布就麻烦了，格式没有跟过来。如果一开始就是markdown语法，可以通用解决。 项目文档：项目文档一般都是用md来写的，github的项目的Readme.md就是markdown文档。 创意简历、博客：还有一种装逼手段就是用markdown来编写博客和简历，那绝对是创意来着的哦，适合程序员。 Markdown语法语法这玩意，我也是现学，找到一篇Markdown的文章，可以参考『Markdown 语法说明』 Markdown工具提到Markdown工具，作为一名简书控，平常写文章时，便使用的简书在线的Markdown编辑器了。想到这玩意还要联网就觉得写博客的场景不太适用。推荐『MacDown』，试了下对照预览、插入链接(Command+Shift+K)、图片(Command+Shift+I)，都还算方便。我在写这篇博文时的使用截图，如下图所示。 好啦，这玩意够用就好。不需要太精通。","tags":[{"name":"Markdown","slug":"Markdown","permalink":"http://iherr.cn/tags/Markdown/"}]},{"title":"第一篇博客","date":"2016-04-15T11:23:13.000Z","path":"2016/04/15/第一篇博客/","text":"终于用『Hexo』搭建完博客，感谢Litten提供的Yilia主题，真是爱不释手。以后，这里就是我的小窝啦。 先把整个流程梳理一遍，算是个hello world吧。 安装Hexo安装可以参考如下命令，blog为文件夹目录，可自己定义。如果提示npm没装，需要先安装npm。 12345$ npm install hexo-cli -g$ hexo init blog$ cd blog$ npm install$ hexo server 换个主题说实话，hexo默认给的主题，只能是凑活。如果要逼格高一点，那就得自己动手了。hexo官网有推荐一些『Theme』，可以链接到github上下载，现在使用的『Yilia主题』的资源可以点击查看。把他clone到本地，保存在目录/themes下即可。下图是我自己目前保存的一些主题。 那怎么实施主题的切换呢？可打开根目录的_config.yml配置文件，找到“theme: ”这一行，修改成/themes的对应主题名称即可。例如“theme: yilia”。 添加文章1$ hexo new \"My New Post\" More info: 『添加文章』 静态文件生成1$ hexo g 命令执行完成后，会更新public目录下的文件，都是一些静态的html、css、js、img之类的。 More info: 『静态文件生成』 启动本地服务1$ hexo s 启动完成后，会提示您访问的地址为http://localhost:4000/，如下图所示，你就可以在浏览器上访问啦。 More info: 『启动本地服务』 静态页面托管到GitHub Pages以上，您只能在本地浏览自己的博客，那如果需要放到网上供他人浏览呢？其实这里的方法有很多，比如自己弄台VPS云服务器等，但这不是有成本嘛。像阿里云最低配的基本也是需要100RMB/月，放博客不划算。 其实大家一般都推荐使用『GitHub Pages』来进行托管，无非是把“生成静态文件”步骤的文件上传到github上。具体的流程可以参考官网。唯一需要注意的是，托管的项目名称，必须以你的github的用户名起，例如我的github用户名是nisoch，那么我简历的项目名就是nisoch.github.io，后续上传后访问的地址也是https://nisoch.github.io/。 好啦，可以把这个地址发给小伙伴，或者自己访问了。 域名跳转看到其他大神的博客，都是有自己的域名，叫人好生羡慕。那么，从哪里才能弄到呢？这里不是做广告，而是我自己的域名是从『阿里云的万网』买的，购买域名的途径也很多其他途径，其实有一些很好的国际域名，例如『Godaddy』。 域名也买到了，开始做跳转指向了。无非是把刚买的宝贝域名，链接到GitHub Pages的域名上。 还是以万网举例，对CNAME类型，将www和@都指向自己的GitHub Pages的域名。如下图所示。 另外，为了保证GitHub Pages上能够识别，还需要一个CNAME文件，没有后缀，里面的内容为我们购买的域名地址，例如我的就是iherr.cn。 好啦，打完收工，可以使用自己的个性域名来访问了，快来试试吧。 补充：图片等资源处理刚写两篇，发现处理图片等资源好麻烦，我在macdown上进行编辑时预览插入图片，hexo g自动生成后，发现图片没有到/public里面去，当然在发布时还需要手动挪动图片，真是鱼和熊掌不可兼得嘛？ 看了下官方文档的『asset-folders』，原来提供了一种方便的方式。 首先在_config.yml配置文件中设置支持post_asset_folder， post_asset_folder: true。 针对之前没有配置的文档，需要在source/_posts目录下，手动新建一个同名标题的文件夹，例如md文件为“第一篇博客.md”，那就新建一个“第一篇博客”的文件夹。 针对后续的博文，直接使用hexo new “xxx”，即可同时生成md文件和同名文件夹，将这篇博文所有的需要用到的图片放入，引用图片时，链接的路径为“(文件夹名/*.png)”，满足本地写作时预览的需要。 当发布时，hexo g命令生成后，会发现会自动将图片放到发布的静态文件夹，且图片路径有了完美的生成。 添加百度统计真是拿做商业网站的规则来写博客呀，还是加个百度统计吧，虽然也没多少人看，也不需要分析。 编辑文件 themes/yilia/_config.yml,添加一行配置，可以删除原来的google analytics 1baidu_tongji: true 新建 themes/yilia/layout/_partial/baidu_tongji.ejs,内容如下 12345678910 &lt;% if (theme.baidu_tongji) &#123; %&gt; &lt;script type=\"text/javascript\"&gt; #申请的百度统计代码 &lt;/script&gt; &lt;% &#125; %&gt;``` 编辑themes/yilia/layout/_partial/head.ejs 在 &lt;/head&gt; 前添加``` bash &lt;%- partial(\"baidu_tongji\") %&gt; 添加打赏擦，我的内心还是很不愿意加这个功能的，纯粹娱乐下。参考github上的项目，『github传送门』。 模仿刚刚百度统计的套路，增加了个award.ejs，然后同样在head.ejs里添加。award.ejs的代码如下： &lt;% if (theme.baidu_tongji) { %&gt; &lt;script type=\"text/javascript\"&gt; window.tctipConfig = { staticPrefix: \"http://static.tctip.com\", buttonImageId: 1, buttonTip: \"zanzhu\", list:{ alipay: {qrimg: \"http://tctip.com/img/alipayqr.png\"}, weixin:{qrimg: \"http://littlebtc.com/images/yeshen.png\"}, } }; &lt;/script&gt; &lt;script src=\"http://static.tctip.com/js/tctip.min.js\"&gt;&lt;/script&gt; &lt;% } %&gt;","tags":[{"name":"杂谈","slug":"杂谈","permalink":"http://iherr.cn/tags/杂谈/"}]}]